import { Fault, SubSystem } from './types';

export const subSystems: SubSystem[] = [
  { id: 'SS01', name: 'MAIN POWER' },
  { id: 'SS02', name: 'TRACTION BOGIE 1' },
  { id: 'SS03', name: 'TRACTION BOGIE 2' },
  { id: 'SS04', name: 'HARMONIC FILTER' },
  { id: 'SS05', name: 'HOTEL LOAD' },
  { id: 'SS06', name: 'AUX-CONVERTER 1' },
  { id: 'SS07', name: 'AUX-CONVERTER 2' },
  { id: 'SS08', name: 'AUX-CONVERTER 3' },
  { id: 'SS09', name: 'BATTERY SYSTEM' },
  { id: 'SS10', name: 'BRAKE SYSTEM' },
  { id: 'SS11', name: 'AUXILIARIES HB 1' },
  { id: 'SS12', name: 'AUXILIARIES HB 2' },
  { id: 'SS13', name: 'CAB 1' },
  { id: 'SS14', name: 'CAB 2' },
  { id: 'SS15', name: 'FIRE DETECTION UNIT' },
  { id: 'SS16', name: 'SPEEDOMETER' },
  { id: 'SS17', name: 'FLG1 / ICP1' },
  { id: 'SS18', name: 'FLG2 / ICP2' },
  { id: 'SS19', name: 'TRAIN BUS' },
];

export const faults: Fault[] = [
  {
    id: 'F0101P1',
    subSystem: 'SS01',
    message: 'VCB STUCK IN ON POSITION\nLoco will be shut down',
    lamp: 'LSDJ प्रकाशित नहीं होगा, LSFI ब्लिंक (टिमटिमाना) करेगी और BPFA प्रकाशित होगा',
    effect: 'SR कान्टेक्टर खुल जायेंगे (होटल लोड / कनवर्टर) पेन्टोग्राफ लोअर होगा',
    actions: [
      'थ्रोटल को “ 0 ” पर लाएं। BPFA दबाकर फॉल्ट ACK करें।',
      'कोस्टिंग करते हुए ब्लॉक सेक्शन क्लियर करें।',
      'लोको को खड़ा करें।',
      'कंट्रोल इलेक्ट्रॉनिक्स को ऑफ करके ऑन करें {कंट्रोल इलेक्ट्रॉनिक्स को ऑफ करके ऑन करने की विधि पेज सं. 74/75 पर दी गई है}। यदि LSDJ प्रकाशित होता है तो:-',
      'पैंटो को उठाएं और VCB क्लोज करें और ट्रैक्शन चालू करें।',
      'यदि सफलता नहीं मिलती तो दूसरी कैब से प्रयत्न करें।'
    ]
  },
  {
    id: 'F0101P1-DEAD',
    subSystem: 'SS01',
    message: 'MAIN POWER ISOLATED\nVCB Inhibited Loco is dead',
    lamp: 'LSDJ और BPFA प्रकाशित होंगे, LSFI ब्लिंक करेगी',
    effect: 'मेन पावर आइसोलेट होगी, VCB क्लोज होना बाधित (Inhibited), लोको डेड (Loco is dead)',
    actions: [
      'कंट्रोल इलेक्ट्रॉनिक्स को ऑफ करके फिर से ऑन करें, सफलता मिलने पर ट्रैक्शन चालू करें।',
      'सफलता न मिलने पर 20 मिनट के अंदर सहायता इंजन की मांग करें।'
    ]
  },
  {
    id: 'F0102P1',
    subSystem: 'SS01',
    message: 'VCB STUCK IN OFF POSITION\nTry to close VCB again',
    lamp: 'LSDJ और BPFA प्रकाशित होंगे, LSFI ब्लिंक करेगी',
    effect: 'VCB control changed to redundant processor',
    actions: [
      'थ्रोटल को “ 0 ” पर लाएं। BPFA दबाकर फॉल्ट ACK करें।',
      'VCB COC खुला होना सुनिश्चित करें।',
      'VCB क्लोज करने के लिए BLDJ को प्रेस करें।',
      'यदि VCB क्लोज होता है तो ट्रैक्शन चालू करें।',
      'अन्यथा यदि संभव हो तो कोस्टिंग करते हुए ब्लॉक सेक्शन क्लियर करें और लोको को खड़ा करें।',
      'कंट्रोल इलेक्ट्रॉनिक्स को ऑफ करके ऑन करें।',
      'पैंटो उठाएं तथा VCB क्लोज करें। ट्रैक्शन चालू करें।',
      'यदि सफलता नहीं मिलती तो दूसरी कैब से प्रयत्न करें।'
    ]
  },
  {
    id: 'F0102P1-DEAD',
    subSystem: 'SS01',
    message: 'MAIN POWER ISOLATED\nVCB Inhibited Loco is dead',
    lamp: 'LSDJ और BPFA प्रकाशित होंगे, LSFI ब्लिंक करेगी',
    effect: 'मेन पावर आइसोलेट होगी, VCB क्लोज होना बाधित (Inhibited), लोको डेड (Loco is dead)',
    actions: [
      'एक बार पुनः कंट्रोल इलेक्ट्रॉनिक्स को ऑफ कर फिर से ऑन करें, ट्रैक्शन चालू करने का प्रयत्न करें।',
      'सफलता न मिलने पर 20 मिनट के अंदर सहायता इंजन की मांग करें।'
    ]
  },
  {
    id: 'F0101P2',
    subSystem: 'SS01',
    message: 'OVER TEMPERATURE CONTROL ELECTRONICS\nTurn off the loco. Set up cooling mode (LSCE GLOW)',
    lamp: 'LSCE (पीला लैम्प) और BPFA प्रकाशित होंगे',
    effect: 'कंट्रोल इलेक्ट्रॉनिक्स का कॉन्टैक्टर क्लोज नहीं होगा (Contactor will not close), TE/BE शून्य हो जायेगा',
    actions: [
      '1. HB/SB पैनल में MCBs को चेक करें। यदि ट्रिप हों तो एक बार रीसेट करें। (MCB 54.1/1 और 54.1/2 दोनों HB पैनल पर एवं MCBs 127.91/1 और 127.91/2 दोनों SB पैनल पर)।',
      '2. यदि TE उपलब्ध है तो ब्लॉक सेक्शन क्लियर करें। अन्यथा कोस्टिंग करते हुए ब्लॉक सेक्शन क्लियर करने का प्रयत्न करें। BPFA दबाकर फॉल्ट ACK करें।',
      '3. स्टेशन मास्टर को 10-15 मिनट तक लोको के असमर्थ रहने की सूचना दें। गाड़ी खड़ी करने के बाद लोको को कूलिंग मोड में रखने से पहले A-9 को इमरजेंसी पोजीशन पर रखें। {MR को ड्रॉप होने से रोकने के लिए}',
      '4. कंट्रोल इलेक्ट्रॉनिक्स को ऑफ करें। BL Key को ‘ C ’ (Cooling Mode) पोजीशन पर रखें, ZPT द्वारा पैंटो रेज़ करें, VCB क्लोज करें। दोनों मशीन रूम ब्लोअर तथा दोनों स्केवेंजिंग ब्लोअर चालू होंगे, लोको कूलिंग मोड में रहेगा और कंट्रोल इलेक्ट्रॉनिक्स ठंडा होने लगेगा। LSCE की बत्ती बुझने तक इंतजार करें।',
      '5. यदि कूलिंग मोड के दौरान VCB ओपन होता है तो VCB क्लोज करने से पहले OCR (78) तथा सभी ऑयल पॉइंट को चेक करें और उसके अनुसार कार्यवाही करें।',
      '6. LSCE के बुझने के बाद VCB ओपन करें तथा पैंटो लोअर करें। BL Key को ‘ D ’ (Driving Mode) पोजीशन पर रखें, पैंटो रेज़ करें, VCB क्लोज करें तथा ट्रैक्शन चालू करें।',
      '★ 3-फ़ेस MRB लोको विशेष: जिन लोको में 3-फ़ेस MRB (MCB 54.1/1 व 54.1/2 थ्री-फ़ेस) लगे हैं, उनमें थ्रोटल "0" पर रखकर आइडल में रखें। यदि गलती से कूलिंग मोड एक्टिवेट हो जाए तो LSCE बुझने से पहले कॉन्टैक्टर 218 को मैनुअली ऑपरेट करके कंट्रोल इलेक्ट्रॉनिक्स ऑन किया जा सकता है।'
    ]
  },
  {
    id: 'F0102P2',
    subSystem: 'SS01',
    message: 'TRANSFORMER OIL PRESSURE NOT OK\nAny oil pump circuit not working TE/BE will be reduced',
    lamp: 'BPFA प्रकाशित होगा',
    effect: 'TE/BE कम होने की संभावना है। वेंटिलेशन बढ़ेगा। VCB ट्रिप होगा।',
    actions: [
      '1. यदि TE उपलब्ध है तो ब्लॉक सेक्शन क्लियर करें। अन्यथा कोस्टिंग करते हुए ब्लॉक सेक्शन क्लियर करने का प्रयत्न करें।',
      '2. थ्रोटल को 0 पर लाएं और BPFA दबाकर फ़ॉल्ट ACK करें।',
      '3. यदि VCB ट्रिप होता है तो BPFA दबाकर फ़ॉल्ट ACK करें, VCB क्लोज़ करें तथा कोस्टिंग करते हुए ब्लॉक सेक्शन क्लियर करने का प्रयत्न करें।',
      '4. ट्रांसफार्मर ऑयल पंप के इनलेट व आउटलेट पाइपों को हाथ से छूकर ट्रांसफार्मर ऑयल पंप का चलना सुनिश्चित करें। HB-1 पैनल में लगे MCB 62.1/1 तथा HB-2 में लगे MCB 62.1/2 की जांच करें। यदि ट्रिप हों तो VCB को ओपन करके एक बार रीसेट करें।',
      '5. VCB क्लोज़ करें, यदि सफलता मिलती है तो गाड़ी चलाएं।'
    ]
  },
  {
    id: 'F0103P2',
    subSystem: 'SS01',
    message: 'EARTH FAULT AUX. WINDING CIRCUIT\nNormal operation can continue. To be checked during maintenance',
    lamp: 'BPFA प्रकाशित होगा',
    effect: 'सामान्य परिचालन जारी रह सकता है। अनुरक्षण के दौरान जांच की जानी है।',
    actions: [
      '1. मशीन रूम में जाकर ऑक्सिलरी में आग या आग लगने की गंध (Smell/Smoke) चेक करें। यदि खराबी हो तो संबंधित ऑक्सिलरी के MCB को ट्रिप करें। BPFA दबाकर फ़ॉल्ट ACK करें।',
      '2. यदि फिर से वही फ़ॉल्ट आता है तो SS-01 के अंत में दिए गए अतिरिक्त अनुदेशों के अनुसार ट्रबल-शूट करें।',
      '3. TLC को सूचित करके लॉग बुक में दर्ज करें। सामान्य परिचालन जारी रखें।'
    ]
  },
  {
    id: 'F0104P2',
    subSystem: 'SS01',
    message: 'LOW FREQUENCY CATENARY VOLTAGE\nWait for 1 minute and set TE / BE again',
    lamp: 'BPFA प्रकाशित होगा',
    effect: 'OHE फ्रीक्वेंसी 45 हर्ट्ज (Hz) के ऊपर आने पर ही ट्रैक्शन चालू होगा।',
    actions: [
      '1. कोस्टिंग करते हुए ब्लॉक सेक्शन क्लियर करें। BPFA दबाकर फ़ॉल्ट ACK करें।',
      '2. निर्धारित स्टॉप पर TLC को सूचित करके लॉग बुक में दर्ज करें।',
      '3. ट्रैक्शन के लिए प्रयास करते रहें और सफलता मिलने पर नॉर्मल ऑपरेशन चालू करें।'
    ]
  },
  {
    id: 'F0105P2',
    subSystem: 'SS01',
    message: 'CATENARY FREQUENCY IS HIGH\nBring throttle to zero',
    lamp: 'BPFA प्रकाशित होगा',
    effect: 'OHE फ्रीक्वेंसी 55 हर्ट्ज (Hz) से नीचे रहने पर ही ट्रैक्शन चालू रहेगा।',
    actions: [
      '1. कोस्टिंग करते हुए ब्लॉक सेक्शन क्लियर करें। BPFA दबाकर फ़ॉल्ट ACK करें।',
      '2. निर्धारित स्टॉप पर TLC को सूचित करके लॉग बुक में दर्ज करें।',
      '3. ट्रैक्शन के लिए प्रयास करते रहें और सफलता मिलने पर नॉर्मल ऑपरेशन चालू करें।'
    ]
  },
  {
    id: 'F0106P2',
    subSystem: 'SS01',
    message: 'AUXILIARY CAPACITOR MACHINE ROOM BLOWER NOT OFF\nContinue normal traction',
    lamp: 'BPFA प्रकाशित होगा',
    effect: 'सामान्य ट्रैक्शन जारी रहेगा (Continue normal traction)।',
    actions: [
      '1. यदि मशीन रूम ब्लोअर 1 और 2 चालू हैं तो BPFA दबाकर फ़ॉल्ट ACK करें और नॉर्मल ऑपरेशन चालू करें।',
      '2. निर्धारित स्टॉप पर TLC को सूचित करके लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0107P2',
    subSystem: 'SS01',
    message: 'DEMANDED SPEED CANNOT BE ACHIEVED',
    lamp: 'BPFA प्रकाशित होगा',
    effect: 'गति 1 kmph से अधिक नहीं बढ़ेगी और 50% से अधिक TE देने पर लोको भारी झटके (Heavy Jerk) के साथ चालू होगा।',
    actions: [
      '1. BPFA दबाकर फ़ॉल्ट ACK करें।',
      '2. यदि लोको (WAG9, WAG9H, WAP7) में ट्रैक्शन कनवर्टर के ऊपर टॉगल स्विच लगे हों तो:\n   • DDS बैकग्राउंड मैसेज संख्या 0052, 0053 या 0054 ASC1 ERROR TACHO GENERATOR के मैसेज के अनुसार, SR-1 के ऊपर लगे स्पीड सेंसर के क्रमशः नीचे, बीच अथवा ऊपर वाले टॉगल स्विच को ऑपरेट करके बाईपास करें।\n   • इसी प्रकार DDS बैकग्राउंड मैसेज संख्या 0052, 0053 या 0054 ASC2 ERROR TACHO GENERATOR के मैसेज के अनुसार, SR-2 के ऊपर लगे स्पीड सेंसर के क्रमशः नीचे, बीच अथवा ऊपर वाले टॉगल स्विच को ऑपरेट करके बाईपास करें।',
      '3. यदि लोको में ट्रैक्शन कनवर्टर के ऊपर टॉगल स्विच नहीं लगे हों तो निम्न DDS मैसेज के अनुसार संबंधित ट्रैक्शन कनवर्टर को आइसोलेट करें:\n   a) यदि मैसेज ASC1 Error Tacho Generator 1/2/3 का हो, तो कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ करके ट्रैक्शन कनवर्टर-1 को MCB 127.1/1 एवं 127.11/1 (SB-1) के द्वारा आइसोलेट करें। एक ट्रैक्शन बोगी से कार्य करें। TLC को सूचित करें।\n   b) यदि मैसेज ASC2 Error Tacho Generator 1/2/3 का हो, तो कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ करके ट्रैक्शन कनवर्टर-2 को MCB 127.1/2 एवं 127.11/2 (SB-2) के द्वारा आइसोलेट करें। एक ट्रैक्शन बोगी से कार्य करें। TLC को सूचित करें।'
    ]
  },
  {
    id: 'SS01-OCB-EARTH-FAULT',
    subSystem: 'SS01',
    message: 'ऑक्सिलरी कनवर्टर 1 के बाद ऑक्सिलरी कनवर्टर 2 आइसोलेट होने पर {OCB में अर्थ फ़ॉल्ट}\nF0103P2 / STB2:004 Earth fault Auxiliary circuit',
    lamp: 'BPFA प्रकाशित होगा, LSDJ प्रकाशित, VCB ट्रिप/बाधित',
    effect: 'कनवर्टर 1 व 2 दोनों आइसोलेट, VCB बाधित (VCB inhibited), मेन पावर ऑफ',
    actions: [
      'A) यदि MCB नं-59.1/1 या 59.1/2 ट्रिप नहीं हैं तो:',
      '1. कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ करके ऑन करें। HB-1 में लगे MCB नं 59.1/1 को ट्रिप करके OCB-1 को आइसोलेट करें।',
      '2. VCB क्लोज़ करें।',
      '3. निम्नलिखित मैसेज चेक करें: (a) F0601P1 (b) F0602P1 (c) F0103P2. यदि कोई मैसेज नहीं है तो खराब OCB आइसोलेट हो चुका है।',
      '4. बोगी कट-आउट स्विच नं.-154 को ऑपरेट करके बोगी-1 को आइसोलेट करें। कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ करके ऑन करें। आधा TE उपलब्ध रहेगा। एक बोगी से सेक्शन क्लियर करके सहायता इंजन की मांग करें।',
      'यदि संदेश दोबारा आता है तो:-',
      'i) HB-1 पैनल में लगे 59.1/1 को रीसेट करें। बोगी-1 को सर्विस में लाएं।',
      'ii) HB-2 में लगे MCB 59.1/2 को ट्रिप करके OCB-2 को आइसोलेट करें।',
      'iii) कंट्रोल इलेक्ट्रॉनिक्स ऑफ़ करें।',
      'iv) बोगी कट आउट स्विच-154 को ऑपरेट करके बोगी-2 को आइसोलेट करें। कंट्रोल इलेक्ट्रॉनिक्स ऑन करें। आधा TE उपलब्ध रहेगा। एक बोगी से सेक्शन क्लियर करके सहायता इंजन की मांग करें।',
      'B) यदि OCB की खराब मोटर के कारण MCB 59.1/1 या 59.1/2 ट्रिप होते हैं तो:',
      'a) MCB को रीसेट न करें।',
      'b) बोगी कट आउट स्विच-154 को ऑपरेट करके संबंधित बोगी को आइसोलेट करें।',
      'c) आधा ट्रैक्शन उपलब्ध रहेगा। एक ट्रैक्शन बोगी के साथ ट्रैक्शन जारी रखते हुए सेक्शन क्लियर करें। सेक्शन क्लियर करके सहायता इंजन की मांग करें।'
    ]
  },
  {
    id: 'SS01-TMB-EARTH-FAULT',
    subSystem: 'SS01',
    message: 'ऑक्सिलरी कनवर्टर 2 के बाद ऑक्सिलरी कनवर्टर 1 आइसोलेट होने पर {TMB में अर्थ फ़ॉल्ट}\nF0103P2 / STB2:004 Earth fault Auxiliary circuit',
    lamp: 'BPFA प्रकाशित होगा, LSDJ प्रकाशित, VCB बाधित',
    effect: 'कनवर्टर 2 व 1 दोनों आइसोलेट, VCB बाधित (VCB inhibited), मेन पावर ऑफ',
    actions: [
      'A) यदि MCB नं 53.1/1 या 53.1/2 ट्रिप न हुआ हो तो:',
      '1. कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ करके ऑन करें। एक-एक करके HB-1 में लगे MCB नं 53.1/1 को ट्रिप करके TMB-1 और HB-2 में लगे MCB नं 53.1/2 को ट्रिप करके TMB-2 को आइसोलेट करें।',
      '2. VCB को क्लोज़ करें। यदि TMB-1 या TMB-2 को आइसोलेट करके सफलता मिलती है तो संबंधित ट्रैक्शन बोगी को स्विच 154 के द्वारा आइसोलेट करें। आधा ट्रैक्शन उपलब्ध रहेगा। एक बोगी के साथ ट्रैक्शन जारी रखते हुए सेक्शन क्लियर करें।',
      'B) यदि TMB के खराब मोटर के कारण MCB नं 53.1/1 या 53.1/2 ट्रिप होते हैं तो:',
      'a) MCB को रीसेट न करें।',
      'b) कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ करके ऑन करें।',
      'c) बोगी कट आउट स्विच-154 को ऑपरेट करके संबंधित बोगी को आइसोलेट करें।',
      'd) आधा ट्रैक्शन उपलब्ध रहेगा। एक ट्रैक्शन बोगी के साथ ट्रैक्शन जारी रखते हुए सेक्शन क्लियर करें।'
    ]
  },
  {
    id: 'SS01-SR-OILPUMP-EARTH-FAULT',
    subSystem: 'SS01',
    message: 'ऑक्सिलरी कनवर्टर 2 के बाद ऑक्सिलरी कनवर्टर 3 आइसोलेट होने पर {SR ऑयल पंप (MPH-C) तथा/या ट्रांसफार्मर ऑयल पंप में अर्थ फ़ॉल्ट}\nF0103P2 / STB2:004 Earth fault Auxiliary circuit',
    lamp: 'BPFA प्रकाशित होगा, LSDJ प्रकाशित, VCB बाधित',
    effect: 'कनवर्टर 2 व 3 दोनों आइसोलेट, VCB बाधित (VCB inhibited), मेन पावर ऑफ',
    actions: [
      'A) यदि MCB 63.1/1 या 63.1/2 ट्रिप नहीं होता तो:',
      '1. कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ करके ऑन करें। एक-एक करके क्रमानुसार SR-1 ऑयल पंप को HB-1 पैनल पर लगे MCB 63.1/1 और SR-2 ऑयल पंप को HB-2 पैनल पर लगे MCB 63.1/2 ट्रिप करके आइसोलेट करें।',
      '2. VCB को क्लोज़ करें।',
      '3. यदि SR-1 ऑयल पंप या SR-2 ऑयल पंप को आइसोलेट करने से सफलता मिलती है तो संबंधित बोगी को बोगी आइसोलेटिंग स्विच 154 के द्वारा आइसोलेट करें। आधा ट्रैक्शन उपलब्ध रहेगा। एक बोगी के साथ ट्रैक्शन लेते हुए सेक्शन क्लियर करें।',
      'B) यदि SR ऑयल पंप (MPH-C) की मोटर में दोष होने के कारण MCB 63.1/1 या 63.1/2 ट्रिप होता है तो:',
      'a) MCB रीसेट न करें।',
      'b) कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ करके ऑन करें। संबंधित बोगी अपने आप आइसोलेट होगी।',
      'c) आधा ट्रैक्शन उपलब्ध रहेगा। एक बोगी के साथ ट्रैक्शन लेते हुए सेक्शन क्लियर करें।',
      'C) MCB क्रम 54.1/2 को चेक करें, यदि ट्रिप है तो एक बार रीसेट करें, यदि फिर से ट्रिप होती है तो सेक्शन साफ़ करके TLC को सूचित करें और सहायता मांगें।'
    ]
  },
  {
    id: 'SS01-MCP-EARTH-FAULT',
    subSystem: 'SS01',
    message: 'ऑक्सिलरी कनवर्टर 3 के बाद ऑक्सिलरी कनवर्टर 2 आइसोलेट होने पर {MCP में अर्थ फ़ॉल्ट}\nF0103P2 / STB2:004 Earth fault Auxiliary circuit',
    lamp: 'BPFA प्रकाशित होगा, LSDJ प्रकाशित, VCB बाधित',
    effect: 'कनवर्टर 3 व 2 दोनों आइसोलेट, VCB बाधित (VCB inhibited), मेन पावर ऑफ',
    actions: [
      'A) यदि MCB नं 47.1/1 या 47.1/2 ट्रिप नहीं होता है तो:',
      '1. कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ करके ऑन करें। HB-1 और HB-2 में लगे MCB नं 47.1/1 या 47.1/2 को ट्रिप करके एक-एक MCP को आइसोलेट करें।',
      '2. VCB क्लोज़ करें। यदि MCP-1 या MCP-2 को आइसोलेट करने पर सफलता मिलती है तो एक MCP के साथ काम करने का प्रयत्न करें।',
      'B) यदि MCP की मोटर में दोष होने के कारण MCB 47.1/1 या 47.1/2 ट्रिप होता है तो:',
      'a) MCB को रीसेट न करें। कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ करके ऑन करें।',
      'b) एक MCP के साथ गाड़ी चलाएं।',
      'C) MCB क्रम 54.1/2 को चेक करें, यदि ट्रिप है तो एक बार रीसेट करें, यदि फिर से ट्रिप होती है तो सेक्शन साफ़ करके TLC को सूचित करें और सहायता मांगें।'
    ]
  },
  {
    id: 'SS01-SCAV-EARTH-FAULT',
    subSystem: 'SS01',
    message: 'ऑक्सिलरी कनवर्टर 3 के बाद ऑक्सिलरी कनवर्टर 1 आइसोलेट होने पर {स्कैवेंजिंग ब्लोअर में अर्थ फ़ॉल्ट}\nF0103P2 / STB2:004 Earth fault Auxiliary circuit',
    lamp: 'BPFA प्रकाशित होगा, LSDJ प्रकाशित, VCB बाधित',
    effect: 'कनवर्टर 3 व 1 दोनों आइसोलेट, VCB बाधित (VCB inhibited), मेन पावर ऑफ',
    actions: [
      'A) यदि MCB नं 55.1/1 या 55.1/2 ट्रिप नहीं होता है तो:',
      '1. कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ करके ऑन करें। HB-1 और HB-2 में लगे MCB नं 55.1/1 या 55.1/2 को ट्रिप करके एक-एक स्कैवेंजिंग ब्लोअर को आइसोलेट करें।',
      '2. VCB क्लोज़ करें। यदि स्कैवेंजिंग ब्लोअर-1 या स्कैवेंजिंग ब्लोअर-2 को आइसोलेट करने पर सफलता मिलती है तो एक स्कैवेंजिंग ब्लोअर के साथ काम करने का प्रयत्न करें।',
      'B) यदि स्कैवेंजिंग ब्लोअर की मोटर में दोष होने के कारण MCB 55.1/1 या 55.1/2 ट्रिप होता है तो:',
      'a) MCB को रीसेट न करें। कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ करके ऑन करें।',
      'b) एक स्कैवेंजिंग ब्लोअर के साथ गाड़ी चलाएं।'
    ]
  },
  {
    id: 'F1101P1',
    subSystem: 'SS11',
    message: 'MAIN COMPRESSOR 1 NOT WORKING\nCheck MCB of MCP 1',
    lamp: 'LSFI ब्लिंक करेगी। BPFA प्रकाशित होगा।',
    effect: 'MR प्रेशर कम हो जायेगा।',
    actions: [
      'थ्रोटल को " 0 " पर लायें। BPFA दबाकर फॉल्ट ACK करें।',
      'SB-2 पैनल में MCP-1 का MCB (47.1/1) चेक करें, यदि ट्रिप है तो रिसेट करें।',
      'BUR-1 को आइसोलेट करके चेक करें।',
      'यदि फिर भी मेन कम्प्रेसर 1 (MCP-1) काम नहीं कर रहा है, तो MCP-2 पर निर्भर रहें और TLC को सूचित करें।'
    ]
  },
  {
    id: 'F0103P1',
    subSystem: 'SS01',
    message: 'LOW PRESSURE PANTO/FAULTY PANTO\nCheck Isolating Cock Check Aux. Reservoir Pressure',
    lamp: 'LSDJ और BPFA प्रकाशित होंगे, LSFI ब्लिंक करेगी',
    effect: 'पेन्टो रेज़ नहीं होगा',
    actions: [
      'थ्रोटल को “ 0 ” पर लाएं। BPFA दबाकर फॉल्ट ACK करें।',
      'सुनिश्चित करें कि न्यूमैटिक पैनल पर IG-38 (नीली चाबी) आड़ी स्थिति में लगी है। KNORR-CCB-2 ब्रेक वाले लोको में IG-38 key खड़ी स्थिति में लगी है।',
      'चेक करें कि MCPA चल रहा है या नहीं। यदि नहीं चल रहा है तो MCPA की MCB 48.1 (SB-2) को चेक करें, यदि ट्रिप हो तो उसे रीसेट करें।',
      'यदि फिर भी MCPA नहीं चल रहा है तो प्रेशर स्विच नं. 26 (E70 वाले लोको में न्यूमैटिक पैनल पर बाएं हाथ से पांचवां और CCB2 वाले लोको में “ PANS-PS ”) को धीरे से टैप करें।',
      'चेक करें कि ऑक्सिलरी रिज़र्वायर गेज में 5.2 kg/cm² से ज्यादा प्रेशर उपलब्ध है। न्यूमैटिक पैनल पर MCPA का ड्रेन कॉक बंद होना सुनिश्चित करें {पाइप के समानांतर होना चाहिए}।',
      'न्यूमैटिक पैनल पर पैंटो व VCB आइसोलेटिंग कॉक खुला होना चेक करें। दो-तीन बार ऑपरेट करें और आड़ी (हॉरिजॉन्टल) स्थिति में होना सुनिश्चित करें।',
      'पैंटो रेज़ करने का प्रयत्न करें। यदि सफलता नहीं मिलती है तो न्यूमैटिक पैनल पर पैंटो सिलेक्टर स्विच (85) की पोजीशन बदलकर दूसरा पैंटो रेज़ करने का प्रयत्न करें।',
      'पैंटो सर्किट के प्रेशर को 130.4/1 तथा 130.4/2 प्रेशर स्विच मॉनिटर करते हैं। पैंटो रेज़िंग की कमांड देने के बाद, यदि यह प्रेशर स्विच 35 सेकंड में पिकअप नहीं होता है तो VCB क्लोज नहीं होगा। यदि VCB क्लोज होता है तो वह 2 सेकंड के बाद खुल जायेगा। प्रेशर स्विच नं. 130.4/1 तथा 130.4/2 अर्थात 9/1 और 9/2, E70 वाले लोको में न्यूमैटिक पैनल पर और CCB2 वाले लोको में “ PAN1-PS तथा PAN2-PS ” को धीरे से टैप करें। पैंटो रेज़ करें तथा VCB क्लोज करें।',
      'यदि सफलता नहीं मिलती है तो कैब बदलकर / पैंटो सिलेक्टर स्विच (85) {न्यूमैटिक पैनल पर} की पोजीशन बदलकर प्रयत्न करें।',
      'अगर सफलता नहीं मिलती है तो कंट्रोल इलेक्ट्रॉनिक्स को एक बार ऑफ कर फिर से ऑन करके प्रयत्न करें।'
    ]
  },
  {
    id: 'F0104P1',
    subSystem: 'SS01',
    message: 'CATENARY VOLTAGE OUT OF LIMIT\nWatch Catenary Voltmeter Close VCB When Voltage is OK',
    lamp: 'LSDJ और BPFA प्रकाशित होंगे, LSFI ब्लिंक करेगी',
    effect: 'कैटनरी वोल्टेज 17.5 kv से 29 kv के बीच में VCB ट्रिप नहीं होगा।',
    actions: [
      'थ्रोटल को “ 0 ” पर लाएं। BPFA दबाकर फॉल्ट ACK करें।',
      'यदि U मीटर “ 0 ” बताता है, तो पैंटो का OHE से स्पर्श होना सुनिश्चित करें, छत पर खराबी चेक करें:- \n• यदि पैंटो OHE से स्पर्श नहीं करता तो दूसरा पैंटो उठाकर कार्य करें।\n• यदि छत पर खराबी है तो TPC/TLC से संपर्क करें।\n• यदि छत पर खराबी नहीं है तो OHE टेंशन के लिए आर्किंग चेक करें:\n  a) यदि आर्किंग नहीं होती है तो No Tension से संबंधित कार्यवाही करें, TPC/TLC से संपर्क करें और आदेशानुसार कार्यवाही करें।\n  b) यदि आर्किंग होती है तो पैंटो लोअर करके SB-1 पैनल पर 2 Amp के फ्यूज को अतिरिक्त फ्यूज से बदल दें। सफलता मिलने पर सामान्य तौर पर कार्य करें।\n  c) यदि 2 Amp का फ्यूज नहीं पिघला है तो OHE Voltage 17.5 kV से 29 kV के बीच आने तक इंतज़ार करें। वोल्टेज सामान्य होने पर VCB क्लोज करें, ट्रैक्शन चालू करें।',
      'यदि U मीटर OHE Voltage 17.5 kV से 29 kV के बीच बताता है तो ट्रैक्शन कनवर्टर 1 व 2 को निम्न मैसेज के अनुसार आइसोलेट करें:-\n• (i) यदि DDS पर मैसेज SLG-1:0020 आता है तो लोको पायलट ट्रैक्शन कनवर्टर 1 को MCB 127.1/1 एवं 127.11/1 {SB-1} के द्वारा आइसोलेट करें {MCE OFF करके}।\n• (ii) यदि DDS पर मैसेज SLG-2:0020 आता है तो ट्रैक्शन कनवर्टर 2 को MCB 127.1/2 एवं 127.11/2 {SB-2} के द्वारा आइसोलेट करें {MCE OFF करके}।',
      'यदि सफलता नहीं मिलती है तो कंट्रोल इलेक्ट्रॉनिक्स को ऑफ करके ऑन करें। ट्रैक्शन चालू करें।',
      'यदि फिर भी सफलता नहीं मिलती है तो पैंटो बदलकर प्रयत्न करें।',
      'कैब बदलकर प्रयत्न करें।'
    ]
  },
  {
    id: 'F0104P1-WAP5-MU',
    subSystem: 'SS01',
    message: 'CATENARY VOLTAGE OUT OF LIMIT\n(From Slave loco only during WAP5 MU with single panto)',
    lamp: 'LSDJ और BPFA प्रकाशित होंगे, LSFI ब्लिंक करेगी',
    effect: 'स्लेव लोको से कैटनरी वोल्टेज आउट ऑफ लिमिट, VCB ओपन',
    actions: [
      'थ्रोटल को “ 0 ” पर लाएं। दोनों लोको के बीच HV कनेक्टिंग केबल चेक करें। अगर HV केबल क्षतिग्रस्त हो गई है, तो {BPISO दबाकर} स्लेव लोको के दोनों आइसोलेटर खोलकर उसे इलेक्ट्रिकली आइसोलेट करें। सिंगल लोको की तरह ऑपरेट करें।\n★ चेतावनी: MU की मैकेनिकल कपलिंग ओपन न करें, अन्यथा HV केबल क्षतिग्रस्त हो सकती है।\n★ अगर HV केबल ठीक है तो:-',
      'पीछे वाले (स्लेव) लोको का 2 Amp का PT फ्यूज (SB-1) चेक करें। अगर मेल्ट है तो पैंटो लोअर करके अतिरिक्त फ्यूज से बदलें। OHE वोल्टेज चेक करें, अगर सामान्य है तो VCB क्लोज करें तथा ट्रैक्शन लें।',
      'यदि 2 Amp का फ्यूज मेल्ट नहीं है तो OHE वोल्टेज 17.5 kV से अधिक तथा 29 kV से कम होने का इंतज़ार करें। वोल्टेज सामान्य होने पर VCB क्लोज करें तथा ट्रैक्शन लें।',
      'एक बार कंट्रोल इलेक्ट्रॉनिक्स ऑफ करके ऑन (MCE OFF/ON) करें। ट्रैक्शन लेने का प्रयत्न करें।',
      'यदि फिर भी सफलता नहीं मिलती है तो पैंटो बदलकर प्रयत्न करें।',
      'कैब बदलकर प्रयत्न करें।',
      'स्लेव लोको को आइसोलेट करके प्रयत्न करें।'
    ]
  },
  {
    id: 'F0105P1',
    subSystem: 'SS01',
    message: 'TRANSFORMER OIL TEMPERATURE OR PRESSURE NOT OK\nTE/BE reduction or VCB trips\nTry to close VCB, if open',
    lamp: 'LSFI ब्लिंक करेगी और BPFA प्रकाशित होगा',
    effect: 'TE/BE कम हो जाएगा या VCB ट्रिप हो जाएगा',
    actions: [
      'यदि TE उपलब्ध है तो ब्लॉक सेक्शन क्लियर करें। अन्यथा कोस्टिंग करते हुए ब्लॉक सेक्शन क्लियर करने का प्रयत्न करें।',
      'थ्रोटल को “ 0 ” पर लाएं। BPFA दबाकर फॉल्ट ACK करें।',
      'यदि VCB ट्रिप होता है, तो BPFA दबाकर फॉल्ट ACK करें, VCB क्लोज करें, कोस्टिंग करते हुए ब्लॉक सेक्शन साफ (क्लियर) करने का प्रयत्न करें।',
      'अंडरफ्रेम में लगे ट्रांसफार्मर ऑयल पंप के इनलेट व आउटलेट पाइप को हाथ से छूकर ट्रांसफार्मर ऑयल पंप का चलना सुनिश्चित करें। HB-1 पैनल में लगे MCB 62.1/1 तथा HB-2 में लगे MCB 62.1/2 की जांच करें। यदि ट्रिप हो तो VCB को ओपन करके एक बार रीसेट करें {MCB रीसेट करने की विधि पेज संख्या 101/102 पर दी गई है}। यदि ट्रांसफार्मर के ऑयल पंप नहीं चल रहे हों तो:-\n  a) कंट्रोल इलेक्ट्रॉनिक्स को ऑफ करके ऑन (MCE OFF/ON) करें।\n  b) लोको को 10 मिनट आइडल (Idle) स्थिति में रखें।',
      'मशीन रूम में ऑयल कूलिंग ब्लोअर के पास ट्रांसफार्मर के एक्सपेंशन टैंक पर लगे ऑयल गेज पर तेल का लेवल चेक करें। यह अधिकतम तथा न्यूनतम के बीच में होना चाहिए।',
      'लोको पायलट मशीन रूम में लगे ऑयल कूलिंग ब्लोअर का चलना सुनिश्चित करें। यदि नहीं चल रहे हों तो चेक करें कि HB-1 पैनल में लगा MCB 59.1/1 तथा HB-2 पैनल में लगा MCB 59.1/2 ट्रिप तो नहीं है। यदि ट्रिप हो तो VCB ओपन करके एक बार MCB को रीसेट करें।\n• यदि ऑयल कूलिंग ब्लोअर नहीं चल रहे हों तो:-\n  a) कंट्रोल इलेक्ट्रॉनिक्स को ऑफ करके ऑन करें।\n  b) लोको को 10 मिनट आइडल स्थिति में रखें।\n• यदि लोको पायलट को ऑयल कूलिंग ब्लोअर का इम्पेलर तथा उसकी केसिंग क्षतिग्रस्त (Damaged) मिलती है तो:-\n  a) संबंधित ऑयल कूलिंग ब्लोअर की MCB 59.1/1 या 59.1/2 ट्रिप करके उसे आइसोलेट करें।\n  b) संबंधित ट्रैक्शन कनवर्टर पंप की MCB 63.1/1 या 63.1/2 ट्रिप करें।\n  c) संबंधित ट्रांसफार्मर ऑयल पंप की MCB 62.1/1 या 62.1/2 ट्रिप करें।\n  (नोट: लोको पायलट को उपरोक्त MCBs, VCB ओपन करके एवं कंट्रोल इलेक्ट्रॉनिक्स ऑफ करके ऑपरेट करनी चाहिए। बाद में लोको पायलट संबंधित बोगी को SB-1 में लगे बोगी आइसोलेटिंग स्विच नं. 154 के द्वारा आइसोलेट करें। कंट्रोल इलेक्ट्रॉनिक्स ऑन करके, पैंटो रेज़ करें तथा VCB क्लोज करें। TLC से सलाह करके एक बोगी सर्विस में रखते हुए गाड़ी चलाएं।)',
      'ट्रैक्शन चालू करने का प्रयत्न करें।'
    ]
  },
  {
    id: 'F0105P1-DEAD',
    subSystem: 'SS01',
    message: 'MAIN POWER ISOLATED\nVCB Inhibited Loco is dead',
    lamp: 'LSDJ और BPFA प्रकाशित होंगे, LSFI ब्लिंक करेगी',
    effect: 'मेन पावर आइसोलेट होगी, VCB क्लोज होना बाधित (Inhibited), लोको डेड (Loco is dead)',
    actions: [
      'यदि फिर से वही मैसेज आता है और MCBs सामान्य हैं तो थ्रोटल को “ 0 ” पर लाएं।',
      'कंट्रोल इलेक्ट्रॉनिक्स को ऑफ करके फिर से ऑन करें, पैंटो को रेज़ करें तथा VCB क्लोज करें। ट्रैक्शन चालू करें।',
      'सफलता न मिलने पर - यदि DDS पर मैसेज, SLG-1:0019 का आता है तो ट्रैक्शन कनवर्टर-1 को MCB 127.1/1 एवं 127.11/1 (SB-1) और SLG-2:0019 का आता है तो ट्रैक्शन कनवर्टर-2 को MCB 127.1/2 एवं 127.11/2 (SB-2) के द्वारा आइसोलेट करें। (MCE ऑफ करके)',
      'यदि सफलता नहीं मिलती है तो 20 मिनट के अंदर सहायता इंजन की मांग करें।'
    ]
  },
  {
    id: 'F0106P1',
    subSystem: 'SS01',
    message: 'FILTER ON/OFF CONTACTOR STUCK ON\nVCB will not close again',
    lamp: 'LSDJ और BPFA प्रकाशित होंगे, LSFI ब्लिंक करेगी',
    effect: 'हार्मोनिक फिल्टर ऑन/ऑफ कॉन्टैक्टर स्टक ऑन, VCB दोबारा क्लोज नहीं होगा, 40 kmph स्पीड रेस्ट्रिक्शन',
    actions: [
      'यदि VCB ओपन होता है तो पुनः क्लोज नहीं होगा।',
      'थ्रोटल को “ 0 ” पर लाएं और BPFA दबाकर फॉल्ट ACK करें। कंट्रोल इलेक्ट्रॉनिक्स को ऑफ करके एक बार पुनः ऑन करें। पैंटोग्राफ रेज़ करें, VCB क्लोज करें यदि लोको सामान्य हो जाता है तो ट्रैक्शन चालू करें।',
      'हार्मोनिक फ़िल्टर अपने आप आइसोलेट होगा और लोको पायलट 40 kmph की गति से कार्य कर सकता है।'
    ]
  },
  {
    id: 'F0106P1-DEAD',
    subSystem: 'SS01',
    message: 'MAIN POWER ISOLATED\nVCB Inhibited Loco is dead',
    lamp: 'LSDJ और BPFA प्रकाशित होंगे, LSFI ब्लिंक करेगी',
    effect: 'मेन पावर आइसोलेट होगी, VCB क्लोज होना बाधित (Inhibited), लोको डेड (Loco is dead)',
    actions: [
      'सफलता न मिलने पर DDS पर मैसेज चेक करें — यदि DDS पर मैसेज, SLG-1:0059 का आता है तो ट्रैक्शन कनवर्टर-1 को MCB 127.1/1 एवं 127.11/1 (SB-1) और 154 (SB-1) को “ I ” पर रखकर आइसोलेट करके प्रयत्न करें।',
      'यदि सफलता नहीं मिलती तो सहायता इंजन की मांग करें व लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0107P1',
    subSystem: 'SS01',
    message: 'PRECHARGE OR MAIN CONTACTOR STUCK ON\nMain converter blocked',
    lamp: 'LSDJ और BPFA प्रकाशित होंगे, LSFI ब्लिंक करेगी',
    effect: 'मेन कनवर्टर ब्लॉक, प्रीचार्ज या मेन कॉन्टैक्टर स्टक ऑन, एक बोगी आइसोलेट कर कार्य',
    actions: [
      'थ्रोटल को “ 0 ” पर लाएं। कोस्टिंग करते हुए ब्लॉक सेक्शन क्लियर करने का प्रयत्न करें।',
      'BPFA दबाकर फॉल्ट ACK करें। कंट्रोल इलेक्ट्रॉनिक्स को ऑफ करके एक बार पुनः ऑन करें। पैंटो रेज़ करें, VCB क्लोज करें तथा ट्रैक्शन चालू करें।',
      'यदि सफलता नहीं मिलती है तो निम्न DDS मैसेज के अनुसार संबंधित ट्रैक्शन कनवर्टर को आइसोलेट करके एक बोगी को सर्विस में रखते हुए सेक्शन क्लियर करें:-\n(i) यदि DDS पर बैकग्राउंड मैसेज SLG-1:0037 या 0039 का आता है तो ट्रैक्शन कनवर्टर-1 को MCB 127.1/1 एवं 127.11/1 (SB-1) के द्वारा आइसोलेट करें।\n(ii) यदि DDS पर बैकग्राउंड मैसेज SLG-2:0037 या 0039 का आता है तो ट्रैक्शन कनवर्टर-2 को MCB 127.1/2 एवं 127.11/2 (SB-2) के द्वारा आइसोलेट करें। TLC को सूचित करें और उसके आदेशानुसार कार्य करें।',
      'सफलता न मिलने पर 20 मिनट के अंदर सहायता इंजन की मांग करें।'
    ]
  },
  {
    id: 'F0107P1-DEAD',
    subSystem: 'SS01',
    message: 'MAIN POWER ISOLATED\nVCB inhibited Loco is dead',
    lamp: 'LSDJ और BPFA प्रकाशित होंगे, LSFI ब्लिंक करेगी',
    effect: 'मेन पावर आइसोलेट होगी, VCB क्लोज होना बाधित (Inhibited), लोको डेड (Loco is dead)',
    actions: [
      'कंट्रोल इलेक्ट्रॉनिक्स को ऑफ करके ऑन करें। पैंटोग्राफ रेज़ करें, VCB क्लोज करें तथा ट्रैक्शन चालू करें।',
      'यदि VCB क्लोज नहीं हो रहा है तो लोको को शट-डाउन करें।',
      '20 मिनट के अंदर सहायता इंजन की मांग करें।'
    ]
  },
  {
    id: 'F0108P1',
    subSystem: 'SS01',
    message: 'PRIMARY OVER CURRENT\nCheck over current relay flag\nClose VCB after unlocking relay',
    lamp: 'LSDJ और BPFA प्रकाशित होंगे, LSFI ब्लिंक करेगी',
    effect: 'VCB क्लोजिंग/होल्डिंग कॉइल की पावर सप्लाई मैक्सिमम करंट रिले (OCR 78) के द्वारा बाधित होगी',
    actions: [
      'लोको की जांच करने से पहले VCB को क्लोज न करें। मशीन रूम में OCR (78) तथा सभी ऑयल पॉइंट्स चेक करें। यदि कोई असामान्यता दिखाई दे तो मानक सुरक्षा नियमानुसार कार्यवाही करें और बिना समय गंवाए सहायता इंजन मांगें।',
      'यदि कोई असामान्यता नहीं है तो कोस्टिंग करते हुए ब्लॉक सेक्शन क्लियर करें और गाड़ी को खड़ी करें। BPFA दबाकर फॉल्ट ACK करें।',
      'SB-1 पैनल पर OCR-78 रिले के टारगेट की जांच करें।',
      'मशीन रूम में तेल का बिखराव चेक करें।',
      'मशीन रूम में ऑयल कूलिंग यूनिट के पास ट्रांसफॉर्मर के दोनों एक्सपेंशन टैंक तथा दोनों ट्रैक्शन कनवर्टर के एक्सपेंशन टैंक में ऑयल लेवल चेक करें। यह Min. तथा Max. के बीच होना चाहिए। यदि कोई असामान्यता (जैसे तेल का बिखराव या अत्यधिक तापमान) हो तो लोको को शट-डाउन करें। 20 मिनट के अंदर सहायता इंजन की मांग करें।',
      'यदि OCR-78 (SB-1) का टारगेट गिरा है परंतु किसी भी प्रकार का तेल बिखराव नहीं दिखता है एवं चारों ऑयल गेज में तेल Min. तथा Max. के बीच है तो रिले के नॉब को clockwise घुमाकर रीसेट करें, रिले का फ्लैग हट जाएगा।',
      'BLDJ द्वारा VCB क्लोज करें एवं TLC को सूचित करके लॉग बुक में दर्ज करें।',
      'यदि एक बार में उपरोक्त अनुसार सफलता न मिले और VCB क्लोज नहीं होता है तो बिना समय गंवाए सहायता इंजन की मांग करें।'
    ]
  },
  {
    id: 'F0108P1-DEAD',
    subSystem: 'SS01',
    message: 'MAIN POWER ISOLATED\nVCB inhibited Loco is dead',
    lamp: 'LSDJ और LSFI प्रकाशित होंगे',
    effect: 'VCB क्लोज नहीं होगा, लोको डेड',
    actions: [
      'यदि एक बार में सफलता न मिले तो बिना समय गंवाए सहायता इंजन की मांग करें।'
    ]
  },
  {
    id: 'F0109P1',
    subSystem: 'SS01',
    message: 'AUX. WINDING OVER CURRENT\nTry to close VCB again',
    lamp: 'LSDJ और BPFA प्रकाशित होंगे, LSFI ब्लिंक करेगी',
    effect: 'VCB ट्रिप होगा (VCB will trip)',
    actions: [
      'BPFA दबाकर फ़ॉल्ट ACK करें। VCB को क्लोज़ करने के लिए BLDJ दबाएं।',
      'यदि दोष बना ही रहता है तो आइसोलेशन मैसेज आएगा, ENTER बटन दबाकर ACK करें।',
      'कोस्टिंग करते हुए ब्लॉक सेक्शन क्लियर करें और गाड़ी को खड़ी करें।'
    ]
  },
  {
    id: 'F0109P1-DEAD',
    subSystem: 'SS01',
    message: 'MAIN POWER ISOLATED\nVCB inhibited Loco is dead',
    lamp: 'LSDJ और LSFI प्रकाशित होंगे',
    effect: 'VCB क्लोज़ नहीं होगा, लोको डेड (Loco is dead)',
    actions: [
      'कंट्रोल इलेक्ट्रॉनिक्स को एक बार फिर ऑफ़ करके ऑन करें। पैंटोग्राफ रेज़ करें, VCB क्लोज़ करें तथा ट्रैक्शन चालू करें।',
      'यदि VCB क्लोज़ नहीं होता है तो लोको को शट-डाउन करें।',
      'DDS पर बैकग्राउंड मैसेज चेक करें, और मैसेज के अनुसार BUR-1, BUR-2 या BUR-3 को MCB 127.22/1 या MCB 127.22/2 या MCB 127.22/3 के द्वारा आइसोलेट करके प्रयत्न करें। (MCE ऑफ़ करके)।',
      'सफलता न मिलने पर 20 मिनट के अंदर सहायता इंजन की मांग करें।'
    ]
  },
  {
    id: 'F0110P1',
    subSystem: 'SS01',
    message: 'FATAL ERROR IN MAIN CIRCUIT\nTurn OFF the Loco',
    lamp: 'LSDJ और BPFA प्रकाशित होंगे, LSFI ब्लिंक (टिमटिमाना) करेगा',
    effect: 'VCB ट्रिप होगा और पैंटोग्राफ लोअर हो जाएगा',
    actions: [
      'थ्रॉटल को "0" पर लाएं और BPFA दबाकर फ़ॉल्ट ACK करें।',
      'HB/SB पैनल में MCBs को चेक करें। यदि ट्रिप हों तो एक बार रीसेट करें।',
      'कंट्रोल इलेक्ट्रॉनिक्स को एक बार फिर ऑफ़ करके ऑन करें। पैंटो रेज़ करें, VCB क्लोज़ करें तथा ट्रैक्शन चालू करें।',
      'एक से ज़्यादा सब-सिस्टम आइसोलेट हों (RDSO का मॉडिफिकेशन पत्र सं. RDSO/2013/EL/MS/0420, Rev. "0" Dated 23.01.13 के कार्यान्वयन के बाद ही यह लागू होगा)।'
    ]
  },
  {
    id: 'F0110P1-DEAD',
    subSystem: 'SS01',
    message: 'MAIN POWER ISOLATED\nVCB inhibited Loco is dead',
    lamp: 'LSDJ और LSFI प्रकाशित होंगे',
    effect: 'VCB क्लोज़ नहीं होगा',
    actions: [
      'OCB, TMB, कन्वर्टर पंप (MPH-C) व MCP के लिए SS-01 के अंत में दिए गए अतिरिक्त मदों के अनुसार दोष निवारण करें। यदि सफलता नहीं मिलती है तो -',
      'कंट्रोल इलेक्ट्रॉनिक्स को एक बार फिर ऑफ़ करके ऑन करें। पैंटो रेज़ करें, VCB क्लोज़ करें तथा ट्रैक्शन चालू करें।',
      'यदि VCB क्लोज़ नहीं होता है तो लोको को शट-डाउन करें।',
      '20 मिनट के अंदर सहायता इंजन की मांग करें।'
    ]
  },
  {
    id: 'F0201P1',
    subSystem: 'SS02',
    message: 'DISTURBANCE IN CONVERTER 1\nTry to close VCB again',
    lamp: 'LSDJ और BPFA प्रकाशित होंगे, LSFI ब्लिंक करेगी',
    effect: 'VCB ओपन होगा',
    actions: [
      'थ्रोटल को " 0 " पर लायें। BPFA दबाकर फॉल्ट ACK करें।',
      'MCB 127.1/1 (SB1) चैक करें। यदि ट्रिप है तो कंट्रोल इलेक्ट्रॉनिक्स को ऑफ करके एक बार रिसेट करें।',
      'VCB क्लोज करने के लिए BLDJ प्रेस करें।',
      'यदि वही मैसेज दुबारा आता है तो कंट्रोल इलेक्ट्रॉनिक्स को ऑफ करके 5 मिनट बाद ऑन करें। पेन्टो रेज़ करें, VCB क्लोज करें यदि लोको सामान्य होता है तो ट्रैक्शन चालू करें।',
      'यदि वही मैसेज दुबारा आता है और ट्रैक्शन बोगी-1 अपने आप आइसोलेट नहीं होती है तो SB-1 पैनल में लगे MCB 127.1/1 एवं 127.11/1 (SB-1) द्वारा बोगी-1 को आइसोलेट करें। (MCE ऑफ करके)',
      'TLC को सूचित करें तथा बोगी आइसोलेट करने से पहले आये हुए DDS मैसेज को लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'SS02-BOGIE1-ISOLATED',
    subSystem: 'SS02',
    message: 'BOGIE 1 ISOLATED :\nOnly half traction and electrical braking power available\nPress <Enter>',
    lamp: 'LSFI प्रकाशित होगी',
    effect: 'बोगी-1 आइसोलेट होगी (सिर्फ आधा TE/BE पावर उपलब्ध रहेगा)',
    actions: [
      '1. यदि लोको पायलट 154 स्विच के द्वारा बोगी-1 को आइसोलेट करता है तो उसके बाद केवल Display Key Board पर ENTER Key प्रेस करें, अन्यथा -',
      '2. कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ करें और फिर ऑन करें। पैंटो उठायें (रेज़ करें), VCB क्लोज करें और ट्रैक्शन चालू करें।',
      '3. यदि वही मैसेज दोबारा आता है तो आधे ट्रैक्शन / ब्रेकिंग पावर से सामान्य ऑपरेशन चालू करें।',
      '4. TLC को सूचित करें तथा लॉग बुक में दर्ज करें।',
      '★ नोट: कंट्रोल इलेक्ट्रॉनिक्स को निम्न DDS मैसेज के लिए ऑफ़/ऑन करने से बचें:',
      '• यदि ASC 1: Error PS hardware के बाद निम्न में से कोई मैसेज आता है:\n  a) ASC 1: Error PS Fault storage CGP अथवा ASC 1: Error PS Fault storage GBC.\n  b) NSC 1: Error PS hardware के बाद Error PS Fault storage GBC और ASC 1: 0052/0053/0054 (Bogie 1 Error Tacho generator).'
    ]
  },
  {
    id: 'F0202P1',
    subSystem: 'SS02',
    message: 'CONVERTER CONTACTOR STUCK OFF\nTry to close VCB again',
    lamp: 'LSDJ और BPFA प्रकाशित होंगे, LSFI ब्लिंक करेगी',
    effect: 'VCB ओपन होगा',
    actions: [
      'थ्रोटल को " 0 " पर लायें। BPFA दबाकर फॉल्ट ACK करें।',
      'CCB-2 लोको में - MR और FP प्रेशर गेज़ की जाँच करें। यदि प्रेशर कम होता है तो MPJ को "0" पर रखकर उसे दुरस्त करें।',
      'VCB क्लोज करने के लिए BLDJ प्रेस करें।',
      'SR-1(ट्रैक्शन कनवर्टर-1) में एयर लीकेज को जाँच करें। यदि एयर लीकेज है तो SR-1 को न्यूमेटिक पैनल पर लगे कॉक (125) द्वारा आइसोलेट करें। न्यूमेटिक पैनल पर COC125 बायीं ओर अन्दर की तरफ (ऊपर से चौथा) को आईसोलेट करें तथा उसके बाद बोगी-1 को स्विच 154 (SB-1) के द्वारा आइसोलेट करें।',
      'VCB क्लोज करने के लिए BLDJ प्रेस करें। यदि VCB क्लोज नहीं होता है और वही मैसेज दोबारा आता है तब बोगी-1 को आइसोलेट करें।'
    ]
  },
  {
    id: 'F0203P1',
    subSystem: 'SS02',
    message: 'GATE UNIT SUPPLY STUCK OFF\nTry to close VCB again',
    lamp: 'LSDJ और BPFA प्रकाशित होंगे, LSFI ब्लिंक करेगी',
    effect: 'VCB ओपन होगा',
    actions: [
      'थ्रोटल को " 0 " पर लायें। BPFA दबाकर फ़ॉल्ट ACK करें।',
      'SB-1 पर लगे MCB 127.11/1 की जाँच करें। यदि ट्रिप है तो कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ करके एक बार रीसेट करें।',
      'VCB क्लोज़ करने के लिए BLDJ प्रेस करें।',
      'यदि बोगी आइसोलेट हो जाती है (BOGIE 1 ISOLATED): ब्लॉक सेक्शन क्लियर करें या TLC की अनुमति से एक बोगी से कार्य करें। SB-1 में लगे MCB 127.11/1 को चेक करें, यदि ट्रिप मिलता है तो कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ करके एक बार रीसेट करें।',
      'यदि सफलता नहीं मिलती तो कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ करें और फिर ऑन करें। पैंटो रेज़ करें, VCB क्लोज़ करें और ट्रैक्शन चालू करें।',
      'यदि वही मैसेज दोबारा आता है तो आधे ट्रैक्शन / ब्रेकिंग पावर से सामान्य ऑपरेशन चालू करें। TLC को सूचित करें तथा लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0205P1',
    subSystem: 'SS02',
    message: 'CONVERTER-1 OIL TEMPERATURE TOO HIGH\nTry to close VCB again\n(एवं BOGIE 1 ISOLATED / Press <Enter>)',
    lamp: 'LSDJ और BPFA प्रकाशित होंगे, LSFI ब्लिंक करेगी (आइसोलेट होने पर LSFI लगातार प्रकाशित रहेगी)',
    effect: 'VCB ओपन होगा / बोगी-1 आइसोलेट होगी (आधा TE/BE पावर उपलब्ध)',
    actions: [
      '【स्थिति 1: जब "CONVERTER-1 OIL TEMPERATURE TOO HIGH, Try to close VCB again" मैसेज आये】',
      '1. थ्रोटल को " 0 " पर लायें। BPFA दबाकर फ़ॉल्ट ACK करें।',
      '2. कनवर्टर क्यूबिकल पर लगे कनवर्टर एक्सपेंशन टैंक में ऑयल लेवल की जाँच करें।',
      '3. HB-1 पैनल में लगे MCB 59.1/1 और 63.1/1 की जाँच करें। यदि ट्रिप मिले तो VCB ओपन करके एक बार रीसेट करें। VCB क्लोज़ करें और ट्रैक्शन कनवर्टर ऑयल पंप-1 का चलना सुनिश्चित करें। अंडरफ्रेम में लगे रेडिएटर पर से हवा आने के द्वारा OCB-1 का कार्य सुनिश्चित करें।',
      '4. लोको पायलट OCB-1 के इम्पेलर व केसिंग की किसी भी क्षति को चेक करें, यदि क्षतिग्रस्त पाते हैं तो VCB ओपन करके पैंटो लोअर करें। HB-1 में लगे MCB 59.1/1, MCB 62.1/1 व MCB 63.1/1 को ओपन करें, फिर बाद में स्विच 154 (SB-1 में स्थित) के द्वारा बोगी-1 को आइसोलेट करें।',
      '5. लोको को एनर्जाइज़ करें व एक बोगी के साथ गाड़ी चलायें। इस स्थिति में LSFI लगातार प्रकाशित रहेगी। TLC को सूचित करें तथा लॉग बुक में दर्ज करें।',
      '【स्थिति 2: जब "BOGIE 1 ISOLATED : Only half traction and electrical braking power available. Press <Enter>" मैसेज आये】',
      '1. कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ करें और फिर ऑन करें। पैंटो उठायें, VCB क्लोज़ करें तथा ट्रैक्शन चालू करें।',
      '2. यदि वही मैसेज दोबारा आता है तो आधे ट्रैक्शन / ब्रेकिंग पावर से सामान्य ऑपरेशन चालू करें।',
      '3. TLC को सूचित करें तथा लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0206P1',
    subSystem: 'SS02',
    message: 'CONVERTER 1 OIL PRESSURE NOT OK\nCheck oil level\nTry to close the VCB again\n(एवं BOGIE 1 ISOLATED / Press <Enter>)',
    lamp: 'LSDJ और BPFA प्रकाशित होंगे, LSFI ब्लिंक करेगी (क्रम 2 व 5 स्थिति अथवा आइसोलेट होने पर LSFI लगातार प्रकाशित रहेगी)',
    effect: 'VCB ओपन होगा / बोगी-1 आइसोलेट होगी (आधा TE/BE उपलब्ध)',
    actions: [
      '【स्थिति 1: जब "CONVERTER 1 OIL PRESSURE NOT OK, Check oil level, Try to close the VCB again" मैसेज आये】',
      '1. थ्रोटल को " 0 " पर लायें। BPFA दबाकर फ़ॉल्ट ACK करें।',
      '2. कनवर्टर क्यूबिकल पर लगे कनवर्टर एक्सपेंशन टैंक में ऑयल लेवल की जाँच करें। यदि मैक्सिमम से ऊपर या मिनिमम से नीचे हो तो बोगी-1 को स्विच 154 द्वारा "I" पर रखकर आईसोलेट करके आधे ट्रैक्शन से कार्य करें।',
      '3. यदि ऑयल लेवल बराबर हो तो HB-1 पैनल में MCB 63.1/1 को चेक करें। यदि ट्रिप हो तो उसे VCB ओपन करके एक बार रीसेट करें। मशीन रूम में SR-1 का ऑयल पंप चल रहा है या नहीं इसकी जाँच उसके इनलेट तथा आउटलेट पाइप को छूकर करें।',
      '4. यदि MCB 63.1/1 को एक बार रीसेट करने के बाद दोबारा ट्रिप होता है तो उसे फिर से रीसेट न करें। बोगी-1 अपने आप आइसोलेट हो जायेगी। आधे ट्रैक्शन के साथ कार्य करें।',
      '5. लोको पायलट ट्रैक्शन कनवर्टर-1 के ऑयल की पाइप लाइन को ऑयल लीकेज तथा कोई क्षति के लिए चेक करें जिससे तेल का रिसाव हो सकता है और ऑयल कूलिंग ब्लोअर-1 (OCB-1) की केसिंग को इम्पेलर की खराबी से कोई क्षति के लिए चेक करें। ऐसी स्थिति में रेडिएटर के क्षतिग्रस्त होने से तेल का रिसाव होकर "Converter No.1 oil pressure low" का मैसेज आ सकता है। लोको पायलट VCB ओपन करें, पैंटो लोअर करें और HB-1 पैनल पर लगे MCB 59.1/1 और MCB 63.1/1 को ट्रिप करें। स्विच 154 को "I" पर रखकर बोगी-1 को आईसोलेट करें। लोको एनर्जाइज करके एक बोगी द्वारा कार्य करें। (उपरोक्त क्रम सं. 2 और 5 की स्थिति में LSFI लगातार प्रकाशित रहेगी। TLC को सूचित करें तथा लॉग बुक में दर्ज करें।)',
      '6. यदि SR-1 ऑयल पंप सामान्य हो तो कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ करके BUR-2 को MCB 127.22/2 के द्वारा आइसोलेट करें।',
      '7. यदि सफलता मिलती है तो BUR-2 को आइसोलेट रखते हुए गाड़ी चलाएं।',
      '8. यदि सफलता नहीं मिलती है तो स्विच 154 को "I" पर रखकर बोगी-1 को आईसोलेट करें। TLC को सूचित करें।',
      '【स्थिति 2: जब "BOGIE 1 ISOLATED : Only half traction and electrical braking power available. Press <Enter>" मैसेज आये】',
      '1. कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ करें और फिर ऑन करें। पैंटो रेज़ करें, VCB क्लोज़ करें तथा ट्रैक्शन चालू करें।',
      '2. यदि वही मैसेज दोबारा आता है तो आधे ट्रैक्शन / ब्रेकिंग पावर से सामान्य ऑपरेशन चालू करें।',
      '3. TLC को सूचित करें तथा लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0207P1',
    subSystem: 'SS02',
    message: 'TRACTION MOTOR TEMPERATURE TOO HIGH\nConverter 1 blocked Bogie 1 may get isolated\n(एवं BOGIE 1 ISOLATED / Press <Enter>)',
    lamp: 'LSFI प्रकाशित होगी, आधा TE/BE उपलब्ध (आइसोलेट होने पर LSFI लगातार प्रकाशित रहेगी)',
    effect: 'कन्वर्टर-1 ब्लॉक होगा / बोगी-1 आइसोलेट हो सकती है (आधा TE/BE उपलब्ध)',
    actions: [
      '【स्थिति 1: जब "TRACTION MOTOR TEMPERATURE TOO HIGH, Converter 1 blocked Bogie 1 may get isolated" मैसेज आये】',
      '1. ब्लॉक सेक्शन क्लियर करें और थ्रोटल को " 0 " पर लायें। BPFA दबाकर फ़ॉल्ट ACK करें।',
      '2. ट्रैक्शन मोटर ब्लोअर-1 कार्य कर रहा है या नहीं, मैन्युअली एयर सक्शन द्वारा TM Louver पर चेक करें। HB-1 पैनल में लगे MCB 53.1/1 को चेक करें। यदि ट्रिप हो तो उसे VCB ओपन करके एक बार रीसेट करें।',
      '【स्थिति 2: जब "BOGIE 1 ISOLATED: Only half traction and electrical braking power available, Press <Enter>" मैसेज आये】',
      '1. MCB 53.1/1 और MCB 53.1/2 बार-बार ट्रिप होते हैं तो BUR-2 को आइसोलेट करें (MCE ऑफ़ करके)। VCB क्लोज़ करने का प्रयत्न करें।',
      '2. कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ करें और फिर ऑन करें। पैंटो उठायें, VCB क्लोज़ करने का प्रयत्न करें और यदि लोको सामान्य हो जाता है तो ट्रैक्शन चालू करें।',
      '3. यदि दोष दूर हो जाता है तो BUR-2 को आइसोलेट रखते हुए कार्य करें।',
      '4. यदि दोष कायम रहता है तो बोगी-1 अपने आप आइसोलेट हो जायेगी।',
      '5. यदि वही मैसेज पुनः आता है तो आधे ट्रैक्शन / ब्रेकिंग पावर के साथ सामान्य ऑपरेशन चालू करें।',
      '6. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0201P2',
    subSystem: 'SS02',
    message: 'EARTH FAULT IN CONVERTER 1\nNormal operation can continue\nTo be checked during maintenance',
    lamp: 'BPFA प्रकाशित होगा',
    effect: 'सामान्य ऑपरेशन जारी रहेगा',
    actions: [
      '1. BPFA दबाकर फ़ॉल्ट ACK करें। सामान्य ऑपरेशन चालू करें।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0202P2',
    subSystem: 'SS02',
    message: 'TRACTION MOTOR OVERSPEED\nTE is being reduced',
    lamp: 'BPFA प्रकाशित होगा',
    effect: 'TE कम हो रहा है',
    actions: [
      '1. गति कम करें। BPFA दबाकर फ़ॉल्ट ACK करें।',
      '2. सामान्य ऑपरेशन चालू करें।',
      '3. यदि स्पीड सीमा के अन्दर है और TE "0" तक कम होता है तो VCB ओपन करके बोगी-1 को स्विच 154 को "1" पर रखकर आईसोलेट करें।'
    ]
  },
  {
    id: 'F0203P2',
    subSystem: 'SS02',
    message: 'MUB RESISTANCE TOO HOT IN CONVERTER 1\nWait for 30 seconds',
    lamp: 'LSDJ और BPFA प्रकाशित होंगे, LSFI ब्लिंक करेगी',
    effect: 'VCB ओपन होगा',
    actions: [
      'MUB रेजिस्टेंस को ठंडा होने के लिए VCB क्लोज़ करने से पहले 30 सेकंड इंतज़ार करें (15.1 कनवर्टर क्यूबिकल में लगा है)। BPFA दबाकर फ़ॉल्ट ACK करें।',
      '30 सेकंड बाद VCB क्लोज़ करने के लिए BLDJ प्रेस करें।'
    ]
  },
  {
    id: 'F0204P2',
    subSystem: 'SS02',
    message: 'FAULTY MOTOR TEMPERATURE SENSOR\nNormal operation can continue\nTo be checked during maintenance',
    lamp: 'BPFA प्रकाशित होगा',
    effect: 'सामान्य ऑपरेशन जारी रहेगा',
    actions: [
      'BPFA दबाकर फ़ॉल्ट ACK करें। सामान्य ऑपरेशन चालू रखें।',
      'TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0205P2',
    subSystem: 'SS02',
    message: 'EQUIPMENT TEMPERATURE HIGH\nTE/BE is being reduced',
    lamp: 'BPFA प्रकाशित होगा',
    effect: 'TE/BE कम हो रहा है (Tractive/Braking Effort घट रहा है)',
    actions: [
      '1. ब्लॉक सेक्शन क्लियर करें और थ्रोटल को " 0 " पर लाएं। BPFA दबाकर फ़ॉल्ट ACK करें।',
      '2. ट्रांसफार्मर / कनवर्टर के ऑयल का तापमान सामान्य होने के लिए 10 मिनट या कुछ समय इंतज़ार करें।',
      '3. HB/SB पैनल में लगे सभी MCBs चेक करें, यदि ट्रिप हों तो उन्हें एक बार रीसेट करें।',
      '4. सभी ऑक्सिलरी तथा MRB (मशीन रूम ब्लोअर) का चलना सुनिश्चित करें।',
      '5. सामान्य ऑपरेशन चालू करें।',
      '6. यदि दोष दूर नहीं होता है तो कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ करें और फिर ऑन करें। पैंटो उठायें, VCB क्लोज़ करें। यदि लोको सामान्य होता है तो ट्रैक्शन चालू करें। अन्यथा बोगी कट आउट स्विच 154 को ऑपरेट करके बोगी-1 को आइसोलेट करें एवं TLC को सूचित करके, एक बोगी के साथ गाड़ी चलाएं।',
      '7. यदि 20 मिनट के अंदर सफलता न मिले तो सहायता इंजन की मांग करें।'
    ]
  },
  {
    id: 'F0206P2',
    subSystem: 'SS02',
    message: 'DC LINK CAPACITORS PRESSURE NOT OK\nNormal operation can continue\nTo be checked during maintenance',
    lamp: 'BPFA प्रकाशित होगा',
    effect: 'सामान्य ऑपरेशन जारी रहेगा',
    actions: [
      '1. BPFA द्वारा फ़ॉल्ट एकनॉलेज (ACK) करें और सामान्य ऑपरेशन चालू करें।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें। गंतव्य स्थान पर मेंटेनेंस स्टाफ को सूचित करें।',
      '3. मेंटेनेंस के दौरान DC Link कैपेसिटर्स को चेक करना चाहिए। कैपेसिटर ओपन सर्किट या खराब हो सकते हैं।'
    ]
  },
  {
    id: 'F0207P2',
    subSystem: 'SS02',
    message: 'WHEEL SKIDDING IN BOGIE 1 / Reduce BE\n(एवं Bombardier IGBT लोको में: LINE CONVERTER ISOLATED BOGIE 1 / Reduced Traction/Braking effort)',
    lamp: 'BPFA प्रकाशित होगा',
    effect: 'BE कम करने का निर्देश / आधा TE/BE उपलब्ध रहेगा',
    actions: [
      '【स्थिति 1: सामान्य लोको - WHEEL SKIDDING IN BOGIE 1 / Reduce BE】',
      '1. BPFA द्वारा फ़ॉल्ट एकनॉलेज (ACK) करें। पहियों का मुक्त रूप से घूमना (Check Free movement) सुनिश्चित करें।',
      '2. सुनिश्चित करें कि लोको पर ब्रेक बाइंडिंग नहीं है।',
      '3. जाँच करें कि सभी पार्किंग ब्रेक बराबर रिलीज़ हो चुके हैं।',
      '4. अगर गति 1 किमी/घंटा से ज़्यादा है और DDS में "Error Tacho Generator" का मैसेज है तो लोको पायलट सामान्य तरीके से कार्य कर सकता है।',
      '5. ब्रेकिंग एफ़र्ट (BE) को कम करें, चालू गाड़ी में आवाज़ से व्हील स्किडिंग का अनुभव करें। TLC को सूचित करें और लॉग बुक में दर्ज करें।',
      '6. BPCS व रिजनेरेटिव ब्रेक का उपयोग न करें।',
      '【स्थिति 2: M/s Bombardier Transportation IGBT कनवर्टर लोको - LINE CONVERTER ISOLATED BOGIE 1 / Reduced Traction/Braking effort】',
      '1. BPFA द्वारा फ़ॉल्ट एकनॉलेज (ACK) करें और आधे TE/BE द्वारा कार्य करें।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0207P2-BT',
    subSystem: 'SS02',
    message: 'LINE CONVERTER ISOLATED BOGIE 1\nReduced Traction/Braking effort\n(M/s BOMBARDIER Transportation IGBT Traction Converter)',
    lamp: 'BPFA प्रकाशित होगा',
    effect: 'आधा TE/BE उपलब्ध रहेगा',
    actions: [
      '1. BPFA द्वारा फ़ॉल्ट एकनॉलेज (ACK) करें और आधे TE/BE द्वारा कार्य करें।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0208P2',
    subSystem: 'SS02',
    message: 'DOPPLER RADAR FAILED\n(एवं Bombardier IGBT लोको में: MOTOR 1 ISOLATED BOGIE 1 / Reduced Traction/Braking effort)\n(एवं MEDHA IGBT लोको में: TM1 BOGIE 1 ISOLATED / TM 1 of bogie 1 isolated only 5/6th of Traction/electrical Braking power available)',
    lamp: 'BPFA प्रकाशित होगा',
    effect: 'सामान्य ऑपरेशन जारी रहेगा / Reduced TE/BE (Bombardier में आधा, MEDHA में 5/6th TE/BE उपलब्ध)',
    actions: [
      '【स्थिति 1: सामान्य लोको - DOPPLER RADAR FAILED】',
      '1. BPFA द्वारा फ़ॉल्ट एकनॉलेज (ACK) करें।',
      '2. यदि DDS पर बैकग्राउंड मैसेज "SLG1:0083/SLG2:0083 Radar control disabled/Faulty" आता है -',
      '3. सामान्य तरीके से कार्य करें।',
      '【स्थिति 2: M/s Bombardier Transportation IGBT कनवर्टर लोको - MOTOR 1 ISOLATED BOGIE 1 / Reduced Traction/Braking effort】',
      '1. BPFA द्वारा फ़ॉल्ट एकनॉलेज (ACK) करें और सामान्य ऑपरेशन चालू करें।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।',
      '【स्थिति 3: M/s MEDHA IGBT कनवर्टर लोको - TM1 BOGIE 1 ISOLATED / TM 1 of bogie 1 isolated only 5/6th of Traction/electrical Braking power available】',
      '1. BPFA द्वारा फ़ॉल्ट एकनॉलेज (ACK) करें और सामान्य ऑपरेशन चालू करें।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0208P2-BT',
    subSystem: 'SS02',
    message: 'MOTOR 1 ISOLATED BOGIE 1\nReduced Traction/Braking effort\n(M/s BOMBARDIER Transportation IGBT Traction Converter)',
    lamp: 'BPFA प्रकाशित होगा',
    effect: 'Reduced Traction/Braking effort (आधा TE/BE उपलब्ध)',
    actions: [
      '1. BPFA द्वारा फ़ॉल्ट एकनॉलेज (ACK) करें और सामान्य ऑपरेशन चालू करें।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0208P2-MEDHA',
    subSystem: 'SS02',
    message: 'TM1 BOGIE 1 ISOLATED\nTM 1 of bogie 1 isolated only 5/6th of Traction/electrical Braking power available\n(M/s MEDHA IGBT Traction Converter)',
    lamp: 'BPFA प्रकाशित होगा',
    effect: 'TM 1 आइसोलेट, केवल 5/6th ट्रैक्शन/इलेक्ट्रिकल ब्रेकिंग पावर उपलब्ध',
    actions: [
      '1. BPFA द्वारा फ़ॉल्ट एकनॉलेज (ACK) करें और सामान्य ऑपरेशन चालू करें।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0209P2',
    subSystem: 'SS02',
    message: 'MOTOR 2 ISOLATED BOGIE 1 / Reduced Traction/Braking effort (Bombardier IGBT)\n(एवं MEDHA IGBT लोको में: TM2 BOGIE 1 ISOLATED / TM 2 of bogie 1 isolated only 5/6th of Traction/electrical Braking power available)',
    lamp: 'BPFA प्रकाशित होगा',
    effect: 'Reduced TE/BE (Bombardier में आधा, MEDHA में बोगी-1 की TM-2 आइसोलेट, केवल 5/6th TE/BE उपलब्ध)',
    actions: [
      '【स्थिति 1: M/s Bombardier Transportation IGBT कनवर्टर लोको - MOTOR 2 ISOLATED BOGIE 1 / Reduced Traction/Braking effort】',
      '1. BPFA द्वारा फ़ॉल्ट एकनॉलेज (ACK) करें और सामान्य ऑपरेशन चालू करें।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।',
      '【स्थिति 2: M/s MEDHA IGBT कनवर्टर लोको - TM2 BOGIE 1 ISOLATED / TM 2 of bogie 1 isolated only 5/6th of Traction/electrical Braking power available】',
      '1. BPFA द्वारा फ़ॉल्ट एकनॉलेज (ACK) करें और सामान्य ऑपरेशन चालू करें।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0209P2-BT',
    subSystem: 'SS02',
    message: 'MOTOR 2 ISOLATED BOGIE 1\nReduced Traction/Braking effort\n(M/s BOMBARDIER Transportation IGBT Traction Converter)',
    lamp: 'BPFA प्रकाशित होगा',
    effect: 'Reduced Traction/Braking effort (आधा / घटा हुआ TE/BE उपलब्ध रहेगा)',
    actions: [
      '1. BPFA द्वारा फ़ॉल्ट एकनॉलेज (ACK) करें और सामान्य ऑपरेशन चालू करें।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0209P2-MEDHA',
    subSystem: 'SS02',
    message: 'TM2 BOGIE 1 ISOLATED\nTM 2 of bogie 1 isolated only 5/6th of Traction/electrical Braking power available\n(M/s MEDHA IGBT Traction Converter)',
    lamp: 'BPFA प्रकाशित होगा',
    effect: 'TM 2 आइसोलेट, केवल 5/6th ट्रैक्शन/इलेक्ट्रिकल ब्रेकिंग power उपलब्ध',
    actions: [
      '1. BPFA द्वारा फ़ॉल्ट एकनॉलेज (ACK) करें और सामान्य ऑपरेशन चालू करें।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0210P2',
    subSystem: 'SS02',
    message: 'MOTOR 3 ISOLATED BOGIE 1 / Reduced Traction/Braking effort (Bombardier IGBT)\n(एवं MEDHA IGBT लोको में: TM3 BOGIE 1 ISOLATED / TM 3 of bogie 1 isolated only 5/6th of Traction/electrical Braking power available)',
    lamp: 'BPFA प्रकाशित होगा',
    effect: 'Reduced TE/BE (Bombardier में आधा, MEDHA में बोगी-1 की TM-3 आइसोलेट, केवल 5/6th TE/BE उपलब्ध)',
    actions: [
      '【स्थिति 1: M/s Bombardier Transportation IGBT कनवर्टर लोको - MOTOR 3 ISOLATED BOGIE 1 / Reduced Traction/Braking effort】',
      '1. BPFA द्वारा फ़ॉल्ट एकनॉलेज (ACK) करें और सामान्य ऑपरेशन चालू करें।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।',
      '【स्थिति 2: M/s MEDHA IGBT कनवर्टर लोको - TM3 BOGIE 1 ISOLATED / TM 3 of bogie 1 isolated only 5/6th of Traction/electrical Braking power available】',
      '1. BPFA द्वारा फ़ॉल्ट एकनॉलेज (ACK) करें और सामान्य ऑपरेशन चालू करें।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0210P2-BT',
    subSystem: 'SS02',
    message: 'MOTOR 3 ISOLATED BOGIE 1\nReduced Traction/Braking effort\n(M/s BOMBARDIER Transportation IGBT Traction Converter)',
    lamp: 'BPFA प्रकाशित होगा',
    effect: 'Reduced Traction/Braking effort (आधा / घटा हुआ TE/BE उपलब्ध रहेगा)',
    actions: [
      '1. BPFA द्वारा फ़ॉल्ट एकनॉलेज (ACK) करें और सामान्य ऑपरेशन चालू करें।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0210P2-MEDHA',
    subSystem: 'SS02',
    message: 'TM3 BOGIE 1 ISOLATED\nTM 3 of bogie 1 isolated only 5/6th of Traction/electrical Braking power available\n(M/s MEDHA IGBT Traction Converter)',
    lamp: 'BPFA प्रकाशित होगा',
    effect: 'TM 3 आइसोलेट, केवल 5/6th ट्रैक्शन/इलेक्ट्रिकल ब्रेकिंग power उपलब्ध',
    actions: [
      '1. BPFA द्वारा फ़ॉल्ट एकनॉलेज (ACK) करें और सामान्य ऑपरेशन चालू करें।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0211P2',
    subSystem: 'SS02',
    message: 'MOTOR 1 BOGIE 1 ISOLATED / TM 1 isolated 5/6th power (BHEL IGBT)\n(एवं MEDHA IGBT लोको में: LINE CONVERTER 1 BOGIE 1 ISOLATED / LC1 of bogie 1 isolated only 3/4th of traction/electrical Braking power available)',
    lamp: 'BPFA प्रकाशित होगा',
    effect: 'BHEL लोको में TM 1 आइसोलेट (5/6th TE/BE), MEDHA लोको में LC1 आइसोलेट (3/4th TE/BE उपलब्ध)',
    actions: [
      '【स्थिति 1: M/s BHEL IGBT कनवर्टर लोको - MOTOR 1 BOGIE 1 ISOLATED / TM 1 of bogie 1 isolated only 5/6th of Traction/electrical Braking power available】',
      '1. BPFA द्वारा फ़ॉल्ट एकनॉलेज (ACK) करें और सामान्य ऑपरेशन चालू करें।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।',
      '【स्थिति 2: M/s MEDHA IGBT कनवर्टर लोको - LINE CONVERTER 1 BOGIE 1 ISOLATED / LC1 of bogie 1 isolated only 3/4th of traction/electrical Braking power available】',
      '1. BPFA द्वारा फ़ॉल्ट एकनॉलेज (ACK) करें और सामान्य ऑपरेशन चालू करें।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0211P2-BHEL',
    subSystem: 'SS02',
    message: 'MOTOR 1 BOGIE 1 ISOLATED\nTM 1 of bogie 1 isolated only 5/6th of Traction/electrical Braking power available\n(M/s BHEL IGBT Traction Converter)',
    lamp: 'BPFA प्रकाशित होगा',
    effect: 'TM 1 आइसोलेट, केवल 5/6th ट्रैक्शन/इलेक्ट्रिकल ब्रेकिंग पावर उपलब्ध',
    actions: [
      '1. BPFA द्वारा फ़ॉल्ट एकनॉलेज (ACK) करें और सामान्य ऑपरेशन चालू करें।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0211P2-MEDHA',
    subSystem: 'SS02',
    message: 'LINE CONVERTER 1 BOGIE 1 ISOLATED\nLC1 of bogie 1 isolated only 3/4th of traction/electrical Braking power available\n(M/s MEDHA IGBT Traction Converter)',
    lamp: 'BPFA प्रकाशित होगा',
    effect: 'बोगी-1 का LC1 आइसोलेट, केवल 3/4th ट्रैक्शन/इलेक्ट्रिकल ब्रेकिंग power उपलब्ध',
    actions: [
      '1. BPFA द्वारा फ़ॉल्ट एकनॉलेज (ACK) करें और सामान्य ऑपरेशन चालू करें।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0212P2',
    subSystem: 'SS02',
    message: 'MOTOR 2 BOGIE 1 ISOLATED / TM 2 isolated 5/6th power (BHEL IGBT)\n(एवं MEDHA IGBT लोको में: LINE CONVERTER 2 BOGIE 1 ISOLATED / LC2 of bogie 1 isolated only 3/4th of traction/electrical Braking power available)',
    lamp: 'BPFA प्रकाशित होगा',
    effect: 'BHEL लोको में TM 2 आइसोलेट (5/6th TE/BE), MEDHA लोको में LC2 आइसोलेट (3/4th TE/BE उपलब्ध)',
    actions: [
      '【स्थिति 1: M/s BHEL IGBT कनवर्टर लोको - MOTOR 2 BOGIE 1 ISOLATED / TM 2 of bogie 1 isolated only 5/6th of Traction/electrical Braking power available】',
      '1. BPFA द्वारा फ़ॉल्ट एकनॉलेज (ACK) करें और सामान्य ऑपरेशन चालू करें।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।',
      '【स्थिति 2: M/s MEDHA IGBT कनवर्टर लोको - LINE CONVERTER 2 BOGIE 1 ISOLATED / LC2 of bogie 1 isolated only 3/4th of traction/electrical Braking power available】',
      '1. BPFA द्वारा फ़ॉल्ट एकनॉलेज (ACK) करें और सामान्य ऑपरेशन चालू करें।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0212P2-BHEL',
    subSystem: 'SS02',
    message: 'MOTOR 2 BOGIE 1 ISOLATED\nTM 2 of bogie 1 isolated only 5/6th of Traction/electrical Braking power available\n(M/s BHEL IGBT Traction Converter)',
    lamp: 'BPFA प्रकाशित होगा',
    effect: 'TM 2 आइसोलेट, केवल 5/6th ट्रैक्शन/इलेक्ट्रिकल ब्रेकिंग power उपलब्ध',
    actions: [
      '1. BPFA द्वारा फ़ॉल्ट एकनॉलेज (ACK) करें और सामान्य ऑपरेशन चालू करें।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0212P2-MEDHA',
    subSystem: 'SS02',
    message: 'LINE CONVERTER 2 BOGIE 1 ISOLATED\nLC2 of bogie 1 isolated only 3/4th of traction/electrical Braking power available\n(M/s MEDHA IGBT Traction Converter)',
    lamp: 'BPFA प्रकाशित होगा',
    effect: 'बोगी-1 का LC2 आइसोलेट, केवल 3/4th ट्रैक्शन/इलेक्ट्रिकल ब्रेकिंग power उपलब्ध',
    actions: [
      '1. BPFA द्वारा फ़ॉल्ट एकनॉलेज (ACK) करें और सामान्य ऑपरेशन चालू करें।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0213P2',
    subSystem: 'SS02',
    message: 'MOTOR 3 BOGIE 1 ISOLATED\nTM 3 of bogie 1 isolated only 5/6th of traction/electrical Braking power available\n(M/s BHEL IGBT Traction Converter)',
    lamp: 'BPFA प्रकाशित होगा',
    effect: 'TM 3 आइसोलेट, केवल 5/6th ट्रैक्शन/इलेक्ट्रिकल ब्रेकिंग power उपलब्ध',
    actions: [
      '1. BPFA द्वारा फ़ॉल्ट एकनॉलेज (ACK) करें और सामान्य ऑपरेशन चालू करें।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0214P2',
    subSystem: 'SS02',
    message: 'LINE CONVERTER 1 BOGIE 1 ISOLATED\nLC1 of bogie 1 isolated only 3/4th of traction/electrical Braking power available\n(M/s BHEL IGBT Traction Converter)',
    lamp: 'BPFA प्रकाशित होगा',
    effect: 'बोगी-1 का LC1 आइसोलेट, केवल 3/4th ट्रैक्शन/इलेक्ट्रिकल ब्रेकिंग पावर उपलब्ध',
    actions: [
      '1. BPFA द्वारा फ़ॉल्ट एकनॉलेज (ACK) करें और सामान्य ऑपरेशन चालू करें।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0215P2',
    subSystem: 'SS02',
    message: 'LINE CONVERTER 2 BOGIE 1 ISOLATED\nLC2 of bogie 1 isolated only 3/4th of traction/electrical Braking power available\n(M/s BHEL IGBT Traction Converter)',
    lamp: 'BPFA प्रकाशित होगा',
    effect: 'बोगी-1 का LC2 आइसोलेट, केवल 3/4th ट्रैक्शन/इलेक्ट्रिकल ब्रेकिंग पावर उपलब्ध',
    actions: [
      '1. BPFA द्वारा फ़ॉल्ट एकनॉलेज (ACK) करें और सामान्य ऑपरेशन चालू करें।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0301P1',
    subSystem: 'SS03',
    message: 'DISTURBANCE IN CONVERTER 2\nTry to close VCB again',
    lamp: 'LSDJ और BPFA प्रकाशित होंगे, LSFI ब्लिंक करेगी',
    effect: "VCB ओपन होगा, TE/BE '0' हो जाएगा",
    actions: [
      '1. थ्रॉटल को " 0 " पर लायें। BPFA दबाकर फ़ॉल्ट ACK करें।',
      '2. MCB 127.1/2 (SB2) चेक करें। यदि ट्रिप है तो कंट्रोल इलेक्ट्रॉनिक्स को ऑफ करके एक बार रीसेट करें।',
      '3. VCB क्लोज करने के लिए BLDJ प्रेस करें।',
      '4. यदि वही मैसेज दोबारा आता है तो कंट्रोल इलेक्ट्रॉनिक्स को ऑफ करके 5 मिनट बाद ऑन करें। पेंटो उठायें और VCB क्लोज करें, यदि लोको सामान्य होता है तो ट्रैक्शन चालू करें।',
      '5. यदि वही मैसेज दोबारा आता है और ट्रैक्शन बोगी-2 अपने आप आइसोलेट नहीं होती है तो SB-2 पैनल में लगे MCB 127.1/2 एवं 127.11/2 (SB-2) द्वारा बोगी-2 को आइसोलेट करें। (MCE ऑफ करके)',
      '6. TLC को सूचित करें तथा बोगी आइसोलेट करने से पहले आये हुए DDS मैसेज को लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'SS03-BOGIE2-ISOLATED',
    subSystem: 'SS03',
    message: 'BOGIE 2 ISOLATED :\nOnly half traction and electrical braking power available\nPress <Enter>',
    lamp: 'BPFA प्रकाशित होगा',
    effect: 'बोगी-2 आइसोलेट रहेगी, केवल आधा ट्रैक्शन और इलेक्ट्रिकल ब्रेकिंग पावर उपलब्ध रहेगा',
    actions: [
      '1. यदि लोको पायलट 154 स्विच के द्वारा बोगी-2 को आइसोलेट करता है तो उसके बाद डिस्प्ले बोर्ड पर ENTER Key प्रेस करें, अन्यथा-',
      '2. कंट्रोल इलेक्ट्रॉनिक्स को ऑफ करें और फिर ऑन करें। पेंटो उठायें, VCB क्लोज करें तथा ट्रैक्शन चालू करें।',
      '3. यदि वही मैसेज दोबारा आता है तो आधे ट्रैक्शन / ब्रेकिंग पावर से सामान्य ऑपरेशन चालू करें।',
      '4. TLC को सूचित करें तथा लॉग बुक में दर्ज करें।',
      '★ नोट: कंट्रोल इलेक्ट्रॉनिक्स को निम्न DDS मैसेज के लिए ऑफ / ऑन करने से बचें (पेज 155):',
      '• यदि ASC 2: Error PS hardware के बाद निम्न में से कोई मैसेज आता है:',
      '  a) ASC 2: Error PS Fault storage CGP अथवा ASC 2: Error PS Fault storage GBC.',
      '  b) NSC 2: Error PS hardware के बाद NSC 2: Error PS Fault storage GBC और ASC 2: 0052/0053/0054 (Bogie 2 Error Tacho generator).'
    ]
  },
  {
    id: 'F0302P1',
    subSystem: 'SS03',
    message: 'CONVERTER CONTACTOR STUCK OFF\nTry to close VCB again\n(एवं BOGIE 2 ISOLATED / Press <Enter>)',
    lamp: 'LSDJ और BPFA प्रकाशित होंगे, LSFI ब्लिंक करेगी',
    effect: 'VCB ओपन होगा / बोगी-2 आइसोलेट होगी (आधा TE/BE उपलब्ध)',
    actions: [
      '【स्थिति 1: जब "CONVERTER CONTACTOR STUCK OFF, Try to close VCB again" मैसेज आये】',
      '1. थ्रोटल को “ 0 ” पर लायें। BPFA दबाकर फ़ॉल्ट ACK करें।',
      '2. CCB-2 लोको में - MR और FP प्रेशर गेज़ की जाँच करें। यदि प्रेशर कम होता है तो MPJ को ‘ 0 ’ पर रखकर उसे दुरुस्त करें।',
      '3. VCB क्लोज़ करने के लिए BLDJ प्रेस करें।',
      '4. SR-2 {ट्रैक्शन कनवर्टर-2} में एयर लीकेज की जाँच करें। यदि एयर लीकेज है तो संबंधित SR को न्यूमैटिक पैनल पर लगे कॉक (88) द्वारा आइसोलेट करें। न्यूमैटिक पैनल पर COC 88 बायीं ओर अन्दर की तरफ {ऊपर से दूसरा} को आइसोलेट करें तथा उसके बाद बोगी-2 को स्विच 154 (SB-1) के द्वारा आइसोलेट करें।',
      '5. VCB क्लोज़ करने के लिए BLDJ प्रेस करें। यदि VCB क्लोज़ नहीं होता है और वही मैसेज आता है तब बोगी-2 को आइसोलेट करें।',
      '【स्थिति 2: जब "BOGIE 2 ISOLATED : Only half traction and electrical braking power available. Press <Enter>" मैसेज आये】',
      '1. यदि लोको पायलट 154 स्विच के द्वारा बोगी-2 को आइसोलेट करता है तो उसके बाद केवल Display Key Board पर ENTER Key प्रेस करें, अन्यथा -',
      '2. कंट्रोल इलेक्ट्रॉनिक्स को ऑफ करें और फिर ऑन करें। पेंटो उठायें, VCB क्लोज़ करें और ट्रैक्शन चालू करें।',
      '3. यदि वही मैसेज दोबारा आता है तो आधे ट्रैक्शन / ब्रेकिंग पावर से सामान्य ऑपरेशन चालू करें।',
      '4. TLC को सूचित करें तथा लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0303P1',
    subSystem: 'SS03',
    message: 'GATE UNIT SUPPLY STUCK OFF\nTry to close VCB again\n(एवं BOGIE 2 ISOLATED / Press <Enter>)',
    lamp: 'LSDJ और BPFA प्रकाशित होंगे, LSFI ब्लिंक करेगी',
    effect: 'VCB ओपन होगा / बोगी-2 आइसोलेट होगी (आधा TE/BE उपलब्ध)',
    actions: [
      '【स्थिति 1: जब "GATE UNIT SUPPLY STUCK OFF, Try to close VCB again" मैसेज आये】',
      '1. थ्रोटल को “ 0 ” पर लायें। BPFA दबाकर फ़ॉल्ट ACK करें।',
      '2. SB-2 पर लगे MCB 127.11/2 की जाँच करें। यदि कोई MCB ट्रिप हो तो कंट्रोल इलेक्ट्रॉनिक्स को ऑफ करके एक बार रीसेट करें।',
      '3. VCB क्लोज़ करने के लिए BLDJ प्रेस करें।',
      '【स्थिति 2: जब "BOGIE 2 ISOLATED : Only half traction and electrical braking power available. Press <Enter>" मैसेज आये】',
      '1. ब्लॉक सेक्शन क्लियर करें या TLC की अनुमति से एक बोगी से कार्य करें।',
      '2. SB-2 में लगे MCB 127.11/2 को चेक करें। यदि ट्रिप मिलता है तो कंट्रोल इलेक्ट्रॉनिक्स को ऑफ करके एक बार रीसेट करें।',
      '3. यदि सफलता नहीं मिलती तो कंट्रोल इलेक्ट्रॉनिक्स को ऑफ करें और फिर ऑन करें। पेंटो उठायें, VCB क्लोज़ करें और ट्रैक्शन चालू करें।',
      '4. यदि वही मैसेज दोबारा आता है तो आधे ट्रैक्शन / ब्रेकिंग पावर से सामान्य ऑपरेशन चालू करें।',
      '5. TLC को सूचित करें तथा लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0305P1',
    subSystem: 'SS03',
    message: 'CONVERTER -2 OIL TEMPERATURE TOO HIGH\nTry to close VCB again\n(एवं BOGIE 2 ISOLATED / Press <Enter>)',
    lamp: 'LSDJ और BPFA प्रकाशित होंगे, LSFI ब्लिंक करेगी (आइसोलेट होने पर LSFI लगातार जलती रहेगी)',
    effect: 'VCB ओपन होगा / बोगी-2 आइसोलेट होगी (आधा TE/BE उपलब्ध)',
    actions: [
      '【स्थिति 1: जब "CONVERTER -2 OIL TEMPERATURE TOO HIGH, Try to close VCB again" मैसेज आये】',
      '1. थ्रोटल को “ 0 ” पर लायें। BPFA दबाकर फ़ॉल्ट ACK करें।',
      '2. कनवर्टर क्यूबिकल पर लगे कनवर्टर एक्सपेंशन टैंक में ऑयल लेवल की जाँच करें।',
      '3. HB-2 पैनल में लगे MCB 59.1/2 और 63.1/2 की जाँच करें। यदि ट्रिप मिले तो VCB ओपन करके एक बार रीसेट करें और ट्रैक्शन कनवर्टर पंप-2 का चलना सुनिश्चित करें। OCB-2 का कार्य अंडरफ्रेम में लगे रेडिएटर से हवा आने के द्वारा सुनिश्चित करें।',
      '4. लोको पायलट OCB-2 के इम्पेल्लर व केसिंग की किसी भी क्षति को चेक करें। यदि क्षतिग्रस्त पाते हैं तो VCB ओपन करके पैंटो लोअर करें। HB-2 में लगे MCB 59.1/2, MCB 62.1/2 व MCB 63.1/2 को ट्रिप करें, फिर बाद में स्विच 154 (SB-1) के द्वारा बोगी-2 को आइसोलेट करें।',
      '5. लोको को एनर्जाइज करें व एक बोगी के साथ गाड़ी चलायें। इस स्थिति में LSFI लगातार जलती रहेगी। TLC को सूचित करें तथा लॉग बुक में दर्ज करें।',
      '【स्थिति 2: जब "BOGIE 2 ISOLATED : Only half traction and electrical braking power available. Press <Enter>" मैसेज आये】',
      '1. एक बार कंट्रोल इलेक्ट्रॉनिक्स को ऑफ करें और ऑन करें। पैंटो रेज़ करें, VCB क्लोज़ करें तथा ट्रैक्शन चालू करें।',
      '2. यदि वही मैसेज दोबारा आता है तो आधे ट्रैक्शन / ब्रेकिंग पावर से सामान्य ऑपरेशन चालू करें।',
      '3. TLC को सूचित करें तथा लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0306P1',
    subSystem: 'SS03',
    message: 'CONVERTER 2 OIL PRESSURE NOT OK\nCheck oil level\nTry to close the VCB again\n(एवं BOGIE 2 ISOLATED / Press <Enter>)',
    lamp: 'LSDJ और BPFA प्रकाशित होंगे, LSFI ब्लिंक करेगी (क्रम 2 व 5 स्थिति अथवा आइसोलेट होने पर LSFI लगातार प्रकाशित रहेगी)',
    effect: 'VCB ओपन होगा / बोगी-2 आइसोलेट होगी (आधा TE/BE उपलब्ध)',
    actions: [
      '【स्थिति 1: जब "CONVERTER 2 OIL PRESSURE NOT OK, Check oil level, Try to close the VCB again" मैसेज आये】',
      '1. थ्रोटल को “ 0 ” पर लायें। BPFA दबाकर फ़ॉल्ट ACK करें।',
      '2. कनवर्टर पर लगे कनवर्टर एक्सपेंशन टैंक में ऑयल लेवल की जाँच करें। यदि मैक्सिमम से ऊपर या मिनिमम से नीचे है तो बोगी-2 को स्विच 154 के द्वारा ‘ II ’ पर रखकर आइसोलेट करके आधे ट्रैक्शन से कार्य करें।',
      '3. यदि ऑयल लेवल बराबर है तो HB-2 पैनल में MCB 63.1/2 को चेक करें। यदि ट्रिप है तो उसे VCB ओपन करके एक बार रीसेट करें। मशीन रूम में SR-2 का ऑयल पंप चल रहा है या नहीं, इसकी जाँच उसके इनलेट तथा आउटलेट पाइप को छूकर करें।',
      '4. यदि MCB 63.1/2 को एक बार रीसेट करने के बाद दोबारा ट्रिप होता है तो उसे रीसेट न करें। बोगी-2 अपने आप आइसोलेट हो जायेगी और LSFI लगातार प्रकाशित होगी। आधे ट्रैक्शन के साथ कार्य करें।',
      '5. लोको पायलट ट्रैक्शन कनवर्टर-2 के ऑयल की पाइप लाइन को ऑयल लीकेज तथा कोई क्षति के लिए चेक करें, जिसमें तेल का रिसाव हो सकता है और ऑयल कूलिंग ब्लोअर-2 (OCB-2) की केसिंग को इम्पेल्लर की खराबी से कोई क्षति तो नहीं है चेक करें। ऐसी स्थिति में रेडिएटर के क्षतिग्रस्त होने से तेल के रिसाव के कारण ‘ Converter No.2 oil pressure low ’ का मैसेज आ सकता है। लोको पायलट VCB ओपन करें, पैंटो लोअर करें और HB-2 पैनल पर लगे MCB 59.1/2 और MCB 63.1/2 को ट्रिप करें। बोगी-2 को स्विच 154 द्वारा ‘ II ’ पर रखकर आइसोलेट करें। लोको एनर्जाइज करके एक बोगी द्वारा कार्य करें। (उपरोक्त क्रम सं. 2 और 5 की स्थिति में LSFI लगातार प्रकाशित रहेगी। TLC को सूचित करें तथा लॉग बुक में दर्ज करें।)',
      '6. यदि SR-2 ऑयल पंप सामान्य है तो कंट्रोल इलेक्ट्रॉनिक्स को ऑफ करके BUR-2 को MCB 127.22/2 के द्वारा आइसोलेट करें।',
      '7. यदि सफलता मिलती है तो BUR-2 को आइसोलेट रखते हुए गाड़ी चलाएं।',
      '8. यदि सफलता नहीं मिलती है तो बोगी-2 को स्विच 154 को ‘ II ’ पर रखकर आइसोलेट करें। TLC को सूचित करें।',
      '【स्थिति 2: जब "BOGIE 2 ISOLATED : Only half traction and electrical braking power available. Press <Enter>" मैसेज आये】',
      '1. कंट्रोल इलेक्ट्रॉनिक्स को ऑफ करें और फिर ऑन करें। पैंटो रेज़ करें, VCB क्लोज़ करें तथा ट्रैक्शन चालू करें।',
      '2. यदि वही मैसेज दोबारा आता है तो आधे ट्रैक्शन / ब्रेकिंग पावर से सामान्य ऑपरेशन चालू करें।',
      '3. TLC को सूचित करें तथा लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0307P1',
    subSystem: 'SS03',
    message: 'TRACTION MOTOR TEMPERATURE TOO HIGH\nConverter 2 blocked Bogie 2 mayget isolated\n(एवं BOGIE 2 ISOLATED / Press <Enter>)',
    lamp: 'LSFI प्रकाशित होगी, आधा TE/BE उपलब्ध (आइसोलेट होने पर LSFI लगातार प्रकाशित रहेगी)',
    effect: 'कन्वर्टर-2 ब्लॉक होगा / बोगी-2 आइसोलेट हो सकती है (आधा TE/BE उपलब्ध)',
    actions: [
      '【स्थिति 1: जब "TRACTION MOTOR TEMPERATURE TOO HIGH, Converter 2 blocked Bogie 2 mayget isolated" मैसेज आये】',
      '1. ब्लॉक सेक्शन क्लियर करें और थ्रॉटल को ‘ 0 ’ पर लायें। BPFA दबाकर फ़ॉल्ट ACK करें।',
      '2. ट्रैक्शन मोटर ब्लोअर-2 (TMB-2) कार्य कर रहा है या नहीं, मैन्युअली एयर सक्शन द्वारा TM Louver पर चेक करें। HB-2 पैनल में लगे MCB 53.1/2 को चेक करें। यदि ट्रिप है तो उसे VCB ओपन करके एक बार रीसेट करें।',
      '【स्थिति 2: जब "BOGIE 2 ISOLATED : Only half traction and electrical braking power available Press <Enter>" मैसेज आये】',
      '1. MCB 53.1/1 और MCB 53.1/2 बार-बार ट्रिप होते हैं तो BUR-2 को आइसोलेट करें (MCE ऑफ करके)। VCB क्लोज़ करने का प्रयत्न करें।',
      '2. कंट्रोल इलेक्ट्रॉनिक्स को ऑफ करें और फिर ऑन करें। पैंटो उठायें, VCB क्लोज़ करने का प्रयत्न करें और यदि लोको सामान्य हो जाता है तो ट्रैक्शन चालू करें।',
      '3. यदि दोष दूर हो जाता है तो BUR-2 को आइसोलेट रखते हुए कार्य करें।',
      '4. यदि दोष कायम रहता है तो बोगी-2 अपने आप आइसोलेट हो जायेगी।',
      '5. यदि वही मैसेज पुनः आता है तो आधे ट्रैक्शन / ब्रेकिंग पावर के साथ सामान्य ऑपरेशन चालू करें।',
      '6. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0301P2',
    subSystem: 'SS03',
    message: 'EARTH FAULT IN CONVERTER 2\nNormal operation can continue\nTo be checked during maintenance',
    lamp: 'BPFA प्रकाशित होगा',
    effect: 'सामान्य ऑपरेशन जारी रहेगा',
    actions: [
      '1. BPFA दबाकर फ़ॉल्ट ACK करें। सामान्य ऑपरेशन चालू करें।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0302P2',
    subSystem: 'SS03',
    message: 'TRACTION MOTOR OVER SPEED\nREDUCE LOCO SPEED',
    lamp: 'BPFA प्रकाशित होगा',
    effect: 'गति कम करने का निर्देश / TE ‘ 0 ’ तक कम हो सकता है',
    actions: [
      '1. गति कम करें। BPFA दबाकर फ़ॉल्ट ACK करें।',
      '2. सामान्य ऑपरेशन चालू करें।',
      '3. यदि स्पीड सीमा के अंदर है और TE ‘ 0 ’ तक कम होता है तो VCB ओपन करके बोगी-2 को स्विच 154 को ‘ II ’ पर रखकर आइसोलेट करें।'
    ]
  },
  {
    id: 'F0303P2',
    subSystem: 'SS03',
    message: 'MUB RESISTANCE TOO HOT IN CONVERTER 2\nWait for 30 seconds',
    lamp: 'LSDJ और BPFA प्रकाशित होंगे, LSFI ब्लिंक करेगी',
    effect: 'VCB ओपन होगा',
    actions: [
      '1. MUB रेजिस्टेंस को ठंडा होने के लिए VCB क्लोज़ करने से पहले 30 सेकंड इंतज़ार करें। {15.1 कनवर्टर क्यूबिकल में लगा है} BPFA दबाकर फ़ॉल्ट ACK करें।',
      '2. VCB क्लोज़ करने के लिए BLDJ को प्रेस करें।'
    ]
  },
  {
    id: 'F0304P2',
    subSystem: 'SS03',
    message: 'FAULTY MOTOR TEMPERATURE SENSOR\nNormal operation can continue\nTo be checked during maintenance',
    lamp: 'BPFA प्रकाशित होगा',
    effect: 'सामान्य ऑपरेशन जारी रहेगा',
    actions: [
      '1. BPFA दबाकर फ़ॉल्ट ACK करें। सामान्य ऑपरेशन चालू करें।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0305P2',
    subSystem: 'SS03',
    message: 'EQUIPMENT TEMPERATURE HIGH\nTE/BE is being reduced',
    lamp: 'BPFA प्रकाशित होगा',
    effect: 'TE/BE कम हो रहा है (Tractive / Electrical Braking Effort घट रहा है)',
    actions: [
      '1. ब्लॉक सेक्शन क्लियर करें और थ्रोटल को ‘ 0 ’ पर लाएं। BPFA दबाकर फ़ॉल्ट ACK करें।',
      '2. ट्रांसफार्मर / कनवर्टर के ऑयल का तापमान सामान्य होने के लिए 10 मिनट या कुछ समय इंतज़ार करें।',
      '3. HB/SB पैनल में लगे सभी MCB चेक करें यदि ट्रिप हैं तो उसे एक बार रीसेट करें।',
      '4. सभी ऑक्सिलरी तथा MRB का चलना सुनिश्चित करें।',
      '5. सामान्य ऑपरेशन चालू करें।',
      '6. यदि दोष दूर नहीं होता है तो कंट्रोल इलेक्ट्रॉनिक्स को ऑफ करें और फिर ऑन करें। पैंटो रेज़ करें, VCB क्लोज़ करें, यदि लोको सामान्य होता है तो ट्रैक्शन चालू करें। अन्यथा बोगी कट आउट स्विच 154 को ऑपरेट करके बोगी-2 को आइसोलेट करें एवं TLC को सूचित करके एक बोगी के साथ गाड़ी चलाएं।',
      '7. यदि 20 मिनट के अंदर सफलता न मिले तो सहायता इंजन की मांग करें।'
    ]
  },
  {
    id: 'F0306P2',
    subSystem: 'SS03',
    message: 'DC LINK CAPACITORS\nPRESSURE NOT OK\nNormal operation can continue\nTo be checked during\nmaintenance',
    lamp: 'BPFA प्रकाशित होगा',
    effect: 'सामान्य ऑपरेशन जारी रहेगा',
    actions: [
      '1. BPFA द्वारा फ़ॉल्ट एकनॉलेज (ACK) करें और सामान्य ऑपरेशन चालू करें।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें। गंतव्य स्थान पर मेंटेनेंस स्टाफ़ को सूचित करें।',
      '3. मेंटेनेंस के दौरान DC Link कैपेसिटर को चेक करना चाहिए। कैपेसिटर ओपन सर्किट या ख़राब हो सकते हैं।'
    ]
  },
  {
    id: 'F0307P2',
    subSystem: 'SS03',
    message: 'WHEEL SKIDDING IN BOGIE 2\nReduce BE\n(एवं Bombardier IGBT लोको में: LINE CONVERTER ISOLATED BOGIE 2 / Reduced Traction/Braking effort)',
    lamp: 'BPFA प्रकाशित होगा',
    effect: 'BE कम करने का निर्देश / आधा TE/BE उपलब्ध रहेगा',
    actions: [
      '【स्थिति 1: सामान्य लोको - WHEEL SKIDDING IN BOGIE 2 / Reduce BE】',
      '1. BPFA द्वारा फ़ॉल्ट एकनॉलेज (ACK) करें। पहियों का मुक्त रूप से घूमना (Check Free movement) सुनिश्चित करें।',
      '2. सुनिश्चित करें कि लोको पर ब्रेक बाइंडिंग तो नहीं है।',
      '3. जाँच करें कि सभी पार्किंग ब्रेक बराबर रिलीज़ हो चुके हैं।',
      '4. यदि गति 1 किमी/घंटा से ज़्यादा है और DDS में “ Error Tacho Generator ” का मैसेज है तो लोको पायलट सामान्य तरीके से कार्य कर सकता है।',
      '5. ब्रेकिंग एफ़र्ट (BE) को कम करें, चालू गाड़ी में आवाज़ से व्हील स्किडिंग का अनुभव करें। TLC को सूचित करें और लॉग बुक में दर्ज करें।',
      '6. BPCS व रिजनेरेटिव ब्रेक का उपयोग न करें।',
      '【स्थिति 2: M/s Bombardier Transportation IGBT कनवर्टर लोको - LINE CONVERTER ISOLATED BOGIE 2 / Reduced Traction/Braking effort】',
      '1. BPFA द्वारा फ़ॉल्ट एकनॉलेज (ACK) करें और आधे TE/BE द्वारा कार्य करें।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0308P2',
    subSystem: 'SS03',
    message: 'MOTOR 1 ISOLATED BOGIE 2 / Reduced Traction/Braking effort (Bombardier IGBT)\n(एवं MEDHA IGBT लोको में: TM1 BOGIE 2 ISOLATED / TM 1 of bogie 2 isolated only 5/6th of Traction/electrical Braking power available)',
    lamp: 'BPFA प्रकाशित होगा',
    effect: 'Reduced TE/BE (Bombardier में आधा, MEDHA में बोगी-2 की TM-1 आइसोलेट, केवल 5/6th TE/BE उपलब्ध)',
    actions: [
      '【स्थिति 1: M/s Bombardier Transportation IGBT कनवर्टर लोको - MOTOR 1 ISOLATED BOGIE 2 / Reduced Traction/Braking effort】',
      '1. BPFA द्वारा फ़ॉल्ट एकनॉलेज (ACK) करें और सामान्य ऑपरेशन चालू करें।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।',
      '【स्थिति 2: M/s MEDHA IGBT कनवर्टर लोको - TM1 BOGIE 2 ISOLATED / TM 1 of bogie 2 isolated only 5/6th of Traction/electrical Braking power available】',
      '1. BPFA द्वारा फ़ॉल्ट एकनॉलेज (ACK) करें और सामान्य ऑपरेशन चालू करें।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0308P2-BT',
    subSystem: 'SS03',
    message: 'MOTOR 1 ISOLATED\nBOGIE 2\nReduced Traction/Braking effort\n(M/s BOMBARDIER Transportation IGBT Traction Converter)',
    lamp: 'BPFA प्रकाशित होगा',
    effect: 'Reduced Traction/Braking effort (आधा TE/BE उपलब्ध रहेगा)',
    actions: [
      '1. BPFA द्वारा फ़ॉल्ट एकनॉलेज (ACK) करें और सामान्य ऑपरेशन चालू करें।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0308P2-MEDHA',
    subSystem: 'SS03',
    message: 'TM1 BOGIE 2 ISOLATED\nTM 1 of bogie 2 isolated only 5/6th of Traction/electrical Braking power available.\n(M/s MEDHA IGBT Traction Converter)',
    lamp: 'BPFA प्रकाशित होगा',
    effect: 'TM 1 आइसोलेट, केवल 5/6th ट्रैक्शन/इलेक्ट्रिकल ब्रेकिंग पावर उपलब्ध रहेगा',
    actions: [
      '1. BPFA द्वारा फ़ॉल्ट एकनॉलेज (ACK) करें और सामान्य ऑपरेशन चालू करें।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0309P2',
    subSystem: 'SS03',
    message: 'MOTOR 2 ISOLATED BOGIE 2 / Reduced Traction/Braking effort (Bombardier IGBT)\n(एवं MEDHA IGBT लोको में: TM2 BOGIE 2 ISOLATED / TM 2 of bogie 2 isolated only 5/6th of Traction/electrical Braking power available)',
    lamp: 'BPFA प्रकाशित होगा',
    effect: 'Reduced TE/BE (Bombardier में आधा, MEDHA में बोगी-2 की TM-2 आइसोलेट, केवल 5/6th TE/BE उपलब्ध)',
    actions: [
      '【स्थिति 1: M/s Bombardier Transportation IGBT कनवर्टर लोको - MOTOR 2 ISOLATED BOGIE 2 / Reduced Traction/Braking effort】',
      '1. BPFA द्वारा फ़ॉल्ट एकनॉलेज (ACK) करें और सामान्य ऑपरेशन चालू करें।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।',
      '【स्थिति 2: M/s MEDHA IGBT कनवर्टर लोको - TM2 BOGIE 2 ISOLATED / TM 2 of bogie 2 isolated only 5/6th of Traction/electrical Braking power available】',
      '1. BPFA द्वारा फ़ॉल्ट एकनॉलेज (ACK) करें और सामान्य ऑपरेशन चालू करें।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0309P2-BT',
    subSystem: 'SS03',
    message: 'MOTOR 2 ISOLATED\nBOGIE 2\nReduced Traction/Braking effort\n(M/s BOMBARDIER Transportation IGBT Traction Converter)',
    lamp: 'BPFA प्रकाशित होगा',
    effect: 'Reduced Traction/Braking effort (आधा TE/BE उपलब्ध रहेगा)',
    actions: [
      '1. BPFA द्वारा फ़ॉल्ट एकनॉलेज (ACK) करें और सामान्य ऑपरेशन चालू करें।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0309P2-MEDHA',
    subSystem: 'SS03',
    message: 'TM2 BOGIE 2 ISOLATED\nTM 2 of bogie 2 isolated only 5/6th of Traction/electrical Braking power available.\n(M/s MEDHA IGBT Traction Converter)',
    lamp: 'BPFA प्रकाशित होगा',
    effect: 'TM 2 आइसोलेट, केवल 5/6th ट्रैक्शन/इलेक्ट्रिकल ब्रेकिंग पावर उपलब्ध रहेगा',
    actions: [
      '1. BPFA द्वारा फ़ॉल्ट एकनॉलेज (ACK) करें और सामान्य ऑपरेशन चालू करें।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0310P2',
    subSystem: 'SS03',
    message: 'MOTOR 3 ISOLATED BOGIE 2 / Reduced Traction/Braking effort (Bombardier IGBT)\n(एवं MEDHA IGBT लोको में: TM3 BOGIE 2 ISOLATED / TM 3 of bogie 2 isolated only 5/6th of Traction/electrical Braking power available)',
    lamp: 'BPFA प्रकाशित होगा',
    effect: 'Reduced TE/BE (Bombardier में आधा, MEDHA में बोगी-2 की TM-3 आइसोलेट, केवल 5/6th TE/BE उपलब्ध)',
    actions: [
      '【स्थिति 1: M/s Bombardier Transportation IGBT कनवर्टर लोको - MOTOR 3 ISOLATED BOGIE 2 / Reduced Traction/Braking effort】',
      '1. BPFA द्वारा फ़ॉल्ट एकनॉलेज (ACK) करें और सामान्य ऑपरेशन चालू करें।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।',
      '【स्थिति 2: M/s MEDHA IGBT कनवर्टर लोको - TM3 BOGIE 2 ISOLATED / TM 3 of bogie 2 isolated only 5/6th of Traction/electrical Braking power available】',
      '1. BPFA द्वारा फ़ॉल्ट एकनॉलेज (ACK) करें और सामान्य ऑपरेशन चालू करें।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0310P2-BT',
    subSystem: 'SS03',
    message: 'MOTOR 3 ISOLATED\nBOGIE 2\nReduced Traction/Braking effort\n(M/s BOMBARDIER Transportation IGBT Traction Converter)',
    lamp: 'BPFA प्रकाशित होगा',
    effect: 'Reduced Traction/Braking effort (आधा TE/BE उपलब्ध रहेगा)',
    actions: [
      '1. BPFA द्वारा फ़ॉल्ट एकनॉलेज (ACK) करें और सामान्य ऑपरेशन चालू करें।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0310P2-MEDHA',
    subSystem: 'SS03',
    message: 'TM3 BOGIE 2 ISOLATED\nTM 3 of bogie 2 isolated only 5/6th of Traction/electrical Braking power available.\n(M/s MEDHA IGBT Traction Converter)',
    lamp: 'BPFA प्रकाशित होगा',
    effect: 'TM 3 आइसोलेट, केवल 5/6th ट्रैक्शन/इलेक्ट्रिकल ब्रेकिंग पावर उपलब्ध रहेगा',
    actions: [
      '1. BPFA द्वारा फ़ॉल्ट एकनॉलेज (ACK) करें और सामान्य ऑपरेशन चालू करें।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0311P2',
    subSystem: 'SS03',
    message: 'MOTOR 1 BOGIE 2 ISOLATED / TM 1 of bogie 2 isolated only 5/6th TE/BE (BHEL IGBT)\n(एवं MEDHA IGBT लोको में: LINE CONVERTER1 BOGIE 2 ISOLATED / LC1 of bogie 2 isolated only 3/4th TE/BE available)',
    lamp: 'BPFA प्रकाशित होगा',
    effect: 'BHEL लोको में बोगी-2 की TM-1 आइसोलेट (5/6th TE/BE) एवं MEDHA लोको में LC-1 बोगी-2 आइसोलेट (3/4th TE/BE उपलब्ध)',
    actions: [
      '【स्थिति 1: M/s BHEL IGBT कनवर्टर लोको - MOTOR 1 BOGIE 2 ISOLATED (5/6th TE/BE)】',
      '1. BPFA द्वारा फ़ॉल्ट एकनॉलेज (ACK) करें और सामान्य ऑपरेशन चालू करें।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।',
      '【स्थिति 2: M/s MEDHA IGBT कनवर्टर लोको - LINE CONVERTER1 BOGIE 2 ISOLATED (3/4th TE/BE)】',
      '1. BPFA द्वारा फ़ॉल्ट एकनॉलेज (ACK) करें और सामान्य ऑपरेशन चालू करें।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0311P2-BHEL',
    subSystem: 'SS03',
    message: 'MOTOR 1 BOGIE 2\nISOLATED\nTM 1 of bogie 2 isolated only 5/6th of Traction/electrical Braking power available.\n(M/s BHEL IGBT Traction Converter)',
    lamp: 'BPFA प्रकाशित होगा',
    effect: 'TM 1 आइसोलेट, केवल 5/6th ट्रैक्शन/इलेक्ट्रिकल ब्रेकिंग पावर उपलब्ध रहेगा',
    actions: [
      '1. BPFA द्वारा फ़ॉल्ट एकनॉलेज (ACK) करें और सामान्य ऑपरेशन चालू करें।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0311P2-MEDHA',
    subSystem: 'SS03',
    message: 'LINE CONVERTER1 BOGIE 2\nISOLATED\nLC1 of bogie 2 isolated only 3/4th of traction/electrical Braking power available.\n(M/s MEDHA IGBT Traction Converter)',
    lamp: 'BPFA प्रकाशित होगा',
    effect: 'LC1 बोगी-2 आइसोलेट, केवल 3/4th ट्रैक्शन/इलेक्ट्रिकल ब्रेकिंग पावर उपलब्ध रहेगा',
    actions: [
      '1. BPFA द्वारा फ़ॉल्ट एकनॉलेज (ACK) करें और सामान्य ऑपरेशन चालू करें।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0312P2',
    subSystem: 'SS03',
    message: 'MOTOR 2 BOGIE 2 ISOLATED / TM 2 of bogie 2 isolated only 5/6th TE/BE (BHEL IGBT)\n(एवं MEDHA IGBT लोको में: LINE CONVERTER2 BOGIE 2 ISOLATED / LC2 of bogie 2 isolated only 3/4th TE/BE available)',
    lamp: 'BPFA प्रकाशित होगा',
    effect: 'BHEL लोको में बोगी-2 की TM-2 आइसोलेट (5/6th TE/BE) एवं MEDHA लोको में LC-2 बोगी-2 आइसोलेट (3/4th TE/BE उपलब्ध)',
    actions: [
      '【स्थिति 1: M/s BHEL IGBT कनवर्टर लोको - MOTOR 2 BOGIE 2 ISOLATED (5/6th TE/BE)】',
      '1. BPFA द्वारा फ़ॉल्ट एकनॉलेज (ACK) करें और सामान्य ऑपरेशन चालू करें।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।',
      '【स्थिति 2: M/s MEDHA IGBT कनवर्टर लोको - LINE CONVERTER2 BOGIE 2 ISOLATED (3/4th TE/BE)】',
      '1. BPFA द्वारा फ़ॉल्ट एकनॉलेज (ACK) करें और सामान्य ऑपरेशन चालू करें।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0312P2-BHEL',
    subSystem: 'SS03',
    message: 'MOTOR 2 BOGIE 2\nISOLATED\nTM 2 of bogie 2 isolated only 5/6th of Traction/electrical Braking power available.\n(M/s BHEL IGBT Traction Converter)',
    lamp: 'BPFA प्रकाशित होगा',
    effect: 'TM 2 आइसोलेट, केवल 5/6th ट्रैक्शन/इलेक्ट्रिकल ब्रेकिंग पावर उपलब्ध रहेगा',
    actions: [
      '1. BPFA द्वारा फ़ॉल्ट एकनॉलेज (ACK) करें और सामान्य ऑपरेशन चालू करें।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0312P2-MEDHA',
    subSystem: 'SS03',
    message: 'LINE CONVERTER2 BOGIE 2\nISOLATED\nLC2 of bogie 2 isolated only 3/4th of traction/electrical Braking power available.\n(M/s MEDHA IGBT Traction Converter)',
    lamp: 'BPFA प्रकाशित होगा',
    effect: 'LC2 बोगी-2 आइसोलेट, केवल 3/4th ट्रैक्शन/इलेक्ट्रिकल ब्रेकिंग पावर उपलब्ध रहेगा',
    actions: [
      '1. BPFA द्वारा फ़ॉल्ट एकनॉलेज (ACK) करें और सामान्य ऑपरेशन चालू करें।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0313P2',
    subSystem: 'SS03',
    message: 'MOTOR 3 BOGIE 2 ISOLATED\nTM 3 of bogie 2 isolated only 5/6th of traction/electrical Braking power available.\n(बोगी-2 के लिए अतिरिक्त मैसेज - जिन लोको में M/s BHEL का IGBT ट्रैक्शन कनवर्टर लगा है)',
    lamp: 'BPFA प्रकाशित होगा',
    effect: 'TM 3 आइसोलेट, केवल 5/6th ट्रैक्शन/इलेक्ट्रिकल ब्रेकिंग पावर उपलब्ध रहेगा',
    actions: [
      '1. BPFA द्वारा फ़ॉल्ट एकनॉलेज (ACK) करें और सामान्य ऑपरेशन चालू करें।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0313P2-BHEL',
    subSystem: 'SS03',
    message: 'MOTOR 3 BOGIE 2\nISOLATED\nTM 3 of bogie 2 isolated only 5/6th of traction/electrical Braking power available.\n(M/s BHEL IGBT Traction Converter)',
    lamp: 'BPFA प्रकाशित होगा',
    effect: 'TM 3 आइसोलेट, केवल 5/6th ट्रैक्शन/इलेक्ट्रिकल ब्रेकिंग पावर उपलब्ध रहेगा',
    actions: [
      '1. BPFA द्वारा फ़ॉल्ट एकनॉलेज (ACK) करें और सामान्य ऑपरेशन चालू करें।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0314P2',
    subSystem: 'SS03',
    message: 'LINE CONVERTER1 BOGIE 2 ISOLATED\nLC1 of bogie 2 isolated only 3/4th of traction/electrical Braking power available.\n(बोगी-2 के लिए अतिरिक्त मैसेज - जिन लोको में M/s BHEL का IGBT ट्रैक्शन कनवर्टर लगा है)',
    lamp: 'BPFA प्रकाशित होगा',
    effect: 'LC1 आइसोलेट, केवल 3/4th ट्रैक्शन/इलेक्ट्रिकल ब्रेकिंग पावर उपलब्ध रहेगा',
    actions: [
      '1. BPFA द्वारा फ़ॉल्ट एकनॉलेज (ACK) करें और सामान्य ऑपरेशन चालू करें।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0314P2-BHEL',
    subSystem: 'SS03',
    message: 'LINE CONVERTER1 BOGIE 2\nISOLATED\nLC1 of bogie 2 isolated only 3/4th of traction/electrical Braking power available.\n(M/s BHEL IGBT Traction Converter)',
    lamp: 'BPFA प्रकाशित होगा',
    effect: 'LC1 आइसोलेट, केवल 3/4th ट्रैक्शन/इलेक्ट्रिकल ब्रेकिंग पावर उपलब्ध रहेगा',
    actions: [
      '1. BPFA द्वारा फ़ॉल्ट एकनॉलेज (ACK) करें और सामान्य ऑपरेशन चालू करें।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0315P2',
    subSystem: 'SS03',
    message: 'LINE CONVERTER2 BOGIE 2 ISOLATED\nLC2 of bogie 2 isolated only 3/4th of traction/electrical Braking power available.\n(बोगी-2 के लिए अतिरिक्त मैसेज - जिन लोको में M/s BHEL का IGBT ट्रैक्शन कनवर्टर लगा है)',
    lamp: 'BPFA प्रकाशित होगा',
    effect: 'LC2 आइसोलेट, केवल 3/4th ट्रैक्शन/इलेक्ट्रिकल ब्रेकिंग पावर उपलब्ध रहेगा',
    actions: [
      '1. BPFA द्वारा फ़ॉल्ट एकनॉलेज (ACK) करें और सामान्य ऑपरेशन चालू करें।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0315P2-BHEL',
    subSystem: 'SS03',
    message: 'LINE CONVERTER2 BOGIE 2\nISOLATED\nLC2 of bogie 2 isolated only 3/4th of traction/electrical Braking power available.\n(M/s BHEL IGBT Traction Converter)',
    lamp: 'BPFA प्रकाशित होगा',
    effect: 'LC2 आइसोलेट, केवल 3/4th ट्रैक्शन/इलेक्ट्रिकल ब्रेकिंग पावर उपलब्ध रहेगा',
    actions: [
      '1. BPFA द्वारा फ़ॉल्ट एकनॉलेज (ACK) करें और सामान्य ऑपरेशन चालू करें।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0401P1',
    subSystem: 'SS04',
    message: 'HARMONIC FILTER CURRENT TOO HIGH\nTry to close VCB again\n(स्क्रीन-2 / Press <Enter>: HARMONIC FILTER ISOLATED / Speak to TLC / Max. permitted speed is 40 Kmph)',
    lamp: 'BPFA प्रकाशित होगा। VCB ओपन हो जाएगा।',
    effect: 'VCB ओपन हो जाएगा; हार्मोनिक फ़िल्टर आइसोलेट होने पर अधिकतम अनुमेय गति 40 KMPH हो जाएगी।',
    actions: [
      '【स्क्रीन 1: HARMONIC FILTER CURRENT TOO HIGH / Try to close VCB again】',
      '1. थ्रॉटल को "0" पर लायें। BPFA दबाकर फ़ॉल्ट ACK करें।',
      '2. VCB क्लोज़ करने के लिए BLDJ को प्रेस करें।',
      '3. यदि दोष बना रहता है तो कंट्रोल इलेक्ट्रॉनिक्स को एक बार ऑफ़ करें और फिर ऑन करें। पेण्टो रेज़ करें, VCB क्लोज़ करें तथा ट्रैक्शन चालू करें।',
      '【स्क्रीन 2: HARMONIC FILTER ISOLATED / Speak to TLC / Max. permitted speed is 40 Kmph / Press <Enter>】',
      '1. गति कम होकर 40 KMPH होगी।',
      '2. TLC को सूचित करें तथा सामान्य ट्रैक्शन चालू करें।',
      '3. एक-दो सेक्शन पास करने के उपरांत कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ करें और फिर ऑन करें।',
      '4. यदि हार्मोनिक फ़िल्टर सर्विस में आ जाता है तो सामान्य गति से ट्रैक्शन चालू करें। TLC को सूचित करें।',
      '5. यदि सफलता नहीं मिलती है तो 40 KMPH की गति से दोनों ट्रैक्शन कनवर्टर के साथ गाड़ी चलाएं या बोगी-1 को स्विच 154 के द्वारा आइसोलेट करें। कंट्रोल इलेक्ट्रॉनिक्स ऑफ़ करें और फिर ऑन करें (आइसोलेट हार्मोनिक फ़िल्टर को वापस सर्विस में लाने के लिए)। TLC के आदेशानुसार आधे TE/BE पावर के साथ सामान्य गति से काम करें।',
      '6. लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0401P2',
    subSystem: 'SS04',
    message: 'FILTER CONTACTOR 8.1\nSTUCK ON\nIf VCB opens it will not close again',
    lamp: 'BPFA प्रकाशित होगा।',
    effect: 'यदि VCB ओपन होता है तो BLDJ को प्रेस करने से VCB क्लोज़ करना संभव नहीं होगा।',
    actions: [
      '1. यदि VCB ओपन होता है तो BLDJ को प्रेस करने से VCB क्लोज़ करना संभव नहीं होगा। BPFA दबाकर फ़ॉल्ट ACK करें।',
      '2. बिना VCB ओपन करे सेक्शन क्लियर करके गाड़ी खड़ी करें।',
      '3. कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ करें और फिर ऑन करें। पेण्टो उठायें, VCB क्लोज़ करें तथा ट्रैक्शन चालू करें।',
      '4. यदि VCB क्लोज़ नहीं होता है तो 20 मिनट में सहायता इंजन की मांग करें।'
    ]
  },
  {
    id: 'F0402P1',
    subSystem: 'SS04',
    message: 'HARM. FILTER CONTACTOR (S) STUCK OFF/ON\nHarmonic filter will be isolated / Speak to TLC\n(स्क्रीन-2 / Press <Enter>: HARMONIC FILTER ISOLATED / Speak to TLC / Max. permitted speed is 40 Kmph)',
    lamp: 'BPFA प्रकाशित होगा। VCB ओपन हो जाएगा।',
    effect: 'VCB ओपन हो जाएगा; हार्मोनिक फ़िल्टर आइसोलेट होने पर अधिकतम अनुमेय गति 40 KMPH हो जाएगी।',
    actions: [
      '【स्क्रीन 1: HARM. FILTER CONTACTOR (S) STUCK OFF/ON / Harmonic filter will be isolated / Speak to TLC】',
      '1. थ्रॉटल को "0" पर लायें। BPFA दबाकर फ़ॉल्ट ACK करें।',
      '2. VCB क्लोज़ करने के लिए BLDJ को प्रेस करें।',
      '3. यदि दोष बना रहता है तो कंट्रोल इलेक्ट्रॉनिक्स को एक बार ऑफ़ करें और फिर ऑन करें। पेण्टो रेज़ करें, VCB क्लोज़ करें तथा ट्रैक्शन चालू करें।',
      '【स्क्रीन 2: HARMONIC FILTER ISOLATED / Speak to TLC / Max. permitted speed is 40 Kmph / Press <Enter>】',
      '1. गति कम होकर 40 KMPH होगी।',
      '2. TLC को सूचित करें तथा सामान्य ट्रैक्शन चालू करें।',
      '3. एक-दो सेक्शन पास करने के उपरांत कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ करें और फिर ऑन करें।',
      '4. यदि हार्मोनिक फ़िल्टर सर्विस में आ जाता है तो सामान्य गति से ट्रैक्शन चालू करें। TLC को सूचित करें।',
      '5. यदि सफलता नहीं मिलती है तो, 40 KMPH की गति से दोनों ट्रैक्शन कनवर्टर के साथ गाड़ी चलाएं या बोगी-1 को स्विच 154 के द्वारा आइसोलेट करें। कंट्रोल इलेक्ट्रॉनिक्स ऑफ़ करें और फिर ऑन करें (आइसोलेटेड हार्मोनिक फ़िल्टर को वापस सर्विस में लाने के लिए)। TLC के आदेशानुसार आधे TE/BE पावर के साथ सामान्य गति से काम करें।',
      '6. लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0402P2',
    subSystem: 'SS04',
    message: 'EARTH FAULT HARMONIC FILTER CIRCUIT\nNormal operation can continue\nTo be checked during maintenance',
    lamp: 'BPFA प्रकाशित होगा।',
    effect: 'सामान्य ऑपरेशन जारी रहेगा। कोई कर्षण/ब्रेकिंग प्रतिबंध नहीं।',
    actions: [
      '1. BPFA द्वारा फ़ॉल्ट एक्नॉलेज करें। सामान्य ऑपरेशन चालू रखें।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0404P1',
    subSystem: 'SS04',
    message: 'RESISTOR TOO HOT\nNo. of filter discharges exceeded\nVCB will remain inhibited 15 min.',
    lamp: 'BPFA प्रकाशित होगा।',
    effect: 'VCB ओपन हो जाएगा तथा 15 मिनट तक इनहिबिट (Inhibited) रहेगा।',
    actions: [
      '1. थ्रॉटल को “0” पर लायें। BPFA दबाकर फ़ॉल्ट ACK करें।',
      '2. 15 मिनट इंतजार करें तथा BLDJ प्रेस करके फिर से VCB क्लोज़ करने का प्रयत्न करें।',
      '3. यदि दोष बना रहता है तो कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ करें और फिर से ऑन करें। पेण्टो उठायें, VCB क्लोज़ करें तथा ट्रैक्शन चालू करें।',
      '4. TLC को सूचित करें तथा लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0403P2',
    subSystem: 'SS04',
    message: 'TM1 BOGIE 1 ISOLATED\nTM 1 of bogie 1 isolated only 5/6th of Traction/electrical Braking power available.\n(बोगी-1 अतिरिक्त संदेश - M/s ABB IGBT)',
    lamp: 'BPFA प्रकाशित होगा।',
    effect: 'TM 1 (बोगी-1) आइसोलेट होगा। केवल 5/6th ट्रैक्शन / इलेक्ट्रिकल ब्रेकिंग पावर उपलब्ध रहेगा।',
    actions: [
      '1. BPFA द्वारा फ़ॉल्ट एक्नॉलेज करें और सामान्य ऑपरेशन चालू करें।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0404P2',
    subSystem: 'SS04',
    message: 'TM2 BOGIE 1 ISOLATED\nTM 2 of bogie 1 isolated only 5/6th of Traction/electrical Braking power available.\n(बोगी-1 अतिरिक्त संदेश - M/s ABB IGBT)',
    lamp: 'BPFA प्रकाशित होगा।',
    effect: 'TM 2 (बोगी-1) आइसोलेट होगा। केवल 5/6th ट्रैक्शन / इलेक्ट्रिकल ब्रेकिंग पावर उपलब्ध रहेगा।',
    actions: [
      '1. BPFA द्वारा फ़ॉल्ट एक्नॉलेज करें और सामान्य ऑपरेशन चालू करें।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0405P2',
    subSystem: 'SS04',
    message: 'TM3 BOGIE 1 ISOLATED\nTM 3 of bogie 1 isolated only 5/6th of Traction/electrical Braking power available.\n(बोगी-1 अतिरिक्त संदेश - M/s ABB IGBT)',
    lamp: 'BPFA प्रकाशित होगा।',
    effect: 'TM 3 (बोगी-1) आइसोलेट होगा। केवल 5/6th ट्रैक्शन / इलेक्ट्रिकल ब्रेकिंग पावर उपलब्ध रहेगा।',
    actions: [
      '1. BPFA द्वारा फ़ॉल्ट एक्नॉलेज करें और सामान्य ऑपरेशन चालू करें।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0406P2',
    subSystem: 'SS04',
    message: 'LINE CONVERTER1 BOGIE 1 ISOLATED\nLC1 of bogie 1 isolated only 3/4th of traction/electrical Braking power available.\n(बोगी-1 अतिरिक्त संदेश - M/s ABB IGBT)',
    lamp: 'BPFA प्रकाशित होगा।',
    effect: 'लाइन कनवर्टर-1 (बोगी-1) आइसोलेट होगा। केवल 3/4th ट्रैक्शन / इलेक्ट्रिकल ब्रेकिंग पावर उपलब्ध रहेगा।',
    actions: [
      '1. BPFA द्वारा फ़ॉल्ट एक्नॉलेज करें और सामान्य ऑपरेशन चालू करें।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0407P2',
    subSystem: 'SS04',
    message: 'LINE CONVERTER2 BOGIE 1 ISOLATED\nLC2 of bogie 1 isolated, only 3/4th of traction/electrical Braking power available.\n(बोगी-1 अतिरिक्त संदेश - M/s ABB IGBT)',
    lamp: 'BPFA प्रकाशित होगा।',
    effect: 'लाइन कनवर्टर-2 (बोगी-1) आइसोलेट होगा। केवल 3/4th ट्रैक्शन / इलेक्ट्रिकल ब्रेकिंग पावर उपलब्ध रहेगा।',
    actions: [
      '1. BPFA द्वारा फ़ॉल्ट एक्नॉलेज करें और सामान्य ऑपरेशन चालू करें।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0503P1',
    subSystem: 'SS05',
    message: 'EARTH FAULT IN\nHOTEL LOAD\nCIRCUIT\nHotel Load will be\nisolated',
    lamp: 'BPFA प्रकाशित होगा।',
    effect: 'Hotel Load आइसोलेट हो जाएगा (Hotel Load will be isolated)',
    actions: [
      '1. Hotel Load कॉन्टैक्टर को खोलने के लिए BLHO स्विच को ऑफ़ करें। BPFA द्वारा फ़ॉल्ट एक्नॉलेज (ACK) करें।',
      '2. मेंटेनेंस स्टाफ को सूचित करें।'
    ]
  },
  {
    id: 'F0504P1',
    subSystem: 'SS05',
    message: 'OVER CURRENT IN\nHOTEL LOAD\nCIRCUIT\nTry to close VCB again',
    lamp: 'BPFA एवं LSDJ प्रकाशित होंगे।',
    effect: 'VCB ओपन हो जाएगा (Try to close VCB again)',
    actions: [
      '【1st (प्रथम बार)】:',
      '1. BPFA द्वारा फ़ॉल्ट एक्नॉलेज (ACK) करें।',
      '2. VCB क्लोज़ करने के लिए BLDJ को प्रेस करें।',
      '【2nd (दूसरी बार / यदि दोष बना रहे)】:',
      '1. मेंटेनेंस स्टाफ को सूचित करें।'
    ]
  },
  {
    id: 'F0501P2',
    subSystem: 'SS05',
    message: 'HOTEL LOAD\nCONTACTOR STUCK\nOFF\nHotel Load not available',
    lamp: 'BPFA प्रकाशित होगा।',
    effect: 'Hotel Load उपलब्ध नहीं रहेगा (Hotel Load not available)',
    actions: [
      '1. BPFA द्वारा फ़ॉल्ट एक्नॉलेज (ACK) करें।',
      '2. मेंटेनेंस स्टाफ को सूचित करें।'
    ]
  },
  {
    id: 'F0502P2',
    subSystem: 'SS05',
    message: 'HOTEL LOAD\nCONTACTOR STUCK\nON\nFor Un/coupling hotel\nload trip VCB',
    lamp: 'BPFA प्रकाशित होगा।',
    effect: 'यदि VCB ट्रिप हुआ है तो दोबारा क्लोज़ नहीं होगा। होटल लोड की अनकप्लिंग/कप्लिंग के लिए VCB ट्रिप करना आवश्यक।',
    actions: [
      '1. BPFA द्वारा फ़ॉल्ट एक्नॉलेज (ACK) करें।',
      '2. TLC को सूचित करें और TLC के निर्देशानुसार कार्य करें क्योंकि यदि VCB ट्रिप हुआ है तो क्लोज़ नहीं होगा।'
    ]
  },
  {
    id: 'F0503P2',
    subSystem: 'SS05',
    message: 'TM 1 BOGIE 2 ISOLATED\nTM 1 of bogie 2 isolated only 5/6th of Traction/electrical Braking power available.\n(बोगी-2 अतिरिक्त संदेश - M/s ABB IGBT)',
    lamp: 'BPFA प्रकाशित होगा।',
    effect: 'TM 1 (बोगी-2) आइसोलेट होगा। केवल 5/6th ट्रैक्शन / इलेक्ट्रिकल ब्रेकिंग पावर उपलब्ध रहेगा।',
    actions: [
      '1. BPFA द्वारा फ़ॉल्ट एक्नॉलेज (ACK) करें और सामान्य ऑपरेशन चालू करें।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0504P2',
    subSystem: 'SS05',
    message: 'TM 2 BOGIE 2 ISOLATED\nTM 2 of bogie 2 isolated only 5/6th of Traction/electrical Braking power available.\n(बोगी-2 अतिरिक्त संदेश - M/s ABB IGBT)',
    lamp: 'BPFA प्रकाशित होगा।',
    effect: 'TM 2 (बोगी-2) आइसोलेट होगा। केवल 5/6th ट्रैक्शन / इलेक्ट्रिकल ब्रेकिंग पावर उपलब्ध रहेगा।',
    actions: [
      '1. BPFA द्वारा फ़ॉल्ट एक्नॉलेज (ACK) करें और सामान्य ऑपरेशन चालू करें।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0505P2',
    subSystem: 'SS05',
    message: 'TM 3 BOGIE 2 ISOLATED\nTM 3 of bogie 2 isolated only 5/6th of Traction/electrical Braking power available.\n(बोगी-2 अतिरिक्त संदेश - M/s ABB IGBT)',
    lamp: 'BPFA प्रकाशित होगा।',
    effect: 'TM 3 (बोगी-2) आइसोलेट होगा। केवल 5/6th ट्रैक्शन / इलेक्ट्रिकल ब्रेकिंग पावर उपलब्ध रहेगा।',
    actions: [
      '1. BPFA द्वारा फ़ॉल्ट एक्नॉलेज (ACK) करें और सामान्य ऑपरेशन चालू करें।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0506P2',
    subSystem: 'SS05',
    message: 'LINE CONVERTER 1 BOGIE 2 ISOLATED\nLC1 of bogie 2 isolated only 3/4th of traction/electrical Braking power available.\n(बोगी-2 अतिरिक्त संदेश - M/s ABB IGBT)',
    lamp: 'BPFA प्रकाशित होगा।',
    effect: 'लाइन कनवर्टर-1 (बोगी-2) आइसोलेट होगा। केवल 3/4th ट्रैक्शन / इलेक्ट्रिकल ब्रेकिंग पावर उपलब्ध रहेगा।',
    actions: [
      '1. BPFA द्वारा फ़ॉल्ट एक्नॉलेज (ACK) करें और सामान्य ऑपरेशन चालू करें।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0507P2',
    subSystem: 'SS05',
    message: 'LINE CONVERTER 2 BOGIE 2 ISOLATED\nLC2 of bogie 2 isolated only 3/4th of traction/electrical Braking power available.\n(बोगी-2 अतिरिक्त संदेश - M/s ABB IGBT)',
    lamp: 'BPFA प्रकाशित होगा।',
    effect: 'लाइन कनवर्टर-2 (बोगी-2) आइसोलेट होगा। केवल 3/4th ट्रैक्शन / इलेक्ट्रिकल ब्रेकिंग पावर उपलब्ध रहेगा।',
    actions: [
      '1. BPFA द्वारा फ़ॉल्ट एक्नॉलेज (ACK) करें और सामान्य ऑपरेशन चालू करें।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0601P1',
    subSystem: 'SS06',
    message: 'DISTURBANCE IN\nPROCESSOR BUR 1\nTry to close VCB again\n(स्क्रीन-2 / Press <Enter>: AUX CONVERTER1 ISOLATED / Driving still Possible / max. ventilation level will be reduced)',
    lamp: 'BPFA प्रकाशित होगा। VCB ओपन हो जाएगा।',
    effect: 'VCB ओपन हो जाएगा; BUR-1 स्वतः आइसोलेट होगा (Try to close VCB again)।',
    actions: [
      '【स्क्रीन 1: DISTURBANCE IN PROCESSOR BUR 1 / Try to close VCB again】',
      '1. थ्रोटल को "0" पर लाएं। BPFA दबाकर फ़ॉल्ट ACK करें।',
      '2. BUR-1 अपने आप आइसोलेट होगा। ENTER key दबाएं।',
      '3. VCB क्लोज़ करने के लिए BLDJ को प्रेस करें।',
      '4. सामान्य ट्रैक्शन द्वारा गाड़ी चलाएं।',
      '【स्क्रीन 2: AUX CONVERTER1 ISOLATED / Driving still Possible / max. ventilation level will be reduced / Press <Enter>】',
      '1. SB-1 में लगे MCB नं. 127.22/1 को चेक करें, यदि ट्रिप है तो कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ करके MCB को एक बार रीसेट करें।',
      '2. यदि MCB ट्रिप नहीं है तो कंट्रोल इलेक्ट्रॉनिक्स को एक बार ऑफ़ करके ऑन करें। पेंटो उठाएं, VCB क्लोज़ करें यदि लोको सामान्य होता है तो ट्रैक्शन चालू करें।',
      '3. यदि वही मैसेज फिर से आता है, BUR-1 को आइसोलेट रखते हुए सामान्य ऑपरेशन चालू रखें और कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ तथा ऑन करके BUR-1 को सर्विस में लेने का प्रयत्न न करें। BUR-1 को आइसोलेट रखते हुए गाड़ी चलाएं।',
      '4. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'SS06-BUR1-ISOLATED',
    subSystem: 'SS06',
    message: 'AUX CONVERTER1\nISOLATED\nDriving still Possible\nmax. ventilation level will be\nreduced\nPress<Enter>',
    lamp: 'BPFA प्रकाशित रहेगा।',
    effect: 'BUR-1 आइसोलेट रहेगा; ड्राइविंग संभव है, अधिकतम वेंटिलेशन स्तर घट जाएगा (Driving still Possible, max. ventilation level will be reduced)।',
    actions: [
      '1. SB-1 में लगे MCB नं. 127.22/1 को चेक करें, यदि ट्रिप है तो कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ करके MCB को एक बार रीसेट करें।',
      '2. यदि MCB ट्रिप नहीं है तो कंट्रोल इलेक्ट्रॉनिक्स को एक बार ऑफ़ करके ऑन करें। पेंटो उठाएं, VCB क्लोज़ करें यदि लोको सामान्य होता है तो ट्रैक्शन चालू करें।',
      '3. यदि वही मैसेज फिर से आता है, BUR-1 को आइसोलेट रखते हुए सामान्य ऑपरेशन चालू रखें और कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ तथा ऑन करके BUR-1 को सर्विस में लेने का प्रयत्न न करें। BUR-1 को आइसोलेट रखते हुए गाड़ी चलाएं।',
      '4. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0602P1',
    subSystem: 'SS06',
    message: 'FAULT IN AUXILIARY\nCONVERTER 1\nTry to close VCB again\n(स्क्रीन-2 / Press <Enter>: AUX CONVERTER1 ISOLATED / Driving still possible / max. ventilation level will be reduced)',
    lamp: 'BPFA प्रकाशित होगा। VCB ओपन हो जाएगा।',
    effect: 'VCB ओपन हो जाएगा; BUR-1 स्वतः आइसोलेट होगा (Try to close VCB again)।',
    actions: [
      '【स्क्रीन 1: FAULT IN AUXILIARY CONVERTER 1 / Try to close VCB again】',
      '1. थ्रोटल को "0" पर लाएं। BPFA दबाकर फ़ॉल्ट ACK करें।',
      '2. VCB क्लोज़ करने के लिए BLDJ प्रेस करें।',
      '3. यदि फिर से मैसेज आता है तो BUR-1 अपने आप आइसोलेट होगा। <ENTER> key दबाएं।',
      '4. HB-1 में लगे MCB नं. 54.1/1 को चेक करें। यदि ट्रिप है तो VCB ओपन करके रीसेट करें। यदि MCB नं. 54.1/1 फिर से ट्रिप होती है, और ऑक्ज़ीलरी कनवर्टर-1 आइसोलेट हो जाता है तो गाड़ी चलाएं। TLC को सूचित करें। {IGBT वाला BUR-1 भी MRB-1 के काम न करने पर इनवर्टर फ़ॉल्ट के कारण आइसोलेट होगा।}',
      '5. सामान्य ट्रैक्शन द्वारा गाड़ी चलाएं।',
      '【स्क्रीन 2: AUX CONVERTER1 ISOLATED / Driving still possible / max. ventilation level will be reduced / Press <Enter>】',
      '1. SB-1 में लगे MCB नं. 127.22/1 को चेक करें, यदि ट्रिप है तो कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ करके MCB को एक बार रीसेट करें।',
      '2. यदि MCB ट्रिप नहीं है तो कंट्रोल इलेक्ट्रॉनिक्स को एक बार ऑफ़ करके ऑन करें। पेंटो उठाएं, VCB क्लोज़ करें, यदि लोको सामान्य होता है तो ट्रैक्शन चालू करें।',
      '3. यदि वही मैसेज फिर से आता है, BUR-1 को आइसोलेट रखते हुए सामान्य ऑपरेशन चालू रखें। यदि BUR-1 आइसोलेट नहीं हो रहा है तो VCB ओपन करके तथा कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ करके SB-1 में लगे MCB 127.22/1 को ट्रिप करके BUR-1 को आइसोलेट करें।',
      '4. लोको को एनरजाइज करें और BUR-1 को आइसोलेट रखते हुए गाड़ी कार्य करें। इस स्थिति में LSFI की बत्ती लगातार जलती रहेगी।',
      '5. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0603P1',
    subSystem: 'SS06',
    message: 'CONTACTOR FAULT IN\nAUX. CONV-1/HB1\nContactor 52/4 or 52/5 stuck\nOFF or ON\n(स्क्रीन-2 / Press <Enter>: AUX CONVERTER1 ISOLATED / Driving still possible / max. ventilation level will be reduced)',
    lamp: 'BPFA प्रकाशित होगा।',
    effect: 'कनवर्टर-1/HB1 कॉन्टैक्टर 52/4 या 52/5 स्टक OFF या ON; दोष बना रहने पर BUR-1 आइसोलेट होगा। लोको पायलट अगले निर्धारित स्टॉप तक सामान्य ऑपरेशन कर सकता है।',
    actions: [
      '【स्क्रीन 1: CONTACTOR FAULT IN AUX. CONV-1/HB1 / Contactor 52/4 or 52/5 stuck OFF or ON】',
      '1. थ्रोटल को "0" पर लाएं। BPFA दबाकर फ़ॉल्ट ACK करें।',
      '2. VCB क्लोज़ करने के लिए BLDJ प्रेस करें।',
      '3. यदि दोष फिर भी रहता है तो BUR-1 आइसोलेट होगा। लोको पायलट अगले निर्धारित स्टॉप तक सामान्य ऑपरेशन कर सकता है।',
      '【स्क्रीन 2: AUX CONVERTER1 ISOLATED / Driving still possible / max. ventilation level will be reduced / Press <Enter>】',
      '1. BUR-1 को आइसोलेट रखते हुए गाड़ी चलाएं।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0604P1',
    subSystem: 'SS06',
    message: 'VENTILATION BUR 1\nDISTURBED\nPress acknowledge to\nreconfigure to BUR 2',
    lamp: 'BPFA प्रकाशित होगा।',
    effect: 'BUR 1 का वेंटिलेशन बाधित होगा। BPFA दबाने पर लोड BUR 2 पर रीकॉन्फ़िगर होगा।',
    actions: [
      '1. थ्रोटल को "0" पर लाएं। BPFA दबाकर फ़ॉल्ट ACK करें।',
      '2. कंट्रोल इलेक्ट्रॉनिक्स को एक बार ऑफ़ करके ऑन करें। पेंटो उठाएं, VCB क्लोज़ करें, यदि लोको सामान्य होता है तो ट्रैक्शन चालू करें।',
      '3. यदि वही मैसेज फिर से आता है, BUR-1 को आइसोलेट रखते हुए सामान्य ऑपरेशन चालू रखें।',
      '4. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0701P1',
    subSystem: 'SS07',
    message: 'DISTURBANCE IN\nPROCESSOR BUR 2\nTry to close VCB again\n(स्क्रीन-2 / Press <Enter>: AUX CONVERTER 2 ISOLATED / Driving still Possible / max. ventilation level will be reduced)',
    lamp: 'BPFA प्रकाशित होगा। VCB ओपन हो जाएगा।',
    effect: 'VCB ओपन हो जाएगा; BUR-2 स्वतः आइसोलेट होगा (Try to close VCB again)।',
    actions: [
      '【स्क्रीन 1: DISTURBANCE IN PROCESSOR BUR 2 / Try to close VCB again】',
      '1. थ्रोटल को "0" पर लाएं। BPFA दबाकर फ़ॉल्ट ACK करें।',
      '2. BUR-2 अपने आप आइसोलेट होगा। ENTER key दबाएं।',
      '3. VCB क्लोज़ करने के लिए BLDJ को प्रेस करें।',
      '4. सामान्य ट्रैक्शन द्वारा गाड़ी चलाएं।',
      '【स्क्रीन 2: AUX CONVERTER 2 ISOLATED / Driving still Possible / max. ventilation level will be reduced / Press <Enter>】',
      '1. SB-2 में लगे MCB नं. 127.22/2 को चेक करें, यदि ट्रिप है तो कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ करके MCB को एक बार रीसेट करें।',
      '2. यदि MCB ट्रिप नहीं है तो कंट्रोल इलेक्ट्रॉनिक्स को एक बार ऑफ़ करके ऑन करें। पेंटो रेज़ करें, VCB क्लोज़ करें, यदि लोको सामान्य होता है तो ट्रैक्शन चालू करें।',
      '3. यदि वही मैसेज फिर से आता है, BUR-2 को आइसोलेट रखते हुए सामान्य ऑपरेशन चालू रखें और कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ तथा ऑन करके BUR-2 को सर्विस में लेने की कोशिश न करें। BUR-2 को आइसोलेट रखते हुए गाड़ी चलाएं।',
      '4. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'SS07-BUR2-ISOLATED',
    subSystem: 'SS07',
    message: 'AUX CONVERTER 2\nISOLATED\nDriving still Possible\nmax. ventilation level will be\nreduced\nPress<Enter>',
    lamp: 'BPFA प्रकाशित रहेगा।',
    effect: 'BUR-2 आइसोलेट रहेगा; ड्राइविंग संभव है, अधिकतम वेंटिलेशन स्तर घट जाएगा (Driving still Possible, max. ventilation level will be reduced)।',
    actions: [
      '1. SB-2 में लगे MCB नं. 127.22/2 को चेक करें, यदि ट्रिप है तो कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ करके MCB को एक बार रीसेट करें।',
      '2. यदि MCB ट्रिप नहीं है तो कंट्रोल इलेक्ट्रॉनिक्स को एक बार ऑफ़ करके ऑन करें। पेंटो रेज़ करें, VCB क्लोज़ करें, यदि लोको सामान्य होता है तो ट्रैक्शन चालू करें।',
      '3. यदि वही मैसेज फिर से आता है, BUR-2 को आइसोलेट रखते हुए सामान्य ऑपरेशन चालू रखें और कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ तथा ऑन करके BUR-2 को सर्विस में लेने की कोशिश न करें। BUR-2 को आइसोलेट रखते हुए गाड़ी चलाएं।',
      '4. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0702P1',
    subSystem: 'SS07',
    message: 'FAULT IN AUXILIARY\nCONVERTER 2\nTry to close VCB again\n(स्क्रीन-2 / Press <Enter>: AUX CONVERTER 2 ISOLATED / Driving still possible / max. ventilation level will be reduced)',
    lamp: 'BPFA प्रकाशित होगा। VCB ओपन हो जाएगा।',
    effect: 'VCB ओपन हो जाएगा; BUR-2 स्वतः आइसोलेट होगा (Try to close VCB again)। MCB 54.1/2 बार-बार ट्रिप होने पर सेक्शन क्लियर कर सहायता इंजन मांगें।',
    actions: [
      '【स्क्रीन 1: FAULT IN AUXILIARY CONVERTER 2 / Try to close VCB again】',
      '1. थ्रोटल को "0" पर लाएं। BPFA दबाकर फ़ॉल्ट ACK करें।',
      '2. VCB क्लोज़ करने के लिए BLDJ प्रेस करें।',
      '3. यदि फिर से मैसेज आता है तो BUR-2 अपने आप आइसोलेट होगा। <ENTER> key दबाएं।',
      '4. HB-2 में लगे MCB नं. 54.1/2 को चेक करें। यदि ट्रिप है तो VCB ओपन करके रीसेट करें। सामान्य ट्रैक्शन द्वारा गाड़ी चलाएं। यदि MCB क्र. 54.1/2 फिर से ट्रिप होती है, तो सेक्शन साफ़ करके TLC को सूचित करें और सहायता मांगें। {IGBT वाला BUR-2 & 3 भी MRB-2 के काम न करने पर, इनवर्टर फ़ॉल्ट के कारण आइसोलेट होंगे। यह F0110P1 फ़ॉल्ट आने का कारण होगा जिसके लिए ट्रबलशूट करें।}',
      '【स्क्रीन 2: AUX CONVERTER 2 ISOLATED / Driving still possible / max. ventilation level will be reduced / Press <Enter>】',
      '1. SB-2 में लगे MCB नं. 127.22/2 को चेक करें, यदि ट्रिप है तो कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ करके MCB को एक बार रीसेट करें।',
      '2. यदि MCB ट्रिप नहीं है तो कंट्रोल इलेक्ट्रॉनिक्स को एक बार ऑफ़ करके ऑन करें। पेंटो रेज़ करें, VCB क्लोज़ करें, यदि लोको सामान्य होता है तो ट्रैक्शन चालू करें।',
      '3. यदि वही मैसेज फिर से आता है, BUR-2 को आइसोलेट रखते हुए सामान्य ऑपरेशन चालू रखें। यदि BUR-2 आइसोलेट नहीं हो रहा है तो VCB ओपन करके तथा कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ करके SB-2 में लगे MCB 127.22/2 को ट्रिप करके BUR-2 को आइसोलेट करें।',
      '4. लोको को एनरजाइज करें और BUR-2 को आइसोलेट रखते हुए गाड़ी कार्य करें। इस स्थिति में LSFI की बत्ती लगातार प्रकाशित रहेगी।',
      '5. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0703P1',
    subSystem: 'SS07',
    message: 'CONTACTOR FAULT IN\nAUX CONV-2/ HB2\nContactor 52/1/2/4 stuck OFF or ON\n(स्क्रीन-2 / Press <Enter>: AUX CONVERTER 2 ISOLATED / Driving still possible / max. ventilation level will be reduced)',
    lamp: 'BPFA प्रकाशित होगा। VCB ओपन हो जाएगा।',
    effect: 'VCB ओपन हो जाएगा; BUR-2 आइसोलेट होगा। लोको पायलट अगले निर्धारित स्टॉप तक सामान्य ऑपरेशन कर सकता है।',
    actions: [
      '【स्क्रीन 1: CONTACTOR FAULT IN AUX CONV-2/ HB2 / Contactor 52/1/2/4 stuck OFF or ON】',
      '1. थ्रोटल को " 0 " पर लाएं। BPFA दबाकर फ़ॉल्ट ACK करें।',
      '2. VCB क्लोज़ करने के लिए BLDJ प्रेस करें।',
      '3. यदि दोष फिर भी रहता है तो BUR-2 आइसोलेट होगा। लोको पायलट अगले निर्धारित स्टॉप तक सामान्य ऑपरेशन कर सकता है।',
      '【स्क्रीन 2: AUX CONVERTER 2 ISOLATED / Driving still possible / max. ventilation level will be reduced / Press <Enter>】',
      '1. BUR-2 को आइसोलेट रखते हुए गाड़ी चलाएं।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0704P1',
    subSystem: 'SS07',
    message: 'VENTILATION BUR 2\nDISTURBED\nPress acknowledge to\nreconfigure to BUR 1',
    lamp: 'BPFA प्रकाशित होगा।',
    effect: 'BUR 2 का वेंटिलेशन बाधित होगा। BPFA द्वारा एक्नॉलेज करने पर BUR 1 पर लोड रीकॉन्फ़िगर होगा।',
    actions: [
      '1. थ्रोटल को “ 0 ” पर लाएं। BPFA दबाकर फ़ॉल्ट ACK करें।',
      '2. कंट्रोल इलेक्ट्रॉनिक्स को एक बार ऑफ़ करके ऑन करें। पेंटो उठाएं, VCB क्लोज़ करें, यदि लोको सामान्य होता है तो ट्रैक्शन चालू करें।',
      '3. यदि वही मैसेज फिर से आता है, BUR-2 को आइसोलेट रखते हुए सामान्य ऑपरेशन चालू रखें।',
      '4. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0801P1',
    subSystem: 'SS08',
    message: 'DISTURBANCE IN\nPROCESSOR BUR 3\nTry to close VCB again\n(स्क्रीन-2 / Press <Enter>: AUX CONVERTER 3 ISOLATED / Driving still Possible / max. ventilation level will be reduced)',
    lamp: 'BPFA प्रकाशित होगा। VCB ओपन हो जाएगा।',
    effect: 'VCB ओपन हो जाएगा; BUR-3 स्वतः आइसोलेट होगा (Try to close VCB again)।',
    actions: [
      '【स्क्रीन 1: DISTURBANCE IN PROCESSOR BUR 3 / Try to close VCB again】',
      '1. थ्रोटल को “ 0 ” पर लाएं। BPFA दबाकर फ़ॉल्ट ACK करें।',
      '2. BUR-3 अपने आप आइसोलेट होगा। ENTER key दबाएं।',
      '3. VCB क्लोज़ करने के लिए BLDJ को प्रेस करें।',
      '4. सामान्य ट्रैक्शन द्वारा गाड़ी चलाएं।',
      '【स्क्रीन 2: AUX CONVERTER 3 ISOLATED / Driving still Possible / max. ventilation level will be reduced / Press <Enter>】',
      '1. SB-2 में लगे MCB नं. 127.22/3 को चेक करें, यदि ट्रिप है तो कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ करके MCB को एक बार रीसेट करें।',
      '2. यदि MCB ट्रिप नहीं है तो कंट्रोल इलेक्ट्रॉनिक्स को एक बार ऑफ़ करके ऑन करें। पेंटो रेज़ करें, VCB क्लोज़ करें, यदि लोको सामान्य होता है तो ट्रैक्शन चालू करें।',
      '3. यदि वही मैसेज फिर से आता है, BUR-3 को आइसोलेट रखते हुए सामान्य ऑपरेशन चालू रखें और कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ तथा ऑन करके BUR-3 को सर्विस में लेने का प्रयत्न न करें। BUR-3 को आइसोलेट रखते हुए गाड़ी चलाएं।',
      '4. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0802P1',
    subSystem: 'SS08',
    message: 'FAULT IN AUXILIARY\nCONVERTER 3\nTry to close VCB again\n(स्क्रीन-2 / Press <Enter>: AUX CONVERTER 3 ISOLATED / Driving still possible / max. ventilation level will be reduced)',
    lamp: 'BPFA प्रकाशित होगा। VCB ओपन हो जाएगा।',
    effect: 'VCB ओपन हो जाएगा; BUR-3 स्वतः आइसोलेट होगा (Try to close VCB again)। MCB 54.1/2 बार-बार ट्रिप होने पर सेक्शन साफ करके सहायता मांगें।',
    actions: [
      '【स्क्रीन 1: FAULT IN AUXILIARY CONVERTER 3 / Try to close VCB again】',
      '1. थ्रोटल को “ 0 ” पर लाएं। BPFA दबाकर फ़ॉल्ट ACK करें।',
      '2. VCB क्लोज़ करने के लिए BLDJ प्रेस करें।',
      '3. यदि दोबारा मैसेज आता है तो BUR-3 अपने आप आइसोलेट होगा। <ENTER> key दबाएं।',
      '4. HB-2 में लगे MCB नं 54.1/2 को चेक करें। यदि ट्रिप है तो VCB ओपन करके रीसेट करें। सामान्य ट्रैक्शन द्वारा गाड़ी चलाएं। यदि MCB क्र. 54.1/2 फिर से ट्रिप होती है, तो सेक्शन साफ करके TLC को सूचित करें और सहायता मांगें। {IGBT वाला BUR-2 & 3 भी, MRB-2 के काम न करने पर इन्वर्टर फ़ॉल्ट के कारण आइसोलेट होंगे। यह F0110P1 फ़ॉल्ट आने का कारण होगा जिसके लिए ट्रबलशूट करें।}',
      '【स्क्रीन 2: AUX CONVERTER 3 ISOLATED / Driving still possible / max. ventilation level will be reduced / Press <Enter>】',
      '1. SB-2 में लगे MCB नं. 127.22/3 को चेक करें, यदि ट्रिप है तो कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ करके MCB को एक बार रीसेट करें।',
      '2. यदि MCB ट्रिप नहीं है तो कंट्रोल इलेक्ट्रॉनिक्स को एक बार ऑफ़ करके ऑन करें। पेंटो रेज़ करें, VCB क्लोज़ करें, यदि लोको सामान्य होता है तो ट्रैक्शन चालू करें।',
      '3. यदि वही मैसेज फिर से आता है, BUR-3 को आइसोलेट रखते हुए सामान्य ऑपरेशन चालू रखें। यदि BUR-3 आइसोलेट नहीं हो रहा है तो VCB ओपन करके तथा कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ करके SB-2 में लगे MCB 127.22/3 को ट्रिप करके BUR-3 को आइसोलेट करें।',
      '4. लोको को एनरजाइज करें और BUR-3 को आइसोलेट रखते हुए गाड़ी कार्य करें। इस स्थिति में LSFI की बत्ती लगातार जलती रहेगी।',
      '5. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F0803P1',
    subSystem: 'SS08',
    message: 'CONTACTOR FAULT IN\nAUXCONV 3\nContactor 52/3 stuck OFF or ON\n(स्क्रीन-2 / Press <Enter>: AUX CONVERTER 3 ISOLATED / Driving still possible / max. ventilation level will be reduced)',
    lamp: 'BPFA प्रकाशित होगा। VCB ओपन हो जाएगा।',
    effect: 'VCB ओपन हो जाएगा; BUR-3 आइसोलेट होगा। लोको पायलट अगले निर्धारित स्टॉप तक सामान्य ऑपरेशन कर सकता है।',
    actions: [
      '【स्क्रीन 1: CONTACTOR FAULT IN AUXCONV 3 / Contactor 52/3 stuck OFF or ON】',
      '1. थ्रोटल को “ 0 ” पर लाएं। BPFA दबाकर फ़ॉल्ट ACK करें।',
      '2. VCB क्लोज़ करने के लिए BLDJ प्रेस करें।',
      '3. यदि दोष फिर भी रहता है तो BUR-3 आइसोलेट होगा। लोको पायलट अगले निर्धारित स्टॉप तक सामान्य ऑपरेशन कर सकता है।',
      '【स्क्रीन 2: AUX CONVERTER 3 ISOLATED / Driving still possible / max. ventilation level will be reduced / Press <Enter>】',
      '1. BUR-3 को आइसोलेट रखते हुए गाड़ी चलाएं।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'SS08-BUR3-ISOLATED',
    subSystem: 'SS08',
    message: 'AUX CONVERTER 3\nISOLATED\nDriving still Possible\nmax. ventilation level will be\nreduced\nPress<Enter>',
    lamp: 'BPFA प्रकाशित रहेगा। (यदि MCB 127.22/3 ट्रिप करके आइसोलेट किया जाए तो LSFI भी लगातार जलेगी)',
    effect: 'BUR-3 आइसोलेट रहेगा; ड्राइविंग संभव है, अधिकतम वेंटिलेशन स्तर घट जाएगा (Driving still Possible, max. ventilation level will be reduced)।',
    actions: [
      '1. SB-2 में लगे MCB नं. 127.22/3 को चेक करें, यदि ट्रिप है तो कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ करके MCB को एक बार रीसेट करें।',
      '2. यदि MCB ट्रिप नहीं है तो कंट्रोल इलेक्ट्रॉनिक्स को एक बार ऑफ़ करके ऑन करें। पेंटो रेज़ करें, VCB क्लोज़ करें, यदि लोको सामान्य होता है तो ट्रैक्शन चालू करें।',
      '3. यदि वही मैसेज फिर से आता है, BUR-3 को आइसोलेट रखते हुए सामान्य ऑपरेशन चालू रखें। यदि BUR-3 आइसोलेट नहीं हो रहा है तो VCB ओपन करके तथा कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ करके SB-2 में लगे MCB 127.22/3 को ट्रिप करके BUR-3 को आइसोलेट करें।',
      '4. लोको को एनरजाइज करें और BUR-3 को आइसोलेट रखते हुए गाड़ी कार्य करें। इस स्थिति में LSFI की बत्ती लगातार जलती रहेगी।',
      '5. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'SS06-SS08-AUX-MCB-TRIP',
    subSystem: 'SS06-SS08',
    message: 'ऑक्सिलरी मोटरों के MCB के बार-बार ट्रिप होने पर की जाने वाली ट्रबल शूटिंग\n(Troubleshooting on frequent tripping of Auxiliary Motors MCBs - SS06, SS07, SS08)',
    lamp: 'संबंधित MCB ट्रिप होने पर फ़ॉल्ट मैसेज एवं BPFA प्रकाशित हो सकता है।',
    effect: 'संबंधित ऑक्सिलरी मोटर बंद होगी; BUR आउटपुट वोल्टेज असंतुलन के कारण MCB बार-बार ट्रिप हो सकती है।',
    actions: [
      '1) यदि MCB 59.1/1 (OCB-1) या/और MCB 59.1/2 (OCB-2) बार-बार ट्रिप होती है:',
      '   1. कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ करें।',
      '   2. SB-1 में लगे MCB 127.22/1 को ट्रिप करें, BUR-1 को आइसोलेट करें।',
      '   3. MCB 59.1/1 या/और MCB 59.1/2 को रीसेट करें।',
      '   4. BUR-1 को आइसोलेट रखते हुए कार्य करने का प्रयत्न करें और OCB 1 & 2 BUR-2 द्वारा कार्य करेंगे।',
      '   ★ नोट: BUR-1 के आउटपुट वोल्टेज में असंतुलन होने के कारण यह दोष उत्पन्न हो सकता है।',
      '2) यदि MCB 63.1/1, 63.1/2 (SR ऑयल पंप) या/और MCB 62.1/1, 62.1/2 (ट्रांसफार्मर ऑयल पंप-1/2) बार-बार ट्रिप होती है:',
      '   1. कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ करें।',
      '   2. SB-2 में लगे MCB 127.22/2 को ट्रिप करें, BUR-2 को आइसोलेट करें।',
      '   3. MCBs को रीसेट करें।',
      '   4. BUR-2 को आइसोलेट रखते हुए कार्य करने का प्रयत्न करें और ट्रांसफार्मर ऑयल पंप-1/2 और SR ऑयल पंप-1/2 BUR-3 द्वारा कार्य करेंगे।',
      '   ★ नोट: BUR-2 के आउटपुट वोल्टेज में असंतुलन होने के कारण यह दोष उत्पन्न हो सकता है।',
      '3) यदि MCB 53.1/1 (TMB-1) या/और MCB 53.1/2 (TMB-2) बार-बार ट्रिप होती है:',
      '   1. कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ करें।',
      '   2. SB-2 में लगे MCB 127.22/2 को ट्रिप करें, BUR-2 को आइसोलेट करें।',
      '   3. MCB 53.1/1 या/और MCB 53.1/2 को रीसेट करें।',
      '   4. BUR-2 को आइसोलेट रखते हुए कार्य करने का प्रयत्न करें और TMB 1 & 2 BUR-1 द्वारा कार्य करेंगे।',
      '   ★ नोट: BUR-2 के आउटपुट वोल्टेज में असंतुलन होने के कारण यह दोष उत्पन्न हो सकता है।',
      '4) यदि MCB 47.1/1, 47.1/2 (MCP-1/2) या/और MCB 55.1/1, 55.1/2 (स्कैवेंजिंग ब्लोअर-1/2) बार-बार ट्रिप होती है:',
      '   1. कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ करें।',
      '   2. SB-2 में लगे MCB 127.22/3 को ट्रिप करें, BUR-3 को आइसोलेट करें।',
      '   3. MCB को रीसेट करें।',
      '   4. BUR-3 को आइसोलेट रखते हुए कार्य करने का प्रयत्न करें और MCP-1/2 BUR-2 द्वारा तथा स्कैवेंजिंग ब्लोअर-1/2 BUR-1 द्वारा कार्य करेंगे।',
      '   ★ नोट: BUR-3 के आउटपुट वोल्टेज में असंतुलन होने के कारण यह दोष उत्पन्न हो सकता है।'
    ]
  },
  {
    id: 'F0901P1',
    subSystem: 'SS09',
    message: 'BATTERY VOLTAGE TOO LOW\nElectronics will switch off\n\n(फॉलो-अप स्क्रीन / MAIN POWER ISOLATED):\nVCB can not be closed\nVCB inhibited, Loco is dead',
    lamp: 'BPFA प्रकाशित होगा।',
    effect: 'कंट्रोल इलेक्ट्रॉनिक्स स्वतः स्विच ऑफ़ हो जाएगी / VCB क्लोज़ नहीं होगा, लोको डेड।',
    actions: [
      '【स्क्रीन 1: BATTERY VOLTAGE TOO LOW / Electronics will switch off】:',
      '1. थ्रोटल को “ 0 ” पर लायें। BPFA दबाकर फ़ॉल्ट ACK करें।',
      '2. SB-2 पैनल में MCB 112.1 एवं 110 को चेक करें। यदि ट्रिप मिले तो कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ करके MCB रीसेट करें।',
      '3. यदि बैटरी का वोल्टेज 82 वोल्ट के ऊपर है तो BUR-3 को कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ करके MCB 127.22/3 (SB-2) द्वारा आइसोलेट करें। लोको एनरजाइज़ करें, सामान्यतौर पर ट्रैक्शन चालू करें।',
      '4. यदि UBA बैटरी वोल्टेज 82 वोल्ट से कम दिखा रहा है तो तुरंत सहायता इंजन की मांग करें।',
      '--------------------------------------------------',
      '【स्क्रीन 2: MAIN POWER ISOLATED / VCB can not be closed / VCB inhibited, Loco is dead】:',
      '1. यदि बैटरी ऑन नहीं हो सकती है तो सहायता इंजन की मांग करें।'
    ]
  },
  {
    id: 'F0902P1',
    subSystem: 'SS09',
    message: 'BATTERY VOLTAGE LOW\nConverters being switched off\nOpen VCB, lower Panto\n\n(फॉलो-अप स्क्रीन / MAIN POWER ISOLATED):\nVCB cannot be closed:\nVCB inhibited, Loco is dead',
    lamp: 'BPFA प्रकाशित होगा।',
    effect: 'कनवर्टर स्विच ऑफ़ होंगे, VCB ओपन कर पैंटो लोअर करने का निर्देश; VCB क्लोज़ नहीं होगा, लोको डेड।',
    actions: [
      '【स्क्रीन 1: BATTERY VOLTAGE LOW / Converters being switched off / Open VCB, lower Panto】:',
      '1. थ्रोटल को “ 0 ” पर लायें। BPFA दबाकर फ़ॉल्ट ACK करें।',
      '2. SB-2 पैनल में MCB 112.1 एवं 110 को चेक करें। यदि ट्रिप मिले तो कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ करके MCB रीसेट करें। {इलेक्ट्रॉनिक्स कार्ड को फ़ेल होने से बचाने हेतु MCB 110 को रीसेट करने के लिए कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ करें।}',
      '3. कंट्रोल इलेक्ट्रॉनिक्स को ऑन करें।',
      '4. UBA पर बैटरी वोल्टेज चेक करें। यदि 82 वोल्ट के ऊपर है और MCB 100 ट्रिप होता है तो VCB ओपन करके MCB को रीसेट करें। लोको को बैटरी चार्जिंग के लिए एनरजाइज़ रखें।',
      '--------------------------------------------------',
      '【स्क्रीन 2: MAIN POWER ISOLATED / VCB cannot be closed: / VCB inhibited, Loco is dead】:',
      '1. यदि बैटरी ऑन नहीं हो सकती है तो सहायता इंजन की मांग करें।'
    ]
  },
  {
    id: 'F0903P1',
    subSystem: 'SS09',
    message: 'PAN LOWERED LONGER THAN 10 MINUTES\nControl electronics will switch off',
    lamp: 'BPFA प्रकाशित होगा।',
    effect: 'कंट्रोल इलेक्ट्रॉनिक्स स्वतः स्विच ऑफ़ हो जाएगी (बैटरी डिस्चार्ज से सुरक्षा हेतु 10 मिनट टाइमर)।',
    actions: [
      '1. यदि BL key पोजीशन “ D ” पर हो तथा पैंटो 10 मिनट से ज्यादा समय तक लोअर रहे तब यह मैसेज स्क्रीन पर आता है।',
      '2. थ्रोटल को “ 0 ” पर लायें। BPFA दबाकर फ़ॉल्ट ACK करें।',
      '3. यदि आवश्यकता है तो BL key के द्वारा एक बार कंट्रोल इलेक्ट्रॉनिक्स को ऑन करें। लोको पायलट द्वारा 10 मिनट के अंदर पैंटो उठाकर इस फ़ॉल्ट मैसेज को टाला जा सकता है।',
      '4. यदि पैंटो रेज़ नहीं हो रहा है और यह मैसेज स्क्रीन पर आता है तो F0103P1 के अनुसार दोष का निवारण करें।'
    ]
  },
  {
    id: 'F0901P2',
    subSystem: 'SS09',
    message: 'WARNING: LOW BATTERY VOLTAGE\nDriving available for less than 30 min, Check battery charger MCB',
    lamp: 'BPFA प्रकाशित होगा।',
    effect: '30 मिनट से कम समय के लिए ड्राइविंग उपलब्ध रहेगी (Driving available for less than 30 min), बैटरी चार्जर MCB चेक करने का निर्देश।',
    actions: [
      '1. SB-2 पैनल में MCB 110 को चेक करें। यदि ट्रिप मिले तो कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ करके MCB रीसेट करें। {इलेक्ट्रॉनिक्स कार्ड को फ़ेल होने से बचाने हेतु MCB 110 को रीसेट करने के लिए कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ करें।} और HB-2 में लगे बैटरी चार्जर के इनपुट MCB 100 की जांच करें {यदि लोको पायलट द्वारा F0902P2 मैसेज पर ध्यान नहीं दिया गया तो} यदि ट्रिप मिले तो VCB ओपन करके MCB को रीसेट करें।',
      '2. BPFA दबाकर फ़ॉल्ट ACK करें।',
      '3. यदि MCBs सामान्य हों और मैसेज बना रहता है तो सेक्शन क्लियर करके सहायता इंजन मांगें।'
    ]
  },
  {
    id: 'F0902P2',
    subSystem: 'SS09',
    message: 'BATTERY CHARGER MCB\nOFF\nTry to close the MCB',
    lamp: 'BPFA प्रकाशित होगा।',
    effect: 'बैटरी चार्जर MCB 100 ट्रिप होने की संभावना, बैटरी चार्ज नहीं होगी।',
    actions: [
      '1. HB-2 में / BUR-2 पर या उसके पीछे {नीचे की ओर} लगी हुई खिड़की में लगे MCB 100 को चेक करें। यदि ट्रिप मिले तो VCB ओपन करके एक बार रीसेट करें।',
      '2. BPFA दबाकर फ़ॉल्ट ACK करें।',
      '3. सामान्य तौर पर ट्रैक्शन चालू रखें।',
      '4. यदि MCB 100 बार-बार ट्रिप हो रहा है तो BUR-3 को आइसोलेट करके बैटरी चार्जर का लोड BUR-2 पर लेकर कार्य करें।',
      '5. यदि MCB 100 सामान्य है और UBA, VCB ओपन अवस्था की तुलना में क्लोज़ अवस्था में ज्यादा वोल्टेज बताता है तो यह बैटरी चार्जिंग का संकेत है। मैसेज पर ध्यान न दें। सामान्य रूप से गाड़ी चलाएं।',
      '6. यदि बैटरी चार्ज नहीं हो रही है तो सेक्शन क्लियर करके इसकी सूचना TLC को दें और उसके आदेशानुसार काम करें।'
    ]
  },
  {
    id: 'F0903P2',
    subSystem: 'SS09',
    message: 'LOW BATTERY CHARGER CURRENT\nBattery charger MCB may have Tripped\nBattery not being charged',
    lamp: 'BPFA प्रकाशित होगा।',
    effect: 'बैटरी चार्ज नहीं हो रही है (Battery not being charged), बैटरी चार्जर MCB ट्रिप हो सकता है।',
    actions: [
      '1. SB-2 में लगे बैटरी चार्जर आउटपुट MCB 110 व HB-2 में लगे बैटरी चार्जर इनपुट MCB 100 को चेक करें {यदि लोको पायलट द्वारा F0902P2 मैसेज पर ध्यान नहीं दिया गया तो} यदि ट्रिप हो तो VCB ओपन करके MCB को रीसेट करें।',
      '2. BPFA दबाकर फ़ॉल्ट ACK करें। ब्लॉक सेक्शन क्लियर करें।',
      '3. यदि MCB सामान्य हो और UBA, VCB ओपन अवस्था की तुलना में क्लोज़ अवस्था में ज्यादा वोल्टेज बताता है तो यह बैटरी चार्जिंग का संकेत है। मैसेज पर ध्यान न दें। सामान्य रूप से गाड़ी चलाएं।',
      '4. यदि बैटरी चार्ज नहीं हो रही है तो सेक्शन क्लियर करके इसकी सूचना TLC को दें और उसके आदेशानुसार काम करें।',
      '5. यदि सब कुछ सामान्य हो तो सामान्य रूप से गाड़ी चलाएं।'
    ]
  },
  {
    id: 'F0904P2',
    subSystem: 'SS09',
    message: 'DIAGNOSIS\nMEMORY BATTERY\nEMPTY\nInform TLC during next stop',
    lamp: 'BPFA प्रकाशित होगा।',
    effect: 'डायग्नोसिस मेमोरी बैटरी खाली (EMPTY) होने की सूचना, सामान्य ऑपरेशन प्रभावित नहीं।',
    actions: [
      '1. BPFA दबाकर फ़ॉल्ट ACK करें। सामान्य ऑपरेशन चालू करें।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F1001P1',
    subSystem: 'SS10',
    message: 'FAULT IN BRAKE ELECTRONICS\nFull service brake applied\nNo traction allowed',
    lamp: 'LSFI ब्लिंक करेगी। BPFA प्रकाशित होगा।',
    effect: 'फुल सर्विस ब्रेक लग जाएगी, ट्रैक्शन नहीं मिलेगा (No traction allowed / TE/BE = 0)।',
    actions: [
      '1. थ्रोटल को " 0 " पर लाएं। BPFA दबाकर फ़ॉल्ट ACK करें।',
      '2. SB-2 में MCB नं 127.7 चेक करें। यदि ट्रिप है तो एक बार कंट्रोल इलेक्ट्रॉनिक्स ऑफ़ करके उसे रीसेट करें। सोलेनाइड-30 (Solenoid-30) के रिलीज़ प्लंजर द्वारा पार्किंग ब्रेक रिलीज़ करें और कार्य करें। यदि सफलता नहीं मिलती तो पीछे की कैब से प्रयत्न करें।',
      '3. यदि ट्रिप नहीं है तो कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ करके ऑन करें। पैंटो उठाएं, VCB क्लोज़ करें तथा यदि लोको सामान्य होता है तो ट्रैक्शन चालू करें।',
      '4. यदि वही मैसेज फिर से आता है तो:\n   • E-70 वाले लोको में: TE/BE थ्रोटल को " 0 " पर लाएं और सहायता मांगें।\n   • CCB (Knorr Bremse) वाले लोको में: यदि पीछे की कैब का A-9 इमरजेंसी पर हो तो उसे FS पर लॉक करके मोड स्विच को Trail पर रखें। यदि सफलता नहीं मिलती तो PTDC मोड एक्टिव करने के अनुदेशों का पालन करके सेक्शन क्लियर करें।',
      '5. यदि 20 मिनट के अंदर सफलता नहीं मिलती है तो सहायता इंजन की मांग करें।'
    ]
  },
  {
    id: 'F1001P2',
    subSystem: 'SS10',
    message: 'LOCO IS IN BANKING\nMODE\nLoco brake controller isolated\nEmergency brakes can be\napplied',
    lamp: 'LSFI ब्लिंक करेगी, BPFA प्रकाशित होगा।',
    effect: 'लोको ब्रेक कंट्रोलर आइसोलेट रहेगा, केवल इमरजेंसी ब्रेक लगाई जा सकती है।',
    actions: [
      '1. यह मैसेज लोको बैंकिंग मोड में कार्य करते समय आएगा। {ZBAN ऑन है और कॉक नं 70 क्लोज़ है}। यदि लोको बैंकिंग मोड में नहीं है तो निम्नानुसार कार्यवाही करें:-',
      '2. थ्रोटल को " 0 " पर लाएं।',
      '3. ZBAN स्विच की पोजीशन चेक करें, यदि ऑन है तो उसे ऑफ करें।',
      '4. यह ZBAN माइक्रोस्विच के माल-ऑपरेशन (Mal-operation) के कारण हो सकता है। ZBAN स्विच को दो-तीन बार झटके से ऑपरेट करें, यदि अटका है तो सामान्य हो जाएगा।',
      '5. VCB क्लोज़ करके सामान्य ट्रैक्शन चालू करें।',
      '6. यदि सफलता नहीं मिलती है तो कंट्रोल इलेक्ट्रॉनिक्स को ऑफ कर उसे ऑन (MCE OFF/ON) करें, और दूसरी कैब से प्रयत्न करें।',
      '7. TLC को सूचित करें, लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F1002P1',
    subSystem: 'SS10',
    message: 'LOW PRESSURE MAIN RESERVOIR\nNo traction allowed till pressure\nreaches 6.4 kg/cm2',
    lamp: 'LSFI ब्लिंक करेगी। BPFA प्रकाशित होगा।',
    effect: 'MR प्रेशर 6.4 kg/cm² आने तक TE/BE (ट्रैक्शन) की अनुमति नहीं मिलेगी (No traction allowed till pressure reaches 6.4 kg/cm²)।',
    actions: [
      '1. थ्रोटल को " 0 " पर लाएं। BPFA दबाकर फ़ॉल्ट ACK करें।',
      '2. कम्प्रेसर का कार्य चेक करें, यदि कार्य नहीं करते तो BLCP को MAN पोजीशन पर दबाएं।',
      '3. MR प्रेशर 6.4 kg/cm² आने तक इंतजार करें।',
      '4. MCB 47.1/1 (HB-1) व 47.1/2 (HB-2) को चेक करें। यदि ट्रिप मिले तो VCB ओपन करके उसे एक बार रीसेट करें।',
      '5. यदि MCP कार्य करते हैं तो एयर ड्रायर (Air Dryer) से लीकेज चेक करें। यदि लीकेज हो तो एयर ड्रायर को अंडरफ्रेम में लगे कॉक द्वारा आइसोलेट करें: D-in एवं D-out कॉक को बंद करें तथा D-off कॉक को खोल दें।',
      '6. ऑटो ड्रेन वाल्व, MR1 & 2 के ड्रेन कॉक, CP के डिलीवरी पाइप और अनलोडर वाल्व से लीकेज चेक करें। यदि लीकेज हो तो बैटरी बॉक्स-2 के ऊपर संबंधित COC बंद करें। यदि अनलोडर वाल्व का कॉक उपलब्ध नहीं है तो न्यूमैटिक पैनल पर लगे EP 26 के केबल को निकालें। CCB-2 लोको में न्यूमैटिक पैनल पर लगे VEUL के COC को बंद करें।',
      '7. FP प्रेशर ड्रॉप होने पर 136 कॉक को बंद करें।',
      '8. गाड़ी में न्यूमैटिक सिस्टम में लीकेज की जांच करें। यदि BP प्रेशर ड्रॉप होने के कारण MR प्रेशर ड्रॉप होता है तो VCD / SPM / TPWS (यदि दोनों कैब में A-9 के नीचे COC लगा हो) को आइसोलेट करें। सुनिश्चित करें कि ALP का इमरजेंसी वाल्व दोनों कैब में बंद और पीछे की कैब का A-9 न्यूट्रल पर हो (CCB-2 लोको में A-9 FS पर हो)।',
      '9. यदि कोई एयर लीकेज न हो और दोनों कम्प्रेसर के MCB सेट हों, फिर भी कम्प्रेसर काम नहीं कर रहे हों और MR प्रेशर मेंटेन नहीं हो रहा है, तो कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ करके ऑन करें (MCE OFF/ON), पैंटो उठाएं, VCB क्लोज़ करें। यदि लोको सामान्य होता है तो ट्रैक्शन चालू करें।',
      '10. यदि सफलता नहीं मिलती है तो BUR-3 को आइसोलेट करें (MCE ऑफ़ करके SB-2 में लगे MCB 127.22/3 के द्वारा)। लोको एनरजाइज करें। यदि लोको सामान्य होता है तो ट्रैक्शन चालू करें।',
      '11. यदि 20 मिनट के अंदर सफलता नहीं मिलती है तो सहायता इंजन की मांग करें।'
    ]
  },
  {
    id: 'F1002P2',
    subSystem: 'SS10',
    message: 'ALARM CHAIN PULLING\nCheck train',
    lamp: 'LSFI ब्लिंक करेगी, BPFA प्रकाशित होगा। AFI (Air Flow Indicator) सुई उठेगी।',
    effect: 'ट्रेन में BP प्रेशर ड्रॉप होगा, ब्रेक बाइंडिंग/ब्रेक लगेगा (थ्रोटल 0 पर लाना अनिवार्य)।',
    actions: [
      '1. थ्रोटल को " 0 " पर लाएं। गाड़ी को तुरंत सुविधाजनक जगह पर रोकें। ऑपरेटिंग मैनुअल तथा G&SR 4.45/1 के अनुसार कार्य करें।',
      '2. प्रभावित कोच को चेक करें, ACP के कारण का पता लगाएं, ACP को रीसेट करें और उसके अनुसार गाड़ी चलाएं।'
    ]
  },
  {
    id: 'F1003P1',
    subSystem: 'SS10',
    message: 'VIGILANCE EMERGENCY\nBRAKE APPLICATION\nBring TE/BE Throttle to 0\nPress vigilance reset push\nbutton',
    lamp: 'LSFI ब्लिंक करेगी, BPFA प्रकाशित होगा। पैनल A पर LSVW जलेगी व बजर बजेगा।',
    effect: 'BP प्रेशर 3 से 2.5 kg/cm² तक ड्रॉप होगा, पेनल्टी ब्रेक लग जाएगी, TE/BE 0 हो जाएगा।',
    actions: [
      '【स्थिति A: कर्मीदल द्वारा VCD "ACK" नहीं करने पर】:',
      '1. थ्रोटल को "0" पर लाएं।',
      '2. A-9 को आपातकालीन (Emergency) पोजीशन पर रखें, जिससे MR प्रेशर ड्रॉप होना बंद हो जाएगा।',
      '3. 120 सेकंड (WAP-5/7) / 160 सेकंड (WAG-9/9H) तक इंतजार करें, क्योंकि VCD पेनल्टी ब्रेक 120/160 सेकंड के बाद ही रीसेट हो सकती है। इसलिए BPVR को 120/160 सेकंड तक प्रेस न करें। (नोट: CCB Knorr Bremse में 32 सेकंड बाद BPVR प्रेस करें)।',
      '4. 120/160 सेकंड (CCB में 32 सेकंड) बाद पैनल A पर विजिलेंस रीसेट बटन BPVR दबाएं। LSVW बुझना व बजर बंद होना सुनिश्चित करें।',
      '5. विजिलेंस पेडल स्विच PVCD दबाकर रिलीज करें।',
      '6. BPFA दबाकर फ़ॉल्ट ACK करें।',
      '7. A-9 को RUN पोजीशन पर रखें। पेनल्टी ब्रेक रिलीज होकर BP प्रेशर वापस 5.0 kg/cm² चार्ज होगा।',
      '8. यदि ब्रेक रिलीज न हो तो MCE OFF/ON करें, पैंटो उठाएं, VCB क्लोज़ करें तथा सामान्य ट्रैक्शन चालू करें।',
      '【स्थिति B: सतर्क रहने पर भी पेनल्टी ब्रेक लगने पर (VCD/PVCD खराबी)】:',
      '• MCE OFF करके SB-1 पैनल में लगे स्विच 237.1 को "0" पर रखकर VCD आइसोलेट करें।',
      '• MCE ON करें, पैंटो उठाएं, VCB क्लोज़ कर सामान्य ट्रैक्शन चालू करें।',
      '• TLC को सूचित करें और अतिरिक्त सतर्क रहें। (इस स्थिति में "Low MR pressure" मैसेज आए तो ध्यान न दें)।'
    ]
  },
  {
    id: 'F1004P1',
    subSystem: 'SS10',
    message: 'WORKING WRONG\nCONFIGURATION\nBRAKE SYSTEM\nCheck isolating coc brake\ncontrol Wrong coc position, to\nreset open VCB',
    lamp: 'LSFI ब्लिंक करेगी, BPFA प्रकाशित होगा।',
    effect: 'ब्रेक सिस्टम की गलत कॉन्फ़िगरेशन चेतावनी, सामान्य ट्रैक्शन अवरुद्ध।',
    actions: [
      '1. थ्रोटल को " 0 " पर लाएं। BPFA दबाकर फ़ॉल्ट ACK करें।',
      '2. न्यूमैटिक पैनल पर लगे ब्रेक पाइप आइसोलेटिंग कॉक 70 को चेक करें। यदि क्लोज़ हो तो VCB ओपन करके उसे ओपन करें। यदि कॉक 70 पहले से ओपन हो तो VCB ओपन करके उसे दो-तीन बार ऑपरेट करें, लिमिटिंग स्विच (Limiting Switch) खराब/जाम होने के कारण ऐसा हो सकता है।',
      '3. ZBAN स्विच का ऑफ़ होना चेक करें, यदि ON हो तो उसे OFF पर रखें।',
      '4. सामान्य ट्रैक्शन चालू करें।'
    ]
  },
  {
    id: 'F1005P1',
    subSystem: 'SS10',
    message: 'TRACTION WITH AUTO\nBRAKE NOT ALLOWED\nRelease parking brakes\nBring TE/BE Throttle to 0',
    lamp: 'LSFI ब्लिंक करेगी, BPFA प्रकाशित होगा।',
    effect: 'ऑटो ब्रेक लगे रहने के कारण ट्रैक्शन (TE/BE) अवरुद्ध रहेगा (TE/BE = 0)।',
    actions: [
      '1. ऑटो एयर ब्रेक रिलीज करें (A-9 हैंडल को RUN पोजीशन पर रखें)। BP प्रेशर चेक करें 5.0 kg/cm² होना चाहिए।',
      '2. थ्रोटल को " 0 " पर लाएं। BPFA दबाकर फ़ॉल्ट ACK करें।',
      '3. सामान्य ट्रैक्शन चालू करें।',
      '4. यदि सफलता नहीं मिलती, दूसरी कैब से प्रयत्न करें।'
    ]
  },
  {
    id: 'F1006P1',
    subSystem: 'SS10',
    message: 'TRACTION WITH PARKING\nBRAKES NOT ALLOWED\nRelease parking brakes\nBring TE/BE Throttle to 0',
    lamp: 'LSFI ब्लिंक करेगी, BPFA प्रकाशित होगा। BPPB प्रकाशित रहेगा।',
    effect: 'पार्किंग ब्रेक लगे रहने के कारण ट्रैक्शन (TE/BE) अवरुद्ध रहेगा (TE/BE = 0)।',
    actions: [
      '1. थ्रोटल को " 0 " पर लाएं। BPFA दबाकर फ़ॉल्ट ACK करें।',
      '2. प्रज्वलित पुश बटन BPPB के द्वारा पार्किंग ब्रेक रिलीज़ करें। यदि पार्किंग ब्रेक रिलीज़ हो जाते हैं तो पार्किंग ब्रेक गेज में 6.0 kg/cm² प्रेशर दर्शाएगा और BPPB की लाइट बुझेगी।',
      '3. यदि पार्किंग ब्रेक रिलीज़ नहीं होते तो न्यूमैटिक पैनल पर सोलेनाइड वाल्व के लैच को चेक करें। यदि एप्लाइड पुश बटन एप्लाइड स्थिति में लॉक मिलता है तो उसे रिलीज़ करें।',
      '4. रिलीज़ पुश बटन को प्रेस करें और उस स्थिति में ज़रूरत पड़ने पर लॉक करें।',
      '5. यदि फिर भी पार्किंग ब्रेक रिलीज़ नहीं होते हैं तो पार्किंग ब्रेक सिलिंडर होज़ पाइप पर एयर लीकेज को चेक करें। यदि एयर लीकेज है तो उसे बंद करें।',
      '6. पार्किंग ब्रेक रिलीज़ होने के बाद सामान्य ट्रैक्शन चालू करें।'
    ]
  },
  {
    id: 'F1007P1',
    subSystem: 'SS10',
    message: 'REGENERATIVE BRAKE\nFAILURE\nPnuematic loco brake applied',
    lamp: 'LSFI ब्लिंक करेगी, BPFA प्रकाशित होगा।',
    effect: 'इलेक्ट्रिकल / रीजेनेरेटिव ब्रेक पावर उपलब्ध नहीं रहेगा (Electrical brake effort = 0 kN)। न्यूमैटिक लोको ब्रेक लागू रहेगा।',
    actions: [
      '1. थ्रोटल को " 0 " पर लाएं। लोको ब्रेक रिलीज़ हो जाएंगे। BPFA दबाकर फ़ॉल्ट ACK करें।',
      '2. गाड़ी को A-9 के द्वारा कंट्रोल करें। BC गेज 0 kg/cm² आने तक PVEF को प्रेस करें।',
      '3. इलेक्ट्रिकल ब्रेक पावर उपलब्ध नहीं रहेगा, ब्रेकिंग सिर्फ A-9 / SA-9 के द्वारा ही उपलब्ध रहेगी।',
      '4. सामान्य ट्रैक्शन चालू करें।',
      '5. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F1008P1',
    subSystem: 'SS10',
    message: 'EMERGENCY STOP,\nSHUT DOWN ON THE\nLOCO\nTo release, reset emergency\nstop push button\nBring TE/BE Throttle to 0',
    lamp: 'LSFI ब्लिंक करेगी, BPFA प्रकाशित होगा।',
    effect: 'VCB ओपन हो जाएगा, पैंटो लोअर हो जाएगा, इमरजेंसी ब्रेक लग जाएगा और BP प्रेशर शून्य हो जाएगा (TE/BE = 0)।',
    actions: [
      '1. थ्रोटल को " 0 " पर लाएं।',
      '2. इमरजेंसी स्टॉप पुश बटन (BPEMS) पर लगे तीर के निशान के अनुसार घुमाकर उसे रीसेट करें। रीसेट करने के बाद वह पूर्व स्थिति में आ जाएगा।',
      '3. BPFA को प्रेस करें।',
      '4. पैंटो उठाएं।',
      '5. VCB क्लोज करें।',
      '6. BP और MR सामान्य होने के बाद ट्रैक्शन चालू करें।',
      '7. यदि सफलता नहीं मिलती है तो दूसरी कैब से प्रयत्न करें।'
    ]
  },
  {
    id: 'F1009P1',
    subSystem: 'SS10',
    message: 'TRACTION NOT ALLOWED\nWITH APPLIED BRAKE\nRelease loco brake\nBring TE/BE Throttle to 0',
    lamp: 'LSFI ब्लिंक करेगी, BPFA प्रकाशित होगा।',
    effect: 'लोको ब्रेक लागू रहने (BC > 0.65 kg/cm²) पर ट्रैक्शन अवरुद्ध रहेगा (TE/BE = 0)।',
    actions: [
      '1. थ्रोटल को " 0 " पर लाएं। BPFA दबाकर फ़ॉल्ट ACK करें।',
      '2. SA-9 से लोको ब्रेक रिलीज़ करें (सुनिश्चित करें कि पिछली कैब का SA-9 रिलीज़ पर हो)। E-70 युक्त लोको में C3W डिस्ट्रीब्यूटर वाल्व का रिलीज़ हैंडल खींचें और CCB (Knorr Bremse) वाले लोको में बेल रिंग (Bail Ring) उठाएं तथा न्यूमैटिक पैनल पर 20CP एवं 16CP निप्पल को प्रेस करें।',
      '3. यदि ब्रेक सिलिंडर प्रेशर " 0 " kg/cm² बता रहा है और उपरोक्त मैसेज आता है तो हल्के से प्रेशर स्विच 269.6/1 और 269.6/2 को थपथपाएं (ये AR और न्यूमैटिक पैनल के बीच में लगे हैं)।',
      '4. यदि सफलता नहीं मिलती है तो कंट्रोल इलेक्ट्रॉनिक्स को ऑफ करके ऑन (MCE OFF/ON) करें।',
      '5. TLC को सूचित करें, लॉग बुक में दर्ज करें। (नोट: यह मैसेज पैसेंजर गाड़ी में ACP के दौरान भी आ सकता है यदि BP प्रेशर 0.6 kg/cm² से ज्यादा ड्रॉप हो)।'
    ]
  },
  {
    id: 'F1010P1',
    subSystem: 'SS10',
    message: 'EMG. EXHAUST COCK\nCLOSED, NO TRACTION\nFor traction open the cock\nBring TE/BE Throttle to 0',
    lamp: 'LSFI ब्लिंक करेगी, BPFA प्रकाशित होगा।',
    effect: 'कॉक 74 बंद रहने पर ट्रैक्शन अवरुद्ध रहेगा (TE/BE = 0)।',
    actions: [
      '1. थ्रोटल को " 0 " पर लाएं। BPFA दबाकर फ़ॉल्ट ACK करें।',
      '2. न्यूमैटिक पैनल पर लगे इमरजेंसी एग्जॉस्ट कॉक नं. 74 (Cock 74) को खोल दें।',
      '3. यदि कॉक नं. 74 ओपन है और फिर भी मैसेज आता है, इसका मतलब कॉक पर लगे लिमिटिंग स्विच (Limiting Switch) में खराबी है, उसे 2-3 बार ऑपरेट करें।',
      '4. यदि लोको सामान्य होता है तो आगे कार्य करें, अन्यथा कंट्रोल इलेक्ट्रॉनिक्स को ऑफ करके पुनः ऑन (MCE OFF/ON) करें।'
    ]
  },
  {
    id: 'F1101P2',
    subSystem: 'SS11',
    message: 'MCB(S) TRIPPED IN AUX.\nCUBICLE 1\nTraction power may get reduced,\nif temperature exceed.',
    lamp: 'BPFA प्रकाशित होगा।',
    effect: 'HB-1 में MCB ट्रिप होने से संबंधित ऑक्सिलरी बंद हो सकती है; तापमान बढ़ने पर ट्रैक्शन पॉवर कम हो सकती है या बोगी-1 आइसोलेट हो सकती है।',
    actions: [
      '1. HB-1 में लगे MCB को चेक करें, यदि कोई MCB ट्रिप मिले, तो उसे VCB ओपन करके एक बार रीसेट करें।',
      '2. BPFA द्वारा फ़ॉल्ट एक्नॉलेज (ACK) करें। सामान्य ऑपरेशन चालू रखें।',
      '3. यदि कोई भी MCB ट्रिप नहीं है, फिर भी मैसेज आ रहा है और सभी ऑक्सिलरी कार्य कर रही हैं, तो उस पर ध्यान न दें। यह संबंधित MCB के कंट्रोल कॉन्टैक्ट (Control Contact) खराब होने के कारण हो सकता है।',
      '4. यदि उपरोक्त अनुक्रम 1 के अनुसार MCB (59.1/1 या 62.1/1 या 63.1/1 या 53.1/1) रीसेट करने के बाद दोबारा ट्रिप हो रहे हैं, तो लोको पायलट उसे रीसेट करने की कोशिश न करें। SS08 के अंत में दिए गए पेज नं 179 / 180 "ऑक्सिलरी के MCB बार-बार ट्रिप होने पर" के अनुसार ट्रबलशूट करें।',
      '5. TLC को सूचित करें तथा लॉग बुक में नोट करें। यदि अपने आप बोगी-1 आइसोलेट हो जाती है तो एक बोगी के साथ ट्रैक्शन चालू रखें।',
      '6. अगर अनुक्रम 4 में दिए गए MCB के अलावा दूसरे MCB रीसेट करने के पश्चात दोबारा ट्रिप हो रहे हैं, तो जहाँ तक संभव हो सामान्य ऑपरेशन चालू रखें और TLC को सूचित करें।',
      '7. MCB 54.1/1 को चेक करें, यदि ट्रिप है तो एक बार रीसेट करें। यदि फिर से ट्रिप होती है और यदि ऑक्सिलरी कनवर्टर 1 (BUR-1) आइसोलेट हो जाता है तो गाड़ी चलाएं। TLC को सूचित करें।'
    ]
  },
  {
    id: 'F1102P2',
    subSystem: 'SS11',
    message: 'EARTH FAULT 415/110V\nCIRCUIT\nNormal operation can continue\nTo be checked during maintenance',
    lamp: 'BPFA प्रकाशित होगा।',
    effect: 'सामान्य ऑपरेशन जारी रह सकता है (Normal operation can continue)। 415/110V सर्किट में अर्थ फ़ॉल्ट है जिसे मेंटेनेंस के दौरान चेक किया जाना चाहिए।',
    actions: [
      '1. BPFA दबाकर फ़ॉल्ट ACK करें। सामान्य ट्रैक्शन चालू करें।',
      '2. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F1103P2',
    subSystem: 'SS11',
    message: 'MCB OFF MAIN\nCOMPRESSOR\nOPEN\nCompressor 1 not available',
    lamp: 'BPFA प्रकाशित होगा।',
    effect: 'कम्प्रेसर-1 उपलब्ध नहीं रहेगा (Compressor 1 not available)। केवल कम्प्रेसर-2 कार्य करेगा।',
    actions: [
      '1. ऑक्सिलरी क्यूबिकल HB-1 में लगे MCB नं 47.1/1 चेक करें। यदि ट्रिप मिले, तो VCB ओपन करके एक बार रीसेट करें।',
      '2. BPFA दबाकर फ़ॉल्ट ACK करें।',
      '3. सामान्य ट्रैक्शन चालू करें। अगर वही मैसेज दोबारा आता है तो एक कम्प्रेसर के साथ गाड़ी चलाएं।',
      '4. TLC को सूचित करें और लॉग बुक में दर्ज करें।',
      'नोट: यदि MCB नं. 47.1/1 और 47.1/2 बार-बार ट्रिप होते हैं तो VCB ओपन करके MCBs रीसेट करें और BUR-3 को आइसोलेट करें।'
    ]
  },
  {
    id: 'F1104P2',
    subSystem: 'SS11',
    message: 'OVERLOAD ON OCB-1\nIsolate OCB',
    lamp: 'BPFA प्रकाशित होगा।',
    effect: 'OCB-1 पर ओवरलोड (Overload on OCB-1)। बोगी-1 को आइसोलेट करना पड़ेगा।',
    actions: [
      '1. थ्रोटल को "0" पर लाएं। BPFA दबाकर फ़ॉल्ट ACK करें।',
      '2. HB-1 में लगे ऑयल कूलिंग ब्लोअर के MCB 59.1/1 को ट्रिप करें।',
      '3. बोगी-1 को स्विच 154 द्वारा आइसोलेट करें।',
      '4. एक बोगी (बोगी-2) के साथ सामान्य ऑपरेशन कर सकते हैं।'
    ]
  },
  {
    id: 'F1105P2',
    subSystem: 'SS11',
    message: 'Rotary Switch Vigilance off\n/ on position\nNormal operation',
    lamp: 'BPFA प्रकाशित होगा।',
    effect: 'रोटरी स्विच 237.1 (VCD कट-आउट स्विच) की पोजीशन संबंधित संदेश। सामान्य ऑपरेशन जारी रहेगा।',
    actions: [
      '1. BPFA दबाकर फ़ॉल्ट ACK करें।',
      '2. सामान्य ट्रैक्शन चालू करें और सतर्क रहें।',
      '3. TLC को सूचित करें और लॉग बुक में दर्ज करें।',
      'नोट: VCD को 237.1 (SB-1) के द्वारा केवल फ़ेलियर / माल-फंक्शन के दौरान ही आइसोलेट करें।'
    ]
  },
  {
    id: 'F1106P2',
    subSystem: 'SS11',
    message: 'ROTARY SWITCH 160\nLoco in shunting mode speed\ncannot be more than 15 KMPH',
    lamp: 'BPFA प्रकाशित होगा।',
    effect: 'लोको शंटिंग मोड में है, गति 15 KMPH से अधिक नहीं हो सकती।',
    actions: [
      '1. SB-1 पर लगे स्विच नं. 160 की पोजीशन चेक करें। यदि स्विच "0" पर है तो थ्रोटल को "0" पर लाएं, Speed "0" पर लाएं, Reverser "0" पर लाएं, तथा Switch 160 को "1" पर लाकर सामान्य गति प्राप्त करें।',
      '2. BPFA दबाकर फ़ॉल्ट ACK करें। सामान्यतौर पर गाड़ी चलाएं।'
    ]
  },
  {
    id: 'F1201P2',
    subSystem: 'SS12',
    message: 'MCB(S) TRIPPED IN AUX.\nCUBICLE 2\nTraction power may get reduced,\nif temperature exceed.',
    lamp: 'BPFA प्रकाशित होगा।',
    effect: 'HB-2 में MCB ट्रिप होने से संबंधित ऑक्सिलरी बंद हो सकती है; तापमान बढ़ने पर ट्रैक्शन पॉवर कम हो सकती है अथवा बोगी-2 स्वतः आइसोलेट हो सकती है।',
    actions: [
      '1. HB-2 में लगे MCBs को चेक करें, यदि कोई MCB ट्रिप मिले, तो उसे VCB ओपन करके एक बार रीसेट करें।',
      '2. BPFA द्वारा फ़ॉल्ट एक्नॉलेज (ACK) करें। सामान्य ऑपरेशन चालू रखें।',
      '3. यदि कोई भी MCB ट्रिप नहीं है फिर भी मैसेज आ रहा है और सभी ऑक्सिलरी कार्य कर रही हैं तो उस मैसेज पर ध्यान न दें। यह संबंधित MCB के कंट्रोल कॉन्टैक्ट खराब होने के कारण हो सकता है।',
      '4. यदि उपरोक्त अनुक्रम 1 के अनुसार MCB (59.1/2, 62.1/2, 63.1/2 या 53.1/2) रीसेट करने के बाद दोबारा ट्रिप हो रहे हैं तो लोको पायलट उसे रीसेट करने की कोशिश न करें। SS08 के अंत में दिए गए पेज नं 179 / 180 "ऑक्सिलरी के MCB बार-बार ट्रिप होने पर" के अनुसार ट्रबलशूट करें।',
      '5. TLC को सूचित करें तथा लॉग बुक में नोट करें। यदि अपने आप बोगी-2 आइसोलेट हो जाती है तो एक बोगी (बोगी-1) के साथ ट्रैक्शन चालू रखें।',
      '6. यदि अनुक्रम 4 में दिए गए MCB के अलावा दूसरे MCB रीसेट करने के पश्चात दोबारा ट्रिप हो रहे हैं तो जहाँ तक संभव हो सामान्य ऑपरेशन चालू रखें और TLC को सूचित करें।',
      '7. MCB क्रम 54.1/2 को चेक करें, यदि ट्रिप है तो एक बार रीसेट करें, यदि फिर से ट्रिप होती है तो सेक्शन साफ़ करके TLC को सूचित करें और सहायता इंजन मांगें।'
    ]
  },
  {
    id: 'F1202P2',
    subSystem: 'SS12',
    message: 'MCB OF MAIN\nCOMPRESSOR OPEN\nCompressor 2 not available',
    lamp: 'BPFA प्रकाशित होगा।',
    effect: 'कम्प्रेसर 2 उपलब्ध नहीं रहेगा (Compressor 2 not available)। केवल कम्प्रेसर 1 से कार्य होगा।',
    actions: [
      '1. ऑक्सिलरी क्यूबिकल HB-2 में लगे MCB नं 47.1/2 चेक करें। यदि ट्रिप मिले, VCB ओपन करके एक बार रीसेट करें।',
      '2. BPFA दबाकर फ़ॉल्ट ACK करें।',
      '3. सामान्य ट्रैक्शन चालू करें। अगर वही मैसेज दोबारा आता है तो एक कम्प्रेसर के साथ गाड़ी चलाएं।',
      '4. TLC को सूचित करें और लॉग बुक में दर्ज करें।',
      'नोट: यदि MCB नं 47.1/1 और 47.1/2 बार-बार ट्रिप होते हैं तो VCB ओपन करके MCBs रीसेट करें और BUR-3 को आइसोलेट करें।'
    ]
  },
  {
    id: 'F1203P2',
    subSystem: 'SS12',
    message: 'OVERLOAD ON OCB-2\nIsolate OCB',
    lamp: 'BPFA प्रकाशित होगा।',
    effect: 'OCB-2 पर ओवरलोड (Overload on OCB-2)। बोगी-2 को आइसोलेट करना पड़ेगा।',
    actions: [
      '1. थ्रोटल को "0" पर लाएं। BPFA दबाकर फ़ॉल्ट ACK करें।',
      '2. HB-2 में लगे ऑयल कूलिंग ब्लोअर के MCB 59.1/2 को ट्रिप करें।',
      '3. बोगी-2 को स्विच 154 द्वारा आइसोलेट करें।',
      '4. एक बोगी (बोगी-1) के साथ सामान्य ऑपरेशन कर सकते हैं।'
    ]
  },
  {
    id: 'F1301P1',
    subSystem: 'SS13',
    message: 'DISTURBANCE IN\nPROCESSOR HBB1\nCab 1 may get isolated, drive\nfrom cab 2 refer to driver’s\nmanual\n\n[WAG-9 / WAG-9H / WAP-7 / WAP-5 VCU Redundancy]:\nCab 1 will not Isolate.\nDrive from cab 1.\n\n[RBU / RIOM VCU Variant]:\nDisturbance in Processor RBU-2\nDriving from Cab 1 still possible Press BPFA.',
    lamp: 'BPFA प्रकाशित होगा।',
    effect: 'WAG-9 / WAG-9H / WAP-7 (VCU Redundancy): कैब 1 आइसोलेट नहीं होगी (Drive from cab 1)। HB-1 के सभी MCB, अर्थफ़ॉल्ट रिले 415/110V और फ्यूज 415/110V मॉनीटर नहीं होंगे।\nWAP-5 (VCU Redundancy): कैब 1 आइसोलेट नहीं होगी (Drive from cab 1)। HB-1 में 47.1/1 को छोड़कर अन्य MCB मॉनीटर नहीं होंगे।\nRBU-2 वेरिएंट: कैब-1 से ड्राइविंग संभव है (Press BPFA)।\nकन्वेंशनल 3-फेज लोको: कैब 1 आइसोलेट हो सकती है (Drive from cab 2)।',
    actions: [
      '【1. RBU / RIOM VCU वेरिएंट (Disturbance in Processor RBU-2)】:',
      '1. कंट्रोल इलेक्ट्रॉनिक्स को एक बार फिर ऑफ़ तथा ऑन करें। पेंटो रेज करें, VCB क्लोज़ करें तथा ट्रैक्शन चालू करें।',
      '2. यदि फ़ॉल्ट बना रहता है तो BPFA दबाकर फ़ॉल्ट एक्नॉलेज करें और किसी भी कैब से सामान्यतौर पर गाड़ी चलाएं।',
      '--------------------------------------------------',
      '【2. WAG-9 / WAG-9H / WAP-7 लोको (जिनमें VCU Redundancy फीचर दिया हुआ है)】:',
      '1. थ्रोटल को "0" पर लाएं। BPFA दबाकर फ़ॉल्ट ACK करें और गाड़ी चलाएं।',
      'नोट: HB-1 के सभी MCB, अर्थफ़ॉल्ट रिले 415/110V और फ्यूज 415/110V मॉनीटर नहीं होंगे।',
      '--------------------------------------------------',
      '【3. WAP-5 लोको (जिनमें VCU Redundancy फीचर दिया हुआ है)】:',
      '1. थ्रोटल को "0" पर लाएं। BPFA दबाकर फ़ॉल्ट ACK करें और गाड़ी चलाएं।',
      'नोट: HB-1 में लगे सभी MCB, केवल 47.1/1 (MCP-1) को छोड़कर, मॉनीटर नहीं होंगे।',
      '--------------------------------------------------',
      '【4. कन्वेंशनल 3-फेज लोको (बिना VCU Redundancy)】:',
      '1. थ्रोटल को "0" पर लाएं। BPFA दबाकर फ़ॉल्ट ACK करें।',
      '2. SB-1 पर लगे MCB (127.1/1) को चेक करें, यदि ट्रिप हो तो कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ करके एक बार रीसेट करें।',
      '3. यदि ट्रिप नहीं है तो कंट्रोल इलेक्ट्रॉनिक्स को एक बार फिर ऑफ़ तथा ऑन करें। पेंटो रेज करें, VCB क्लोज़ करें तथा ट्रैक्शन चालू करें।',
      '【फॉलो-अप स्क्रीन / ENTER दबाने पर: CAB 1 ISOLATED / Drive from cab 2】: कैब-2 से कार्य करें। TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F1302P1',
    subSystem: 'SS13',
    message: 'DISTURBANCE IN\nPROCESSOR STB1\nCab 1 may get isolated, drive\nfrom Cab 2 refer to driver’s\nmanual\n\n[WAG-9 / WAG-9H / WAP-7 / WAP-5 VCU Redundancy]:\nCab 1 will not Isolate.\nDrive from cab 1.\n\n[RBU / RIOM VCU Variant]:\nDisturbance in Processor RBU-1\nDriving from Cab 1 still possible Press BPFA.',
    lamp: 'BPFA प्रकाशित होगा।',
    effect: 'RBU-1 वेरिएंट: कैब-1 से ड्राइविंग संभव (Press BPFA)। CAB-1 के TE/BE मीटर काम नहीं करेंगे, CAB-1 से फेलियर मोड में चलेगा, CAB-2 से सामान्य ऑपरेशन संभव।\nWAG-9 / WAG-9H / WAP-7 (VCU Redundancy): कैब 1 आइसोलेट नहीं होगी (Drive from cab 1)। एयर ड्रायर, होटल लोड और फेलियर मोड स्विच काम नहीं करेंगे।\nWAP-5 (VCU Redundancy): कैब 1 आइसोलेट नहीं होगी। एयर ड्रायर, होटल लोड और ऑटो सैंडिंग काम नहीं करेंगे।\nकन्वेंशनल 3-फेज लोको: कैब 1 आइसोलेट हो सकती है (Drive from cab 2)।',
    actions: [
      '【1. RBU / RIOM VCU वेरिएंट (Disturbance in Processor RBU-1)】:',
      '1. कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ तथा ऑन करें। पेंटो रेज करें, VCB क्लोज़ करें तथा ट्रैक्शन चालू करें।',
      '2. यदि फ़ॉल्ट बना रहता है तो BPFA दबाकर फ़ॉल्ट एक्नॉलेज करें और किसी भी कैब से सामान्यतौर पर गाड़ी चलाएं।',
      '3. CAB-1 के TE/BE मीटर रीडिंग नहीं बताएंगे।',
      '4. लोको CAB-1 से फेलियर मोड {ऑटो एक्टिवेशन} में चलेगा।',
      '5. CAB-2 से सामान्य ऑपरेशन किया जा सकता है।',
      '--------------------------------------------------',
      '【2. WAG-9 / WAG-9H / WAP-7 लोको (जिनमें VCU Redundancy फीचर दिया हुआ है)】:',
      '1. थ्रोटल को "0" पर लाएं। BPFA दबाकर फ़ॉल्ट ACK करें और गाड़ी चलाएं।',
      '2. यदि बोगी आइसोलेशन की आवश्यकता हो तो बोगी-1 को MCB 127.1/1 एवं 127.11/1 {SB-1}, बोगी-2 को MCB 127.1/2 एवं 127.11/2 {SB-2} द्वारा आइसोलेट करें।',
      '3. यदि कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ करने की आवश्यकता हो तो BL को OFF पर रखकर MCB 112.1 को ऑफ़ करें।',
      'नोट: एयर ड्रायर, होटल लोड और फेलियर मोड स्विच काम नहीं करेंगे।',
      '--------------------------------------------------',
      '【3. WAP-5 लोको (जिनमें VCU Redundancy फीचर दिया हुआ है)】:',
      '1. थ्रोटल को "0" पर लाएं। BPFA दबाकर फ़ॉल्ट ACK करें और गाड़ी चलाएं।',
      'नोट: एयर ड्रायर, होटल लोड और ऑटो सैंडिंग काम नहीं करेंगे।',
      '--------------------------------------------------',
      '【4. कन्वेंशनल 3-फेज लोको (बिना VCU Redundancy)】:',
      '1. थ्रोटल को "0" पर लाएं। BPFA दबाकर फ़ॉल्ट ACK करें।',
      '2. SB-1 पर लगे MCB (127.1/1) को चेक करें, यदि ट्रिप हो तो कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ करके एक बार रीसेट करें।',
      '3. यदि ट्रिप नहीं है तो कंट्रोल इलेक्ट्रॉनिक्स को एक बार फिर ऑफ़ तथा ऑन करें। पेंटो रेज करें, VCB क्लोज़ करें तथा ट्रैक्शन चालू करें।',
      '【फॉलो-अप स्क्रीन / ENTER दबाने पर: CAB 1 ISOLATED / Drive from cab 2】: कैब-2 से कार्य करें। TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F1303P1',
    subSystem: 'SS13',
    message: 'REVERSER DEFECTIVE\nDrive from cab 2',
    lamp: 'BPFA प्रकाशित होगा।',
    effect: 'रिवर्सर ख़राब होने के कारण कैब-1 से गाड़ी नहीं चलाई जा सकती; कोस्टिंग में सेक्शन क्लियर कर कैब-2 से गाड़ी चलानी होगी।',
    actions: [
      '1. थ्रोटल को "0" पर लाएं। BPFA दबाकर फ़ॉल्ट ACK करें।',
      '2. रिवर्सर को 2-3 बार ऑपरेट करें।',
      '3. यदि सफलता नहीं मिलती है तो कोस्टिंग में सेक्शन क्लियर करें। कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ तथा ऑन करें।',
      '4. यदि वही मैसेज दोबारा आता है तो कैब बदलकर, कैब-2 से सेक्शन क्लियर करें।',
      '5. TLC को सूचित करें और लॉग बुक में दर्ज करें।',
      '--------------------------------------------------',
      '【फॉलो-अप स्क्रीन / ENTER दबाने पर: CAB 1 ISOLATED / Drive from cab 2】:',
      '1. कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ तथा ऑन करें।',
      '2. यदि कैब-1 से गाड़ी चला रहे हैं और वही मैसेज दोबारा आता है तो कैब बदलकर, कैब-2 से सेक्शन क्लियर करें। TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F1304P1',
    subSystem: 'SS13',
    message: 'RBU 1 RIOM\nEXTENSION FAULT\nDriving still possible',
    lamp: 'BPFA प्रकाशित होगा।',
    effect: 'ड्राइविंग संभव है (Driving still possible)। प्रभावित RIOM एक्सटेंशन की पहचान DDS से करनी होगी।',
    actions: [
      '1. कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ तथा ऑन करें। पेंटो रेज करें, VCB क्लोज़ करें तथा ट्रैक्शन चालू करें।',
      '2. यदि वही मैसेज दोबारा आता है और कैब-1 से गाड़ी चला रहे हैं तो कैब बदलकर कैब-2 से सेक्शन क्लियर करें। TLC को सूचित करें और लॉग बुक में दर्ज करें।',
      '3. DDS के मैसेज पढ़ें और कौन सा RIOM एक्सटेंशन बदलना है पता लगाएं।'
    ]
  },
  {
    id: 'F1305P1',
    subSystem: 'SS13',
    message: 'RBU 2 RIOM\nEXTENSION FAULT\nDriving still possible',
    lamp: 'BPFA प्रकाशित होगा।',
    effect: 'ड्राइविंग संभव है (Driving still possible)। प्रभावित RIOM एक्सटेंशन की पहचान DDS से करनी होगी।',
    actions: [
      '1. कंट्रोल इलेक्ट्रॉनिक्स को एक बार फिर ऑफ़ तथा ऑन करें। पेंटो उठाएं, VCB क्लोज़ करें तथा ट्रैक्शन चालू करें।',
      '2. यदि कैब-1 से गाड़ी चला रहे हैं और वही मैसेज दोबारा आता है तो कैब बदलकर कैब-2 से सेक्शन क्लियर करें। TLC को सूचित करें और लॉग बुक में दर्ज करें।',
      '3. DDS के मैसेज पढ़ें और कौन सा RIOM एक्सटेंशन बदलना है पता लगाएं।'
    ]
  },
  {
    id: 'F1304P1-MEDHA',
    subSystem: 'SS13',
    message: 'START RUN INTERLOCK\nSimultaneous Motoring & Braking command\nfrom Throttle of CAB-1',
    lamp: 'BPFA प्रकाशित होगा।',
    effect: 'कैब-1 के थ्रोटल से एक साथ मोटरिंग एवं ब्रेकिंग कमांड जाने के कारण इंटरलॉक सक्रिय। सामान्य परिचालन बाधित।',
    actions: [
      '1. थ्रोटल को "0" पर लाएं।',
      '2. कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ तथा ऑन करें (MCE OFF/ON)।',
      '3. यदि वही मैसेज दोबारा आता है तो कैब बदलकर सेक्शन क्लियर करें।',
      '4. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F1301P2',
    subSystem: 'SS13',
    message: 'Disturbance in Processor\nVCU1-DIP1\n(MEDHA IGBT Loco)',
    lamp: 'BPFA प्रकाशित होगा।',
    effect: 'VCU1-DIP1 डिस्टर्बेंस। सामान्य ऑपरेशन चालू रहेगा किंतु CSC, सिमुलेशन मोड, PVEF कैब-1 से कार्य नहीं करेंगे और 47.1/1 MCB ट्रिप का पता नहीं चलेगा।',
    actions: [
      '1. फ़ॉल्ट को लॉग बुक में दर्ज करें तथा सामान्य ऑपरेशन चालू रखें।',
      'निम्न कार्य नहीं होंगे:-',
      '   • CSC कैब-1 से कार्य नहीं करेगा।',
      '   • सिमुलेशन मोड कार्य नहीं करेगा।',
      '   • PVEF कैब-1 से कार्य नहीं करेगा।',
      '   • 47.1/1 MCB ट्रिप होने का पता नहीं चलेगा।'
    ]
  },
  {
    id: 'F1302P2',
    subSystem: 'SS13',
    message: 'Disturbance in Processor\nVCU1-DIP2\n(MEDHA IGBT Loco)',
    lamp: 'BPFA प्रकाशित होगा।',
    effect: 'VCU1-DIP2 डिस्टर्बेंस। सामान्य ऑपरेशन चालू रहेगा किंतु MCB 53.1/1, 54.1/1, 55.1/1, 56.1/1 और 59.1/1 ट्रिप होने का पता नहीं चलेगा।',
    actions: [
      '1. फ़ॉल्ट को लॉग बुक में दर्ज करें तथा सामान्य ऑपरेशन चालू रखें।',
      'निम्न कार्य नहीं होंगे:-',
      '   • MCB 53.1/1, 54.1/1, 55.1/1, 56.1/1 और 59.1/1 ट्रिप होने का पता नहीं चलेगा।'
    ]
  },
  {
    id: 'F1303P2',
    subSystem: 'SS13',
    message: 'Disturbance in Processor\nVCU1-DIP3\n(MEDHA IGBT Loco)',
    lamp: 'BPFA प्रकाशित होगा।',
    effect: 'VCU1-DIP3 डिस्टर्बेंस। सामान्य ऑपरेशन चालू रहेगा किंतु अर्थफ़ॉल्ट {कंट्रोल, फ़िल्टर और 415/110} डिटेक्ट नहीं होगा और MCB 62.1/1, 63.1/1 ट्रिप का पता नहीं चलेगा।',
    actions: [
      '1. फ़ॉल्ट को लॉग बुक में दर्ज करें तथा सामान्य ऑपरेशन चालू रखें।',
      'निम्न कार्य नहीं होंगे:-',
      '   • अर्थफ़ॉल्ट {कंट्रोल, फ़िल्टर और 415/110V} डिटेक्ट नहीं होगा।',
      '   • MCB 62.1/1 और 63.1/1 ट्रिप होने का पता नहीं चलेगा।'
    ]
  },
  {
    id: 'F1304P2',
    subSystem: 'SS13',
    message: 'Disturbance in Processor\nVCU1-DIP4\n(MEDHA IGBT Loco)',
    lamp: 'BPFA प्रकाशित होगा।',
    effect: 'VCU1-DIP4 डिस्टर्बेंस। सामान्य ऑपरेशन पर कोई प्रतिकूल प्रभाव नहीं।',
    actions: [
      '1. फ़ॉल्ट को लॉग बुक में दर्ज करें तथा सामान्य ऑपरेशन चालू रखें।'
    ]
  },
  {
    id: 'F1305P2',
    subSystem: 'SS13',
    message: 'Disturbance in Processor\nVCU1-DOP1\n(MEDHA IGBT Loco)',
    lamp: 'BPFA प्रकाशित होगा।',
    effect: 'VCU1-DOP1 डिस्टर्बेंस। डेस्क लैम्प इंडिकेशन कार्य नहीं करेंगे; TFT डिस्प्ले यूनिट पर इंडिकेशन देखें।',
    actions: [
      '1. फ़ॉल्ट को लॉग बुक में दर्ज करें तथा सामान्य ऑपरेशन चालू रखें।',
      'निम्न कार्य नहीं होंगे:-',
      '   • लैम्प इंडिकेशन कार्य नहीं करेंगे, लैम्प इंडिकेशन TFT डिस्प्ले यूनिट पर देखे जा सकते हैं।'
    ]
  },
  {
    id: 'F1306P2',
    subSystem: 'SS13',
    message: 'Disturbance in Processor\nVCU1-DOP2\n(MEDHA IGBT Loco)',
    lamp: 'BPFA प्रकाशित होगा।',
    effect: 'VCU1-DOP2 डिस्टर्बेंस। सामान्य ऑपरेशन चालू रहेगा किंतु एयर ड्रायर कार्य नहीं करेगा।',
    actions: [
      '1. फ़ॉल्ट को लॉग बुक में दर्ज करें तथा सामान्य ऑपरेशन चालू रखें।',
      'निम्न कार्य नहीं होंगे:-',
      '   • एयर ड्रायर (Air Dryer) कार्य नहीं करेगा।'
    ]
  },
  {
    id: 'F1307P2',
    subSystem: 'SS13',
    message: 'Disturbance in Processor\nVCU1-DOP3\n(MEDHA IGBT Loco)',
    lamp: 'BPFA प्रकाशित होगा।',
    effect: 'VCU1-DOP3 डिस्टर्बेंस। सामान्य ऑपरेशन पर कोई प्रतिकूल प्रभाव नहीं।',
    actions: [
      '1. फ़ॉल्ट को लॉग बुक में दर्ज करें तथा सामान्य ऑपरेशन चालू रखें।'
    ]
  },
  {
    id: 'F1401P1',
    subSystem: 'SS14',
    message: 'DISTURBANCE IN\nPROCESSOR HBB2 / RBU-4\nCab 2 may get isolated / Cab 2 will not Isolate\nDrive from cab 1 / Drive from cab 2 (BHEL TCN/IGBT: RBU-4)',
    lamp: 'BPFA प्रकाशित होगा।',
    effect: 'कन्वेंशनल 3-फेज में कैब-2 आइसोलेट हो सकती है (कैब-1 से चलाएं); WAP-5/WAG-9/WAP-7 VCU Redundancy में कैब-2 आइसोलेट नहीं होगी (Drive from Cab 2), किंतु स्विच 85 को II पर रखना होगा। WAG-9/WAP-7 में VCD 237.1 आइसोलेट करें, पार्किंग ब्रेक रिलीज करें, रीजेनेरेटिव ब्रेक काम नहीं करेगा तथा ऑटो फ़्लैशर काम नहीं करेगी। BHEL TCN/IGBT लोको में RBU-4 डिस्टर्बेंस पर कैब-2 से ड्राइविंग संभव है।',
    actions: [
      '【1. BHEL TCN एवं IGBT मेक लोको (Disturbance in Processor RBU-4)】:',
      '1. कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ तथा ऑन करें (MCE OFF/ON)। पैंटो रेज़ करें, VCB क्लोज़ करें तथा ट्रैक्शन चालू करें।',
      '2. यदि फ़ॉल्ट फिर भी बना रहता है तो BPFA दबाकर फ़ॉल्ट एकनॉलेज करें और किसी भी कैब से सामान्य तौर पर गाड़ी चलाएं।',
      '--------------------------------------------------',
      '【2. WAG-9 / WAG-9H / WAP-7 लोको (जिनमें VCU Redundancy Feature दिया हुआ है)】:',
      '1. थ्रोटल को "0" पर लाएं। गाड़ी खड़ी करें और पार्किंग ब्रेक मैनुअली रिलीज़ करें।',
      '2. VCD को SB-1 में लगे 237.1 स्विच को "0" पर रखकर आइसोलेट करें।',
      '3. यदि कैब-2 से गाड़ी चला रहे हों तो न्यूमैटिक पैनल पर पैंटो सिलेक्टर स्विच (85) को "II" पर रखें, क्योंकि पैंटो-1 रेज नहीं होगा।',
      '4. BPFA दबाकर फ़ॉल्ट ACK करें और गाड़ी चलाएं।',
      '5. थ्रोटल को BE (Braking Effort) की तरफ न ले जाएं क्योंकि रीजेनेरेटिव ब्रेक कार्य नहीं करेगा।',
      '6. ऑटो फ़्लैशर काम नहीं करेगी क्योंकि प्रेशर स्विच फ्लो इंडिकेटर मॉनीटर नहीं होगा, अतः आवश्यकता पड़ने पर BPFL स्विच को ऑन करके फ़्लैशर लाइट जलाएं।',
      'नोट: प्रेशर स्विच डायरेक्ट ब्रेक मॉनीटर नहीं होगा; प्रेशर स्विच PAN-1 और PAN-2 मॉनीटर नहीं होगा।',
      '--------------------------------------------------',
      '【3. WAP-5 लोको (जिनमें VCU Redundancy Feature दिया हुआ है)】:',
      '1. थ्रोटल को "0" पर लाएं। BPFA दबाकर फ़ॉल्ट ACK करें और गाड़ी चलाएं।',
      '2. यदि कैब-2 से गाड़ी चला रहे हों तो न्यूमैटिक पैनल पर पैंटो सिलेक्टर स्विच (85) को "II" पर रखें, क्योंकि पैंटो-1 रेज नहीं होगा।',
      '--------------------------------------------------',
      '【4. कन्वेंशनल 3-फेज लोको (बिना VCU Redundancy)】:',
      '1. थ्रोटल को "0" पर लाएं। BPFA दबाकर फ़ॉल्ट ACK करें।',
      '2. SB-2 पर लगे MCB (127.1/2) को चेक करें, यदि ट्रिप हो तो कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ करके एक बार रीसेट करें।',
      '3. यदि ट्रिप नहीं है तो कंट्रोल इलेक्ट्रॉनिक्स को एक बार फिर ऑफ़ तथा ऑन करें। पेंटो रेज करें, VCB क्लोज़ करें तथा ट्रैक्शन चालू करें।',
      '【स्क्रीन 2 / ENTER दबाने पर: CAB 2 ISOLATED / Drive from cab 1】: कैब-1 से कार्य करें। TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F1402P1',
    subSystem: 'SS14',
    message: 'DISTURBANCE IN\nPROCESSOR STB2 / RBU-3\nCab 2 may get isolated / Cab 2 will not Isolate\nDrive from cab 1 / Drive from cab 2 (BHEL TCN/IGBT: RBU-3)',
    lamp: 'BPFA प्रकाशित होगा।',
    effect: 'कन्वेंशनल 3-फेज में कैब-2 आइसोलेट हो सकती है (कैब-1 से चलाएं); WAG-9/WAP-7/WAP-5 VCU Redundancy में कैब-2 आइसोलेट नहीं होगी (Drive from Cab 2), किंतु HB-2 के MCBs, ओवरस्पीड, विजिलेंस वार्निंग बजर व ऑक्सिलरी अर्थ फ़ॉल्ट मॉनीटर नहीं होंगे। BHEL TCN/IGBT लोको में RBU-3 डिस्टर्बेंस पर कैब-2 में TE/BE मीटर नहीं चलेंगे, लोको स्विच 152 से फेलियर मोड में चलेगा और रीजेनेरेटिव ब्रेक नहीं मिलेगा।',
    actions: [
      '【1. BHEL TCN एवं IGBT मेक लोको (Disturbance in Processor RBU-3)】:',
      '1. कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ तथा ऑन करें (MCE OFF/ON)। पैंटो रेज़ करें, VCB क्लोज़ करें तथा ट्रैक्शन चालू करें।',
      '2. यदि फ़ॉल्ट बना रहता है तो BPFA दबाकर फ़ॉल्ट एकनॉलेज करें और किसी भी कैब से सामान्य तौर पर गाड़ी चलाएं।',
      '3. कैब-2 के TE/BE मीटर रीडिंग नहीं बताएंगे।',
      '4. लोको कैब-2 से फेलियर मोड (रोटेटिंग स्विच 152 को "0" से "1" पोजीशन पर) में चलेगा।',
      '5. रीजेनेरेटिव ब्रेक उपलब्ध नहीं होगा, अतः गाड़ी/लोको को न्यूमैटिक ब्रेक (A-9/SA-9) द्वारा कंट्रोल करें।',
      '6. कैब-1 से सामान्य ऑपरेशन संभव है।',
      '--------------------------------------------------',
      '【2. WAG-9 / WAG-9H / WAP-7 लोको (जिनमें VCU Redundancy Feature दिया हुआ है)】:',
      '1. थ्रोटल को "0" पर लाएं। BPFA दबाकर फ़ॉल्ट ACK करें और गाड़ी चलाएं।',
      '2. यदि बोगी आइसोलेशन की आवश्यकता हो तो बोगी-1 को MCB 127.1/1 एवं 127.11/1 (SB-1), बोगी-2 को MCB 127.1/2 एवं 127.11/2 (SB-2) द्वारा आइसोलेट करें (MCE ऑफ़ करके)।',
      '3. यदि कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ करने की आवश्यकता हो तो BL को "OFF" पर रखकर MCB 112.1 को ऑफ़ करें।',
      'नोट: HB-2 में लगी सभी MCB मॉनीटर नहीं होंगी; स्पीडोमीटर में ओवरस्पीड मॉनीटर नहीं होगी; विजिलेंस वार्निंग बजर मॉनीटर नहीं होगा; ऑक्सिलरी अर्थ फ़ॉल्ट मॉनीटर नहीं होगा।',
      '--------------------------------------------------',
      '【3. WAP-5 लोको (जिनमें VCU Redundancy Feature दिया हुआ है)】:',
      '1. थ्रोटल को "0" पर लाएं। BPFA दबाकर फ़ॉल्ट ACK करें और गाड़ी चलाएं।',
      '2. 105% और 110% ओवर स्पीड होने पर अलार्म उपलब्ध नहीं होगा अतः लोको पायलट ज्यादा सतर्क रहते हुए स्पीडोमीटर पर लगातार ध्यान देते हुए गाड़ी चलाएं।',
      '3. यदि कैब-1 से गाड़ी चला रहे हों तो न्यूमैटिक पैनल पर पैंटो सिलेक्टर स्विच (85) को "I" पर रखें, क्योंकि पैंटो-2 रेज नहीं होगा।',
      'नोट: MCB 47.1/2 को छोड़कर HB-2 में लगी अन्य सभी MCB मॉनीटर नहीं होंगी।',
      '--------------------------------------------------',
      '【4. कन्वेंशनल 3-फेज लोको (बिना VCU Redundancy)】:',
      '1. थ्रोटल को "0" पर लाएं। BPFA दबाकर फ़ॉल्ट ACK करें।',
      '2. SB-2 पर लगे MCB (127.1/2) को चेक करें, यदि ट्रिप हो तो कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ करके एक बार रीसेट करें।',
      '3. यदि ट्रिप नहीं है तो कंट्रोल इलेक्ट्रॉनिक्स को एक बार फिर ऑफ़ तथा ऑन करें। पेंटो उठाएं, VCB क्लोज़ करें तथा ट्रैक्शन चालू करें।',
      '【स्क्रीन 2 / ENTER दबाने पर: CAB 2 ISOLATED / Drive from cab 1】: कैब-1 से कार्य करें। TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F1403P1',
    subSystem: 'SS14',
    message: 'REVERSER DEFECTIVE\nDrive from cab 1',
    lamp: 'BPFA प्रकाशित होगा।',
    effect: 'कैब-2 का रिवर्सर (MPJ) खराब होने के कारण कैब-2 से परिचालन बाधित; कोस्टिंग में सेक्शन क्लियर कर पीछे की कैब (कैब-1) से गाड़ी चलानी होगी।',
    actions: [
      '1. थ्रोटल को "0" पर लाएं। BPFA दबाकर फ़ॉल्ट ACK करें।',
      '2. रिवर्सर को 2-3 बार ऑपरेट करें।',
      '3. यदि सफलता नहीं मिलती है तो कोस्टिंग में सेक्शन क्लियर करें। कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ तथा ऑन करें (MCE OFF/ON)।',
      '4. यदि वही मैसेज दोबारा आता है तो पीछे की कैब (कैब-1) से सेक्शन क्लियर करें।',
      '5. TLC को सूचित करें और लॉग बुक में दर्ज करें।',
      '--------------------------------------------------',
      '【स्क्रीन 2 / ENTER दबाने पर: CAB 2 ISOLATED / Drive from cab 1】:',
      '1. कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ तथा ऑन करें।',
      '2. यदि वही मैसेज दोबारा आता है तो पीछे की कैब (कैब-1) से सेक्शन क्लियर करें। TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F1404P1',
    subSystem: 'SS14',
    message: 'RBU 3 RIOM\nEXTENSION FAULT\nDriving still possible',
    lamp: 'BPFA प्रकाशित होगा।',
    effect: 'कैब-2 में RBU-3 RIOM एक्सटेंशन फ़ॉल्ट। ड्राइविंग संभव है (Driving still possible)। DDS से प्रभावित RIOM एक्सटेंशन पता करना होगा।',
    actions: [
      '1. कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ तथा ऑन करें (MCE OFF/ON)। पैंटो रेज़ करें, VCB क्लोज़ करें तथा ट्रैक्शन चालू करें।',
      '2. यदि कैब-2 से गाड़ी चला रहे हों और वही मैसेज दोबारा आता है तो कैब बदलकर कैब-1 से सेक्शन क्लियर करें। TLC को सूचित करें और लॉग बुक में दर्ज करें।',
      '3. DDS के मैसेज पढ़ें और कौन सा RIOM एक्सटेंशन बदलना है पता लगाएं।'
    ]
  },
  {
    id: 'F1405P1',
    subSystem: 'SS14',
    message: 'RBU 4 RIOM\nEXTENSION FAULT\nDriving still possible',
    lamp: 'BPFA प्रकाशित होगा।',
    effect: 'कैब-2 में RBU-4 RIOM एक्सटेंशन फ़ॉल्ट। ड्राइविंग संभव है (Driving still possible)। DDS से प्रभावित RIOM एक्सटेंशन पता करना होगा।',
    actions: [
      '1. कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ तथा ऑन करें (MCE OFF/ON)। पैंटो उठाएं, VCB क्लोज़ करें तथा ट्रैक्शन चालू करें।',
      '2. यदि कैब-2 से गाड़ी चला रहे हों और वही मैसेज दोबारा आता है तो कैब बदलकर कैब-1 से सेक्शन क्लियर करें। TLC को सूचित करें और लॉग बुक में दर्ज करें।',
      '3. DDS के मैसेज पढ़ें और कौन सा RIOM एक्सटेंशन बदलना है, पता लगाएं।'
    ]
  },
  {
    id: 'F1404P1-MEDHA',
    subSystem: 'SS14',
    message: 'START RUN INTERLOCK\nSimultaneous Motoring & Braking command\nfrom Throttle of CAB-2',
    lamp: 'BPFA प्रकाशित होगा।',
    effect: 'कैब-2 के थ्रोटल से एक साथ मोटरिंग एवं ब्रेकिंग कमांड जाने के कारण सुरक्षा इंटरलॉक सक्रिय। सामान्य परिचालन बाधित।',
    actions: [
      '1. थ्रोटल को "0" पर लाएं।',
      '2. कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ तथा ऑन करें (MCE OFF/ON)। यदि वही मैसेज दोबारा आता है तो कैब बदलकर सेक्शन क्लियर करें। TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F1401P2',
    subSystem: 'SS14',
    message: 'Disturbance in Processor\nVCU2-DIP1\n(MEDHA IGBT Loco)',
    lamp: 'BPFA प्रकाशित होगा।',
    effect: 'VCU2-DIP1 डिस्टर्बेंस। सामान्य ऑपरेशन चालू रहेगा किंतु CSC कैब-2 से कार्य नहीं करेगा, PVEF कैब-2 से कार्य नहीं करेगा और MCB 47.1/2, 54.1/2 व 59.1/2 ट्रिप का पता नहीं चलेगा।',
    actions: [
      '1. फ़ॉल्ट को लॉग बुक में दर्ज करें तथा सामान्य ऑपरेशन चालू रखें।',
      'निम्न कार्य नहीं होंगे:-',
      '   • CSC कैब-2 से कार्य नहीं करेगा।',
      '   • PVEF कैब-2 से कार्य नहीं करेगा।',
      '   • MCB 47.1/2, 54.1/2 और 59.1/2 ट्रिप होने का पता नहीं चलेगा।'
    ]
  },
  {
    id: 'F1402P2',
    subSystem: 'SS14',
    message: 'Disturbance in Processor\nVCU2-DIP2\n(MEDHA IGBT Loco)',
    lamp: 'BPFA प्रकाशित होगा।',
    effect: 'VCU2-DIP2 डिस्टर्बेंस। सामान्य ऑपरेशन चालू रहेगा किंतु MCB 53.1/2, 55.1/2 और 56.1/2 ट्रिप होने का पता नहीं चलेगा।',
    actions: [
      '1. फ़ॉल्ट को लॉग बुक में दर्ज करें तथा सामान्य ऑपरेशन चालू रखें।',
      'निम्न कार्य नहीं होंगे:-',
      '   • MCB 53.1/2, 55.1/2 और 56.1/2 ट्रिप होने का पता नहीं चलेगा।'
    ]
  },
  {
    id: 'F1403P2',
    subSystem: 'SS14',
    message: 'Disturbance in Processor\nVCU2-DIP3\n(MEDHA IGBT Loco)',
    lamp: 'BPFA प्रकाशित होगा।',
    effect: 'VCU2-DIP3 डिस्टर्बेंस। सामान्य ऑपरेशन चालू रहेगा किंतु स्मोक वार्निंग डिटेक्ट नहीं होगी और MCB 62.1/2 व 63.1/2 ट्रिप होने का पता नहीं चलेगा।',
    actions: [
      '1. फ़ॉल्ट को लॉग बुक में दर्ज करें तथा सामान्य ऑपरेशन चालू रखें।',
      'निम्न कार्य नहीं होंगे:-',
      '   • स्मोक वार्निंग डिटेक्ट नहीं होगी।',
      '   • MCB 62.1/2 और 63.1/2 ट्रिप होने का पता नहीं चलेगा।'
    ]
  },
  {
    id: 'F1404P2',
    subSystem: 'SS14',
    message: 'Disturbance in Processor\nVCU2-DIP4\n(MEDHA IGBT Loco)',
    lamp: 'BPFA प्रकाशित होगा।',
    effect: 'VCU2-DIP4 डिस्टर्बेंस। सामान्य ऑपरेशन पर कोई प्रतिकूल प्रभाव नहीं।',
    actions: [
      '1. फ़ॉल्ट को लॉग बुक में दर्ज करें तथा सामान्य ऑपरेशन चालू रखें।'
    ]
  },
  {
    id: 'F1405P2',
    subSystem: 'SS14',
    message: 'Disturbance in Processor\nVCU2-DOP1\n(MEDHA IGBT Loco)',
    lamp: 'BPFA प्रकाशित होगा।',
    effect: 'VCU2-DOP1 डिस्टर्बेंस। लैम्प इंडिकेशन काम नहीं करेंगे (TFT पर देखें); पैंटो-2 रेज़ नहीं होगा (स्विच 85 को I पर रखकर पैंटो-1 उठाएं)।',
    actions: [
      '1. फ़ॉल्ट को लॉग बुक में दर्ज करें तथा सामान्य ऑपरेशन चालू रखें।',
      '2. यदि कैब-2 से गाड़ी चला रहे हों तो ZPT को डाउन पोजीशन पर करके पैंटो सिलेक्टर स्विच (85) को "I" पर रखकर ZPT को अप पोजीशन पर करें और पैंटो-1 का रेज़ होना सुनिश्चित करें और सामान्य ऑपरेशन चालू रखें।',
      'निम्न कार्य नहीं होंगे:-',
      '   • लैम्प इंडिकेशन कार्य नहीं करेंगे (लैम्प इंडिकेशन TFT डिस्प्ले यूनिट पर देखे जा सकते हैं)।',
      '   • पैंटो-2 रेज़ नहीं होगा।'
    ]
  },
  {
    id: 'F1406P2',
    subSystem: 'SS14',
    message: 'Disturbance in Processor\nVCU2-DOP2\n(MEDHA IGBT Loco)',
    lamp: 'BPFA प्रकाशित होगा।',
    effect: 'VCU2-DOP2 डिस्टर्बेंस। पैंटो-1 रेज़ नहीं होगा (कैब-1 से चलाने पर स्विच 85 को II पर रखकर पैंटो-2 उठाएं); सैंडिंग वाल्व कार्य नहीं करेंगे।',
    actions: [
      '1. फ़ॉल्ट को लॉग बुक में दर्ज करें।',
      '2. यदि कैब-1 से गाड़ी चला रहे हों तो ZPT को डाउन पोजीशन पर करके पैंटो सिलेक्टर स्विच (85) को "II" पर रखकर ZPT को अप पोजीशन पर करें और पैंटो-2 का रेज़ होना सुनिश्चित करें और सामान्य ऑपरेशन चालू रखें।',
      'निम्न कार्य नहीं होंगे:-',
      '   • पैंटो-1 रेज़ नहीं होगा।',
      '   • सैंडिंग वाल्व कार्य नहीं करेंगे।'
    ]
  },
  {
    id: 'F1407P2',
    subSystem: 'SS14',
    message: 'Disturbance in Processor\nVCU2-DOP3\n(MEDHA IGBT Loco)',
    lamp: 'BPFA प्रकाशित होगा।',
    effect: 'VCU2-DOP3 डिस्टर्बेंस। सामान्य ऑपरेशन पर कोई प्रतिकूल प्रभाव नहीं।',
    actions: [
      '1. फ़ॉल्ट को लॉग बुक में दर्ज करें तथा सामान्य ऑपरेशन चालू रखें।'
    ]
  },
  {
    id: 'F1501P1',
    subSystem: 'SS15',
    message: 'FIRE IN MACHINE ROOM\nExtinguish the fire\nReset the fire detection unit',
    lamp: 'LSFI ब्लिंक करेगी, BPFA प्रकाशित होगा। बजर बजेगा',
    effect: "TE/BE '0' हो जायेगा।",
    actions: [
      'थ्रोटल को "0" पर लाएं और गाडी तुरन्त खडी करें। VCB ओपन करें, पेन्टो लोअर करें तथा कंट्रोल इलेक्ट्रॉनिक्स को ऑफ करें।',
      'सावधानी पूर्वक मशीन रूम की जाँच करें। यदि आग/धुँआ है, MCB 112.1 (SB-2) को ट्रिप करें और छोटे अग्निशामक यंत्र से आग बुझायें।',
      'यदि आग ज्यादा है विशेषत: ट्रैक्शन कनवर्टर में है तो प्रत्येक कैब में सहायक लोको पायलट के पीछे लगे CO-2 टाइप अग्निशामक यंत्र के रेगुलेटर को आपरेट करें, कॉक को खोलें। मशीन रूम का दरवाजा बंद रखें।',
      'इसके बाद SB-2 पैनल पर लगे फायर डिटेक्शन यूनिट पर लगे रिसेट पुश बटन को प्रेस करके रिसेट करें। फिर BPFA द्वारा फॉल्ट एक्नालेज करें।',
      'यदि सभी कुछ सामान्य मिलता है, सामान्यतौर पर ट्रैक्शन चालू करें। TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F1501P2',
    subSystem: 'SS15',
    message: 'FAULT IN FIRE DETECTION UNIT\nNo fire detection, Possible normal operation can continue',
    lamp: 'BPFA प्रकाशित होगा।',
    effect: 'फायर डिटेक्शन यूनिट (FDU) में खराबी। स्वतः आग संसूचन प्रणाली काम नहीं करेगी किंतु गाड़ी का सामान्य परिचालन जारी रखा जा सकता है।',
    actions: [
      '1. थ्रोटल को "0" पर लाएं। BPFA दबाकर फ़ॉल्ट ACK करें।',
      '2. सामान्य ट्रैक्शन चालू करें।',
      '3. मशीन रूम को बार-बार आग या धुएं के लिए चेक करें।',
      '4. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F1502P2',
    subSystem: 'SS15',
    message: 'WARNING SMOKE IN MACHINE ROOM\nInspect machine room\n(मशीन रूम में धुआं)',
    lamp: 'LSFI ब्लिंक करेगी, BPFA प्रकाशित होगा। बजर बजेगा',
    effect: "TE/BE '0' हो जायेगा।",
    actions: [
      '1. थ्रोटल को "0" पर लाएं और गाड़ी तुरंत खड़ी करें। VCB ओपन करें, पैंटो लोअर करें तथा कंट्रोल इलेक्ट्रॉनिक्स को ऑफ़ करें।',
      '2. सावधानी पूर्वक मशीन रूम की जांच करें। यदि आग/धुआं है, MCB 112.1 (SB-2) को ट्रिप करें और छोटे अग्निशामक यंत्र से आग बुझाएं।',
      '3. यदि आग ज्यादा है विशेषतः ट्रैक्शन कनवर्टर में है तो प्रत्येक कैब में सहायक लोको पायलट के पीछे लगे CO-2 टाइप अग्निशामक यंत्र के रेगुलेटर को ऑपरेट करें, कॉक को खोलें। मशीन रूम का दरवाजा बंद रखें।',
      '4. यदि सभी कुछ सामान्य मिलता है, सामान्य तौर पर ट्रैक्शन चालू करें।',
      '5. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F1601P1',
    subSystem: 'SS16',
    message: 'SPEED LIMIT EXCEEDED\nEmergency brakes\nTE/BE Throttle to 0\n(स्पीड लिमिट पार / स्पीडोमीटर)',
    lamp: 'BPFA प्रकाशित होगा, LSFI ब्लिंक करेगी, बजर बजेगा',
    effect: "इमरजेंसी ब्रेक लग जाएंगे (Emergency brakes applied), TE/BE '0' हो जायेगा।",
    actions: [
      '1. लोको की गति कम करने के लिए थ्रोटल को "0" पर लाएं।',
      '2. BPFA दबाकर फ़ॉल्ट ACK करें।',
      '3. जैसे ही गति सीमा के अंदर आ जाती है, तो सामान्य ट्रैक्शन चालू करें।',
      '4. यदि स्पीडोमीटर में गति सीमा के अंदर नहीं आ रही है, परंतु वास्तविक गति कम हो गई है इसका मतलब स्पीडोमीटर खराब हो गया है। लोको पायलट SB-2 में लगे स्पीडोमीटर के MCB 127.92 को ट्रिप करें।',
      '5. अब स्पीडोमीटर आइसोलेट हो गया है इसलिए गाड़ी सावधानीपूर्वक चलाएं तथा सिमुलेशन मोड (Simulation Mode) में गति को देखें।',
      '6. TLC को सूचित करें और आदेशानुसार कार्य करें, लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'F1601P2',
    subSystem: 'SS16',
    message: 'FAULT IN SPEEDOMETER\nNo display of speed in the cab\nDrive carefully, use diagn screen\n(स्पीडोमीटर में ख़राबी / गति का कोई प्रदर्शन नहीं)',
    lamp: 'BPFA प्रकाशित होगा',
    effect: 'कैब में स्पीडोमीटर पर गति प्रदर्शित नहीं होगी (No display of speed in the cab)',
    actions: [
      '1. थ्रोटल को "0" पर लाएं।',
      '2. SB-2 में लगे स्पीडोमीटर के MCB 127.92 को चेक करें। यदि ट्रिप हो तो उसे एक बार रीसेट करें, BPFA दबाकर फ़ॉल्ट ACK करें और यदि लोको सामान्य होता है तो सामान्य ऑपरेशन चालू करें।',
      '3. यदि फ़ॉल्ट बना रहता है तो SB-2 में लगे MCB 127.92 को ट्रिप करके स्पीडोमीटर को आइसोलेट करें।',
      '4. अब स्पीडोमीटर आइसोलेट हो जायेगा। इसलिए सावधानीपूर्वक गाड़ी चलाएं तथा सिमुलेशन मोड (Simulation Mode) में गति को देखें।',
      '5. TLC को सूचित करें और लॉग बुक में दर्ज करें।',
      '6. TLC के आदेशानुसार सामान्य ट्रैक्शन चालू करें।'
    ]
  },
  {
    id: 'F1901P1',
    subSystem: 'SS19',
    message: 'COMMUNICATION DISTURBANCE\nTry to close the VCB again\nMultiple operation not possible\n(कम्युनिकेशन डिस्टर्बेंस / ट्रेन बस)',
    lamp: 'BPFA प्रकाशित होगा, VCB ओपन हो जाएगा',
    effect: 'VCB ओपन हो जाएगा; मल्टीपल ऑपरेशन (MU) संभव नहीं होगा',
    actions: [
      '1. थ्रोटल को "0" पर लाएं। BPFA को दबाकर फ़ॉल्ट को एक्नॉलेज (ACK) करें।',
      '2. VCB क्लोज़ करने के लिए BLDJ प्रेस करें।',
      '3. मल्टीपल ऑपरेशन के लिए दोनों लोको के बीच लगे जम्पर केबल (UIC Jumper Cable / Train Bus) को चेक करें।',
      '4. TLC को सूचित करें और लॉग बुक में दर्ज करें।'
    ]
  },
  {
    id: 'HEADLIGHT-FAIL',
    subSystem: 'SS13',
    message: 'HEADLIGHT FAILURE\nहेडलाइट फ़ेल होने पर\n(MCB 310.1/1 & 310.1/2 / ZPRD / G&SR 4.14)',
    lamp: 'हेडलाइट नहीं जलेगी / बुझ जाएगी',
    effect: 'हेडलाइट प्रकाशित नहीं होगी (Headlight not illuminating)',
    actions: [
      '1. ZPRD (डिमर स्विच) ON करें।',
      '2. यदि डिम हेडलाइट प्रकाशित होती है तो सामान्य रूप से कार्य करें।',
      '3. यदि डिमर भी प्रकाशित नहीं होती है तो:-\n   • यदि Cab-1 से वर्किंग कर रहे हों तो SB-1 में लगी MCB 310.1/1 चेक करें।\n   • यदि Cab-2 से वर्किंग कर रहे हों तो SB-2 में लगी MCB 310.1/2 चेक करें।',
      '4. यदि MCB ट्रिप हो तो VCB ओपन करके MCB को रीसेट करें।',
      '5. यदि सफलता नहीं मिलती है तो मार्कर लाइट (Marker Light) की सहायता से 40 KMPH के गति प्रतिबंध से G & SR 4.14 के अनुसार गाड़ी चलाएं।'
    ]
  }
];
